[{"citationKey":"Robinson2007540","entryType":"article","entryTags":{"title":"Ethnographically-informed empirical studies of software practice ","journal":"Information and Software Technology ","volume":"49","number":"6","pages":"540 - 551","year":"2007","note":"Qualitative Software Engineering Research ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2007.02.007","url":"http://www.sciencedirect.com/science/article/pii/S0950584907000110","author":"Hugh Robinson and Judith Segal and Helen Sharp","keywords":["Software practice","Field studies","Qualitative analysis "],"abstract":"Over the past decade we have performed a sustained series of qualitative studies of software development practice, focusing on social factors. Using an ethnographically-informed approach, we have addressed four areas of software practice: software quality management systems, the emergence of object technology, professional end user development and agile development. Several issues have arisen from this experience, including the nature of research questions that such studies can address, the advantages and challenges associated with being a member of the community under study, and how to maintain rigour in data collection. In this paper, we will draw on our studies to illustrate our approach and to discuss these and other issues. "}},{"citationKey":"Hagan2007397","entryType":"article","entryTags":{"title":"Ascending into order: A reflective analysis from a small open source development team ","journal":"International Journal of Information Management ","volume":"27","number":"6","pages":"397 - 405","year":"2007","note":"","issn":"0268-4012","doi":"http://dx.doi.org/10.1016/j.ijinfomgt.2007.08.011","url":"http://www.sciencedirect.com/science/article/pii/S0268401207001119","author":"Dave Hagan and Owen Watson and Kirk Barron","keywords":["Open Source Software","Agile development","Reflective analysis","Heterarchy","Development methods "],"abstract":"Open Source Software (OSS) has had a profound impact on the way in which software is developed and consequently on the perception of software development. This paper starts with a brief discussion of the eclectic techniques and processes, combinations of which may be used for \\{OSS\\} projects. A 'real-world' context will be examined using 'Reflective Analysis' focusing on the research and development team present within the Business, Logistics and Information Systems (BLIS) department at The University of Bolton. The reflective analysis explores some assumptions inherent in \\{OSS\\} development. Drawing on findings from experience, industry and background research, an attempt will be made to provide an insight into how in a small team, the use of \\{OSS\\} and associated techniques can lead to the successful development of software. Whilst early results show that smaller \\{OSS\\} projects may appear to have little or no formal structure with closer investigation it is clear this is not the case. Without at least some degree of management, the teams experience indicates that such projects may be prone to failure. "}},{"citationKey":"deVries200711","entryType":"article","entryTags":{"title":"Software Testing for security ","journal":"Network Security ","volume":"2007","number":"3","pages":"11 - 15","year":"2007","note":"","issn":"1353-4858","doi":"http://dx.doi.org/10.1016/S1353-4858(07)70027-2","url":"http://www.sciencedirect.com/science/article/pii/S1353485807700272","author":"Stephen de Vries","abstract":"Software testing in the form of unit, integration and acceptance tests are key phases of many development methodologies and particularly favoured by agile development1 proponents. These tests serve to prevent regressions, assist refactoring and of course prove that the software meets the functional requirements. Software tests provide a natural, but often overlooked, opportunity for integrating security early on in the software development lifecycle (SDLC) where identified vulnerabilities can be corrected while development is still ongoing. "}},{"citationKey":"Sherehiy2007445","entryType":"article","entryTags":{"title":"A review of enterprise agility: Concepts, frameworks, and attributes ","journal":"International Journal of Industrial Ergonomics ","volume":"37","number":"5","pages":"445 - 460","year":"2007","note":"","issn":"0169-8141","doi":"http://dx.doi.org/10.1016/j.ergon.2007.01.007","url":"http://www.sciencedirect.com/science/article/pii/S0169814107000236","author":"Bohdana Sherehiy and Waldemar Karwowski and John K. Layer","keywords":["Agility","Agile manufacturing","Agile workforce","Agile enterprise","Adaptive enterprise","Responsiveness","Change "],"abstract":"Existing knowledge about agile manufacturing (AM) and an agile workforce was reviewed in order to extend the concept of agility to the whole enterprise. The frameworks that describe other elements of the enterprise besides manufacturing, or contain attributes that could be applied to all enterprise structures were also included into the review. The review identified a large number of papers related to the AM. However, there was little empirical research done on the agile workforce and agile organization. This review identified the global characteristics of agility which can be applied to all aspects of enterprise: flexibility, responsiveness, speed, culture of change, integration and low complexity, high quality and customized products, and mobilization of core competencies. The need for further research in order to empirically establish and validate the attributes and indices of the agile workforce and agile enterprise has also been discussed. "}},{"citationKey":"Berger2007386","entryType":"article","entryTags":{"title":"Agile development in a bureaucratic arena--A case study experience ","journal":"International Journal of Information Management ","volume":"27","number":"6","pages":"386 - 396","year":"2007","note":"","issn":"0268-4012","doi":"http://dx.doi.org/10.1016/j.ijinfomgt.2007.08.009","url":"http://www.sciencedirect.com/science/article/pii/S0268401207001028","author":"Hilary Berger","keywords":["Agile development","Bureaucracy","Stakeholders","Conflict "],"abstract":"The evolving nature of development approaches towards Agile development is viewed with some success. However, evidence suggests that not all development environments have evolved with the same alacrity, thus an organization's inherent culture may not match the development approach adopted effecting failure. This paper concerns an innovative, real-world Government \\{IS\\} project that is currently being implemented in the \\{UK\\} that reflects such a situation. The paper looks at the tension that transpired between the bureaucratic project arena and the Agile development approach. It examines stakeholders' behaviour and attitudes borne from a bureaucratic and hierarchical society that were problematic for Agile development. It further explores the issues of conflict and trust that prevented key stakeholders from building and fostering a collaborative and co-operative collective with the Developers that had significant impact. The case study provides evidential insights into the phenomenon of stakeholder control over critical decision-making activities that prevailed over organizational driven strategies that has implications for practice. "}},{"citationKey":"SONG2007115","entryType":"article","entryTags":{"title":"Study on the agile supply chain management based on agent ","journal":"The Journal of China Universities of Posts and Telecommunications ","volume":"14, Supplement 1","number":"","pages":"115 - 118","year":"2007","note":"","issn":"1005-8885","doi":"http://dx.doi.org/10.1016/S1005-8885(08)60024-2","url":"http://www.sciencedirect.com/science/article/pii/S1005888508600242","author":"Ming SONG and Rui-xue FU and Chen ZHU and Zhan-hong XIN","keywords":["agile supply chain management","multi-agent system","supply network agent","TN915.01 "],"abstract":"The most important task of the agile supply chain management (ASCM) is to reconfigure a supply chain based on the customers' requirement. Without more sophisticated cooperation and dynamic formation in an agile supply chain, it cannot be achieved for mass customization, rapid response and high quality services. Because of its great potential in supporting cooperation for the supply chain management, agent technology can carry out the cooperative work by inter-operation across networked human, organization and machines at the abstractive level in a computational system. A major challenge in building such a system is to coordinate the behavior of individual agent or a group of agents to achieve the individual and shared goals of the participants. In this paper, the agent technology is used to support modeling and coordinating of supply chain management. "}},{"citationKey":"Somov2007533","entryType":"article","entryTags":{"title":"\\{GUIDANCE\\} \\{AND\\} \\{ROBUST\\} \\{GYROMOMENT\\} \\{ATTITUDE\\} \\{CONTROL\\} \\{OF\\} \\{AGILE\\} \\{FLEXIBLE\\} \\{REMOTE\\} \\{SENSING\\} \\{SPACECRAFT\\} ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"40","number":"7","pages":"533 - 538","year":"2007","note":"17th \\{IFAC\\} Symposium on Automatic Control in Aerospace ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20070625-5-FR-2916.00091","url":"http://www.sciencedirect.com/science/article/pii/S1474667015332973","author":"Ye. Somov and S. Butyrin and S. Somov and G. Anshakov","keywords":["agile spacecraft","guidance","robust attitude control "],"abstract":"Abstract Some problems on guidance and robust gyromoment motion control of agile spacecraft (SC) for remote sensing the Earth surface are considered. Elaborated methods for dynamic research of the \\{SC\\} programmed angular motion at principle modes under external, structural and parametric disturbances, partial discrete measurement of the state and digital control of the gyro moment cluster (GMC) by the minimum-excessive gyrodine scheme, are presented. "}},{"citationKey":"Somov2007203","entryType":"article","entryTags":{"title":"GUIDANCE, \\{ONBOARD\\} \\{SIGNAL\\} \\{PROCESSING\\} \\{AND\\} \\{ROBUST\\} \\{CONTROL\\} \\{OF\\} \\{AGILE\\} \\{FLEXIBLE\\} \\{REMOTE\\} \\{SENSING\\} \\{SPACECRAFT\\} ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"40","number":"13","pages":"203 - 208","year":"2007","note":"9th \\{IFAC\\} Workshop on Adaptation and Learning in Control and Signal Processing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20070829-3-RU-4911.00033","url":"http://www.sciencedirect.com/science/article/pii/S1474667015320176","author":"Ye.I. Somov and S.A. Butyrin and S.Ye. Somov","keywords":["agile spacecraft","guidance","robust attitude control "],"abstract":"Abstract Problems on guidance, onboard signal processing and robust gyromoment motion control of agile spacecraft (SC) for the Earth remote sensing and for the flexible payload transportation, are considered. Elaborated methods for dynamic research of the \\{SC\\} angular motion at principle modes under external and parametric disturbances, partial discrete measurement of the state, multiple filtering and digital control by the gyro moment cluster, are presented "}},{"citationKey":"Thieuw2007834","entryType":"article","entryTags":{"title":"PLEIADES-HR CMGs-BASED \\{ATTITUDE\\} \\{CONTROL\\} \\{SYSTEM\\} DESIGN, \\{DEVELOPMENT\\} \\{STATUS\\} \\{AND\\} \\{PERFORMANCES\\} ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"40","number":"7","pages":"834 - 839","year":"2007","note":"17th \\{IFAC\\} Symposium on Automatic Control in Aerospace ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20070625-5-FR-2916.00142","url":"http://www.sciencedirect.com/science/article/pii/S1474667015333486","author":"Alain Thieuw and Herve Marcille","keywords":["Actuators","Agile Control","Attitude Control","Closed-loop Control","Control Algorithms","Dynamics","Guidance Systems","Satellite Control","Validation "],"abstract":"Abstract Pleiades High Resolution Programme aims at realising a new class of optical observation system, characterised by imaging performances in the range of one meter resolution, large image fields and increased agility. The main feature of the Attitude Control System (ACS) is to rely on a new type of actuator: a cluster of 4 Control Moment Gyros (CMGs). The use of \\{CMGs\\} allows to reach high agility performances to meet the requirements induced by demanding imaging missions. This paper presents the design, development status and performances of the Pleiades-HR \\{ACS\\} based on a CMGs-cluster. "}},{"citationKey":"Zhang2007266","entryType":"article","entryTags":{"title":"Agile Integration Modeling Language (AIML): A conceptual modeling grammar for agile integrative business information systems ","journal":"Decision Support Systems ","volume":"44","number":"1","pages":"266 - 284","year":"2007","note":"","issn":"0167-9236","doi":"http://dx.doi.org/10.1016/j.dss.2007.04.009","url":"http://www.sciencedirect.com/science/article/pii/S0167923607000693","author":"Hong Zhang and Rajiv Kishore and Raj Sharman and Ram Ramesh","keywords":["Conceptual modeling grammar","Systems modeling","Requirements specifications","Role-based modeling","Multiagent systems modeling","Integrative business information systems modeling "],"abstract":"The proliferation of newer agile integrative business information systems (IBIS) environments that use the software agent and the multiagent systems paradigms has created the need for a common and well-accepted conceptual modeling grammar that can be used to efficiently, precisely, and unambiguously, model agile \\{IBIS\\} systems at the conceptual level. In this paper, we propose a conceptual modeling grammar termed Agile Integration Modeling Language (AIML) based on established ontological foundation for the multiagent-based integrative business information systems (MIBIS) universe. The \\{AIML\\} grammar provides adequate and precise constructs and semantics for modeling agile integration among participating work systems in terms of quickly building and dismantling dynamic collaboration relationships among them to respond to fast-changing market needs. The \\{AIML\\} grammar is defined as a formal model using Extended \\{BNF\\} and first order logic, and is elaborated using a running example in the paper. The grammar is also evaluated in terms of its syntactic, semantic, and pragmatic qualities and is found to exhibit a high degree of quality on all these three dimensions. In particular, the pragmatic quality of \\{AIML\\} measured in terms of grammar complexity evaluated using complexity metrics indicates that \\{AIML\\} is much easier to learn and use as compared to the Unified Modeling Language (UML) for modeling agile integration of work systems in organizations. "}},{"citationKey":"Feroci2007728","entryType":"article","entryTags":{"title":"SuperAGILE: The hard X-ray imager for the \\{AGILE\\} space mission ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"581","number":"3","pages":"728 - 754","year":"2007","note":"","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2007.07.147","url":"http://www.sciencedirect.com/science/article/pii/S016890020701649X","author":"M. Feroci and E. Costa and P. Soffitta and E. Del Monte and G. Di Persio and I. Donnarumma and Y. Evangelista and M. Frutti and I. Lapshov and F. Lazzarotto and M. Mastropietro and E. Morelli and L. Pacciani and G. Porrovecchio and M. Rapisarda and A. Rubini and M. Tavani and A. Argan","keywords":["High energy astrophysics","X-ray detectors","Microstrip detectors","Coded mask imaging "],"abstract":"SuperAGILE is a coded mask experiment based on silicon microstrip detectors. It operates in the 15-45 keV nominal energy range, providing crossed one-dimensional images of the X-ray sky with an on-axis angular resolution of 6 arcmin, over a field of view in excess of 1 sr. It was designed as the hard X-ray monitor of the \\{AGILE\\} space mission, a small satellite of the Italian Space Agency devoted to image the gamma-ray sky in the 30 MeV-50 GeV energy band. The \\{AGILE\\} mission was launched in a low-earth orbit on 23rd April 2007. In this paper we describe the SuperAGILE experiment, its construction and test processes, and its performance before flight, based on the on-ground test and calibrations. "}},{"citationKey":"Barata2007116","entryType":"article","entryTags":{"title":"A \\{MULTIAGENT\\} \\{BASED\\} \\{CONTROL\\} \\{SYSTEM\\} \\{FOR\\} \\{AN\\} \\{ASSEMBLY\\} \\{CELL\\} ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"40","number":"3","pages":"116 - 121","year":"2007","note":"8th \\{IFAC\\} Workshop on Intelligent Manufacturing Systems ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20070523-3-ES-4908.00020","url":"http://www.sciencedirect.com/science/article/pii/S1474667015403362","author":"Jose Barata and Goncalo Candido and Armando Colombo","abstract":"Abstract The main goal of this paper is to describe a multiagent based control architecture applied to a complex assembly cell in order to prove that the multiagent paradigm is a good alternative to develop agile control systems. By implementing the architecture we want to prove that it can be used for adequately solve requirements of: modularity, promote configuration rather than reprogramming, support various products simultaneously, and legacy controllers integration. "}},{"citationKey":"Pacciani2007330","entryType":"article","entryTags":{"title":"SuperAGILE onboard electronics and ground test instrumentation ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"574","number":"2","pages":"330 - 341","year":"2007","note":"","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2007.02.073","url":"http://www.sciencedirect.com/science/article/pii/S0168900207004159","author":"Luigi Pacciani and Ennio Morelli and Alda Rubini and Marcello Mastropietro and Geiland Porrovecchio and Enrico Costa and Ettore Del Monte and Immacolata Donnarumma and Yuri Evangelista and Marco Feroci and Francesco Lazzarotto and Massimo Rapisarda and Paolo Soffitta","keywords":["Coded mask","Silicon microstrip","Test instrumentation","X-ray imager","Gamma Ray Bursts "],"abstract":"In this paper we describe the electronics of the SuperAGILE X-ray imager on-board \\{AGILE\\} satellite and the instrumentation developed to test and improve the Front-End and digital electronics of the flight model of the imager. Although the working principle of the instrument is very well established, and the conceptual scheme simple, the budget and mechanical constraints of the \\{AGILE\\} small mission made necessary the introduction of new elements in SuperAGILE, regarding both the mechanics and the electronics. In fact the instrument is contained in a [?] 44 x 44 x 16 cm 3 volume, but the required performance is quite ambitious, leading us to equip a sensitive area of [?] 1350 cm 2 with 6144 Silicon m strips detectors with a pitch of 121 m m and a total length of [?] 18.2 cm . The result is a very light and power-cheap imager with a good sensitivity ( [?] 15 m Crab in 1 day in 15 - 45 keV ), high angular resolution ( 6 arcmin ) and gross spectral resolution. The test-equipment is versatile, and can be easily modified to test \\{FEE\\} based on self-triggered, data-driven and sparse-readout \\{ASICs\\} such as \\{XA\\} family chips. "}},{"citationKey":"Carpanzano2007435","entryType":"article","entryTags":{"title":"Advanced Automation Solutions for Future Adaptive Factories ","journal":"\\{CIRP\\} Annals - Manufacturing Technology ","volume":"56","number":"1","pages":"435 - 438","year":"2007","note":"","issn":"0007-8506","doi":"http://dx.doi.org/10.1016/j.cirp.2007.05.104","url":"http://www.sciencedirect.com/science/article/pii/S0007850607001059","author":"E. Carpanzano and F. Jovane","keywords":["Factory","Reconfigurable","Automation "],"abstract":"Factories of the future must be capable to adapt themselves to continuously changing market demand. Therefore new manufacturing technologies are needed: from agile operating machines up to internet based services. In particular, new advanced automation solutions, that integrate all factory levels in a unique real time framework, are mandatory. Nowadays, neither accepted standards nor assessed development methodologies and software environments are available to support industries when facing such a crucial issue. In the present contribution an open and modular automation system architecture is proposed, based on emerging modelling paradigms and recent international standards. Furthermore, a methodology to develop self-adaptive factory automation solutions is illustrated, using a novel modular simulation based method to verify digitally - through a modular bottom up approach - the correctness of real size automation systems. The proposed framework has been applied to a highly innovative reconfigurable factory for personalised shoes production. Such a real-size industrial application proves the effectiveness and the benefits of the presented methods for the development of complex automation solutions for high value added production systems. "}},{"citationKey":"Zhou2007285","entryType":"article","entryTags":{"title":"Endocranial morphology of psittacosaurs (Dinosauria: Ceratopsia) based on \\{CT\\} scans of new fossils from the Lower Cretaceous, China ","journal":"Palaeoworld ","volume":"16","number":"4","pages":"285 - 293","year":"2007","note":"","issn":"1871-174X","doi":"http://dx.doi.org/10.1016/j.palwor.2007.07.002","url":"http://www.sciencedirect.com/science/article/pii/S1871174X07000248","author":"Chang-Fu Zhou and Ke-Qin Gao and Richard C. Fox and Xiang-Ke Du","keywords":["Psittacosaurus","Ceratopsian dinosaurs","Palaeoneurology","Behaviour "],"abstract":"Psittacosaurs, small basal ceratopsians with a parrot-like beak, are among the most abundant dinosaurs, but occur only in the Early Cretaceous of East Asia. Although the general morphology of psittacosaurs is fairly well understood, the endocranial anatomy of the group has never been described. New discoveries of well-preserved skulls from the celebrated Liaoning beds in northeastern China provide the material for conducting research on psittacosaur endocranial morphology. Using computed tomography scans of three-dimensionally preserved skulls, this study reveals basic endocranial anatomy of psittacosaurs and provides the first palaeoneurological evidence of psittacosaurs in relation to their behaviour. Although commonly believed to have had a small brain and small eyes, psittacosaurs had relatively high brain/body size ratios that are comparable to those in the large theropod Tyrannosaurus, and probably had a keen sense of smell and acute vision, as evidenced by their enlarged olfactory lobes and bulbous optic lobes. The configuration of the semicircular canals agrees with limb proportions to suggest that psittacosaurs were agile animals, perhaps better able to escape predation by carnivorous dinosaurs on that account. The behavioural adaptations implied by this study may have been crucial for the successful radiation of psittacosaurs during the Early Cretaceous of East Asia. "}},{"citationKey":"Gryspolakis2007168","entryType":"article","entryTags":{"title":"Response of fibre optic parametric amplifiers to channel add/drop in agile all-photonic networks ","journal":"Optics Communications ","volume":"278","number":"1","pages":"168 - 174","year":"2007","note":"","issn":"0030-4018","doi":"http://dx.doi.org/10.1016/j.optcom.2007.05.056","url":"http://www.sciencedirect.com/science/article/pii/S0030401807005470","author":"Nikolaos Gryspolakis and Lawrence R. Chen","keywords":["Fibre optical parametric amplifier","Gain dynamics","Transient behaviour of amplifiers","Gain tilt","Wavelength-division-multiplexing "],"abstract":"Using numerical simulations, we investigate the performance of fibre optical parametric amplifiers (FOPAs) within the context of agile, multi-wavelength photonic networks. In particular, we study the steady-state and dynamic response of \\{FOPAs\\} following changes in network operating conditions. These include changes in the gain spectrum (gain tilt) due to variations in the total input power to the amplifier or as a result of channel add/drop, as well as the characteristics of the gain transients following channel add/drop. Initially, we examine the worst case scenario where all channels are in-phase and exactly equispaced. We compare these results with the ones obtained for random initial phases and inexact channel spacings. We find that the complex nature of the interactions occurring in a \\{FOPA\\} make it very difficult to predict their behaviour a priori and their deployment in \\{WDM\\} systems will require special attention. Moreover, we confirm that unequal spacing can vastly improve the performance of multichannel FOPAs. "}},{"citationKey":"Huang20075011","entryType":"article","entryTags":{"title":"Spare capacity provisioning for quasi-static traffic ","journal":"Computer Networks ","volume":"51","number":"18","pages":"5011 - 5035","year":"2007","note":"","issn":"1389-1286","doi":"http://dx.doi.org/10.1016/j.comnet.2007.08.006","url":"http://www.sciencedirect.com/science/article/pii/S1389128607002307","author":"Shu Huang and Rudra Dutta","keywords":["Networking","Optical networking","Resource provisioning","Overprovisioning","Reconfiguration "],"abstract":"Resource provisioning has for long been an important area of research in network design. The traffic grooming problem in optical networks is a design problem of aggregating sub-wavelength traffic demands onto lightpaths and lightpaths onto fiber links such that the required electronic switching capability, hence network cost, can be minimized. Because of the reconfiguration cost in optical grooming networks, a reactive resource provisioning approach may become inefficient, and result in revenue loss. In this paper, we propose an over-provisioning scheme, which pre-allocates the spare capacity of lightpaths to dynamic sub-wavelength traffic demands such that the network can be more agile in responding to traffic increment requests. For the single-link case, we formulate the problem as a non-linear programming problem, and for under reasonable assumptions, we prove the objective function is convex. We provide an exact algorithm to find the optimal solution. The problem with general topologies is then studied. We prove the NP-hardness in this case, and propose heuristics. Numerical results show our heuristics perform well. "}},{"citationKey":"Silva2007232","entryType":"article","entryTags":{"title":"Interpreting \\{IS\\} alignment: A multiple case study in professional organizations ","journal":"Information and Organization ","volume":"17","number":"4","pages":"232 - 265","year":"2007","note":"","issn":"1471-7727","doi":"http://dx.doi.org/10.1016/j.infoandorg.2007.08.001","url":"http://www.sciencedirect.com/science/article/pii/S1471772707000310","author":"Leiser Silva and Eugenio Figueroa B. and Jennifer Gonzalez-Reinhart","keywords":["Information systems strategic alignment","Strategy","Developing countries","Critique","Latin America","Chile","Professional organizations","Public organizations","Interpretive studies","Managerial","Emergent","Critical theory","Critical studies","Professional and entrepreneurial organizations "],"abstract":"This paper centers on the interpretation attributed by organizational members to the information systems (IS) alignment concept. Its objective is to study \\{IS\\} alignment in professional organizations. Specifically, it reports on an interpretive study conducted in five Chilean organizations; four professional and one entrepreneurial, of which two are private and three are public. The theoretical background of our study is derived from three \\{IS\\} strategic alignment conceptualizations: managerial, emergent and critical. These concepts formed our theoretical framework that guided data collection and analysis. The study centers on the meanings organizational members assigned to \\{IS\\} strategic alignment, as well as their views on the barriers that hinder achieving this level of organizational integration. The analysis results are summarized in seven hermeneutic themes that point out the different connotations the organizations assigned to \\{IS\\} alignment. The significance of the findings are summarized in four insights that formulate theoretical and practical implications. These insights refer to: (1) the difficulties of achieving alignment for professional organizations, particularly public ones, (2) the limitations these organizations have in being agile, (3) the rationale for acquiring technology and determining \\{IT\\} skills, and (4) the imperative meaning that \\{CIOs\\} attribute to \\{IS\\} alignment. The paper concludes with a reflection on the limitations and relevance of the research. "}},{"citationKey":"McAvoy2007552","entryType":"article","entryTags":{"title":"The impact of the Abilene Paradox on double-loop learning in an agile team ","journal":"Information and Software Technology ","volume":"49","number":"6","pages":"552 - 563","year":"2007","note":"Qualitative Software Engineering Research ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2007.02.012","url":"http://www.sciencedirect.com/science/article/pii/S0950584907000146","author":"John McAvoy and Tom Butler","keywords":["\\{XP\\} adoption","Triple-loop learning","Social factors","Qualitative approach","Participant observation "],"abstract":"This paper presents a qualitative investigation of learning failures associated with the introduction of a new software development methodology by a project team. This paper illustrates that learning is more than the cognitive process of acquiring a new skill; learning also involves changes in behaviour and even beliefs. Extreme Programming (XP), like other software development methodologies, provides a set of values and guidelines as to how software should be developed. As these new values and guidelines involve behavioural changes, the study investigates the introduction of \\{XP\\} as a new learning experience. Researchers use the concepts of single and double-loop learning to illustrate how social actors learn to perform tasks effectively and to determine the best task to perform. The concept of triple-loop learning explains how this learning process can be ineffective, accordingly it is employed to examine why the introduction of \\{XP\\} was ineffective in the team studied. While \\{XP\\} should ideally foster double-loop learning, triple-loop learning can explain why this does not necessarily occur. Research illustrates how power factors influence learning among groups of individuals; this study focuses on one specific power factor - the power inherent in the desire to conform. The Abilene Paradox describes how groups can make ineffective decisions that are contrary to that which group members personally desire or believe. Ineffective decision-making occurs due to the desire to conform among group members; this was shown as the cause of ineffective learning in the software team studied. This desire to conform originated in how the project team cohered as a group, which was, in turn, influenced by the social values embraced by XP. "}}]