[{"citationKey":"Dyba2008833","entryType":"article","entryTags":{"title":"Empirical studies of agile software development: A systematic review ","journal":"Information and Software Technology ","volume":"50","number":"9-10","pages":"833 - 859","year":"2008","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2008.01.006","url":"http://www.sciencedirect.com/science/article/pii/S0950584908000256","author":"Tore Dyba and Torgeir Dingsoyr","keywords":["Empirical software engineering","Evidence-based software engineering","Systematic review","Research synthesis","Agile software development","XP","Extreme programming","Scrum "],"abstract":"Agile software development represents a major departure from traditional, plan-based approaches to software engineering. A systematic review of empirical studies of agile software development up to and including 2005 was conducted. The search strategy identified 1996 studies, of which 36 were identified as empirical studies. The studies were grouped into four themes: introduction and adoption, human and social factors, perceptions on agile methods, and comparative studies. The review investigates what is currently known about the benefits and limitations of, and the strength of evidence for, agile methods. Implications for research and practice are presented. The main implication for research is a need for more and better empirical studies of agile software development within a common research agenda. For the industrial readership, the review provides a map of findings, according to topic, that can be compared for relevance to their own settings and situations. "}},{"citationKey":"Chow2008961","entryType":"article","entryTags":{"title":"A survey study of critical success factors in agile software projects ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"961 - 971","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.08.020","url":"http://www.sciencedirect.com/science/article/pii/S0164121207002208","author":"Tsun Chow and Dac-Buu Cao","keywords":["Software development","Agile methods","Critical success factors "],"abstract":"While software is so important for all facets of the modern world, software development itself is not a perfect process. Agile software engineering methods have recently emerged as a new and different way of developing software as compared to the traditional methodologies. However, their success has mostly been anecdotal, and research in this subject is still scant in the academic circles. This research study was a survey study on the critical success factors of Agile software development projects using quantitative approach. Based on existing literature, a preliminary list of potential critical success factors of Agile projects were identified and compiled. Subsequently, reliability analysis and factor analysis were conducted to consolidate this preliminary list into a final set of 12 possible critical success factors for each of the four project success categories - Quality, Scope, Time, and Cost. A survey was conducted among Agile professionals, gathering survey data from 109 Agile projects from 25 countries across the world. Multiple regression techniques were used, both at the full regression model and at the optimized regression model via the stepwise screening procedure. The results revealed that only 10 out of 48 hypotheses were supported, identifying three critical success factors for Agile software development projects: (a) Delivery Strategy, (b) Agile Software Engineering Techniques, and (c) Team Capability. Limitations of the study are discussed together with interpretations for practitioners. To ensure success of their projects, managers are urged to focus on choosing a high-caliber team, practicing Agile engineering techniques and following Agile-style delivery strategy. "}},{"citationKey":"Hanssen2008843","entryType":"article","entryTags":{"title":"Process fusion: An industrial case study on agile software product line engineering ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"843 - 854","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.10.025","url":"http://www.sciencedirect.com/science/article/pii/S0164121207002518","author":"Geir K. Hanssen and Tor E. Faegri","keywords":["Software product development","Software product management","Software product line engineering","Agile software development "],"abstract":"This paper presents a case study of a software product company that has successfully integrated practices from software product line engineering and agile software development. We show how practices from the two fields support the company's strategic and tactical ambitions, respectively. We also discuss how the company integrates strategic, tactical and operational processes to optimize collaboration and consequently improve its ability to meet market needs, opportunities and challenges. The findings from this study are relevant to software product companies seeking ways to balance agility and product management. The findings also contribute to research on industrializing software engineering. "}},{"citationKey":"RizwanJameelQureshi2008654","entryType":"article","entryTags":{"title":"An adaptive software development process model ","journal":"Advances in Engineering Software ","volume":"39","number":"8","pages":"654 - 658","year":"2008","note":"","issn":"0965-9978","doi":"http://dx.doi.org/10.1016/j.advengsoft.2007.08.001","url":"http://www.sciencedirect.com/science/article/pii/S0965997807001603","author":"M. Rizwan Jameel Qureshi and S.A. Hussain","keywords":["XP","Adaptive software development","SDLC","OSSD","CBD "],"abstract":"The concept of agile process models has gained great popularity in software (SW) development community in past few years. Agile models promote fast development. This property has certain drawbacks, such as poor documentation and bad quality. Fast development promotes use of agile process models in small-scale projects. This paper modifies and evaluates extreme programming (XP) process model and proposes a novel adaptive process mode based on these modifications. "}},{"citationKey":"SalazarTorres2008856","entryType":"article","entryTags":{"title":"Design issues for knowledge artifacts ","journal":"Knowledge-Based Systems ","volume":"21","number":"8","pages":"856 - 867","year":"2008","note":"","issn":"0950-7051","doi":"http://dx.doi.org/10.1016/j.knosys.2008.03.058","url":"http://www.sciencedirect.com/science/article/pii/S0950705108000944","author":"G. Salazar-Torres and E. Colombo and F.S. Correa Da Silva and C.A. Noriega and S. Bandini","keywords":["Knowledge artifacts","Knowledge-based systems","Ontologies","Knowledge management","Agile software development "],"abstract":"The notion of knowledge artifact has rapidly gained popularity in the fields of general knowledge management and more recently knowledge-based systems. The main goal on this paper is to propose and discuss a methodology for the design and implementation of knowledge-based systems founded on knowledge artifacts. We advocate that the systems built according to this methodology can be effective to convey the flow of knowledge between different communities of practice. Our methodology has been developed from the ground up, i.e. we have built some concrete systems based on the abstract notion of knowledge artifact and synthesized our methodology based on reflections upon our experiences building these systems. In this paper, we also describe the most relevant systems we have built and how they have guided us to the synthesis of our proposed methodology. "}},{"citationKey":"Qumer20081899","entryType":"article","entryTags":{"title":"A framework to support the evaluation, adoption and improvement of agile methods in practice ","journal":"Journal of Systems and Software ","volume":"81","number":"11","pages":"1899 - 1919","year":"2008","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.12.806","url":"http://www.sciencedirect.com/science/article/pii/S0164121208000113","author":"A. Qumer and B. Henderson-Sellers","keywords":["Agile methodologies","Framework","Transition to agile","Industry case studies "],"abstract":"Agile methods are often seen as providing ways to avoid overheads typically perceived as being imposed by traditional software development environments. However, few organizations are psychologically or technically able to take on an agile approach rapidly and effectively. Here, we describe a number of approaches to assist in such a transition. The Agile Software Solution Framework (ASSF) provides an overall context for the exploration of agile methods, knowledge and governance and contains an Agile Toolkit for quantifying part of the agile process. These link to the business aspects of software development so that the business value and agile process are well aligned. Finally, we describe how these theories are applied in practice with two industry case studies using the Agile Adoption and Improvement Model (AAIM). "}},{"citationKey":"Noor2008868","entryType":"article","entryTags":{"title":"Agile product line planning: A collaborative approach and a case study ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"868 - 882","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.10.028","url":"http://www.sciencedirect.com/science/article/pii/S0164121207002531","author":"Muhammad A. Noor and Rick Rabiser and Paul Grunbacher","keywords":["Product line engineering","Agile methods","Collaboration engineering","Product line planning "],"abstract":"Agile methods and product line engineering (PLE) have both proven successful in increasing customer satisfaction and decreasing time to market under certain conditions. Key characteristics of agile methods are lean and highly iterative development with a strong emphasis on stakeholder involvement. \\{PLE\\} leverages reuse through systematic approaches such as variability modeling or product derivation. Integrating agile approaches with product line engineering is an interesting proposition which - not surprisingly - entails several challenges: Product lines (PL) rely on complex plans and models to ensure their long-term evolution while agile methods emphasize simplicity and short-term value-creation for customers. When incorporating agility in product line engineering, it is thus essential to define carefully how agile principles can support particular \\{PLE\\} processes. For instance, the processes of defining and setting up a product line (domain engineering) and deriving products (application engineering) differ significantly in practices and focus with implications on the suitability of agile principles. This paper presents practical experiences of adopting agile principles in product line planning (a domain engineering activity). ThinkLets, i.e., collaborative practices from the area of collaboration engineering, are the building blocks of the presented approach as they codify agile principles such as stakeholder involvement, rapid feedback, or value-based prioritization. We discuss how our approach balances agility and the intrinsic needs of product line planning. A case study carried out with an industrial partner indicates that the approach is practicable, usable, and useful. "}},{"citationKey":"Trinidad2008883","entryType":"article","entryTags":{"title":"Automated error analysis for the agilization of feature modeling ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"883 - 896","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.10.030","url":"http://www.sciencedirect.com/science/article/pii/S0164121207002543","author":"P. Trinidad and D. Benavides and A. Duran and A. Ruiz-Cortes and M. Toro","keywords":["Feature models","Agile methods","Error analysis","Theory of diagnosis","Constraint programming "],"abstract":"Software Product Lines (SPL) and agile methods share the common goal of rapidly developing high-quality software. Although they follow different approaches to achieve it, some synergies can be found between them by (i) applying agile techniques to \\{SPL\\} activities so \\{SPL\\} development becomes more agile; and (ii) tailoring agile methodologies to support the development of SPL. Both options require an intensive use of feature models, which are usually strongly affected by changes on requirements. Changing large-scale feature models as a consequence of changes on requirements is a well-known error-prone activity. Since one of the objectives of agile methods is a rapid response to changes in requirements, it is essential an automated error analysis support in order to make \\{SPL\\} development more agile and to produce error-free feature models. As a contribution to find the intended synergies, this article sets the basis to provide an automated support to feature model error analysis by means of a framework which is organized in three levels: a feature model level, where the problem of error treatment is described; a diagnosis level, where an abstract solution that relies on Reiter's theory of diagnosis is proposed; and an implementation level, where the abstract solution is implemented by using Constraint Satisfaction Problems (CSP). To show an application of our proposal, a real case study is presented where the Feature-Driven Development (FDD) methodology is adapted to develop an SPL. Current proposals on error analysis are also studied and a comparison among them and our proposal is provided. Lastly, the support of new kinds of errors and different implementation levels for the proposed framework are proposed as the focus of our future work. "}},{"citationKey":"Karam2008855","entryType":"article","entryTags":{"title":"A product-line architecture for web service-based visual composition of web applications ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"855 - 867","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2007.10.031","url":"http://www.sciencedirect.com/science/article/pii/S016412120700252X","author":"Marcel Karam and Sergiu Dascalu and Haidar Safa and Rami Santina and Zeina Koteich","keywords":["Product line engineering","Product line architecture","Agile methods","Web services","Visual languages "],"abstract":"A web service-based web application (WSbWA) is a collection of web services or reusable proven software parts that can be discovered and invoked using standard Internet protocols. The use of these web services in the development process of \\{WSbWAs\\} can help overcome many problems of software use, deployment and evolution. Although the cost-effective software engineering of \\{WSbWAs\\} is potentially a very rewarding area, not much work has been done to accomplish short time to market conditions by viewing and dealing with \\{WSbWAs\\} as software products that can be derived from a common infrastructure and assets with a captured specific abstraction in the domain. Both Product Line Engineering (PLE) and Agile Methods (AMs), albeit with different philosophies, are software engineering approaches that can significantly shorten the time to market and increase the quality of products. Using the \\{PLE\\} approach we built, at the domain engineering level, a WSbWA-specific lightweight product-line architecture and combined it, at the application engineering level, with an Agile Method that uses a domain-specific visual language with direct manipulation and extraction capabilities of web services to perform customization and calibration of a product or \\{WSBWA\\} for a specific customer. To assess the effectiveness of our approach we designed and implemented a tool that we used to investigate the return on investment of the activities related to \\{PLE\\} and AMs. Details of our proposed approach, the related tool developed, and the experimental study performed are presented in this article together with a discussion of planned directions of future work. "}},{"citationKey":"Zheng2008254","entryType":"article","entryTags":{"title":"A web-based machining parameter selection system for life cycle cost reduction and product quality enhancement ","journal":"Computers in Industry ","volume":"59","number":"2-3","pages":"254 - 261","year":"2008","note":"Product Lifecycle Modelling, Analysis and Management ","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2007.06.009","url":"http://www.sciencedirect.com/science/article/pii/S016636150700108X","author":"L. Zheng and X.M. Yang and Z.H. Zhang and T.I. Liu","keywords":["Machining parameter selection","Agile turning "],"abstract":"A web-based machining parameter selection system for agile turning has been developed. Using this system, the users can select adequate machine tools, cutters, and cutting parameters for the turning process. The users can also evaluate the machining performance by obtaining the turning force, power consumption, vibration status, and workpiece distortion from this system. Engineers at geographically distributed sites, which are connected by the Internet using a standard browser, can use this system to realize process planning and optimization. This web-based machining parameter selection system for agile turning can shorten the product life cycle cost, enhance the product quality, and decrease the product lead-time significantly. "}},{"citationKey":"Gaafar2008707","entryType":"article","entryTags":{"title":"A particle swarm-based genetic algorithm for scheduling in an agile environment ","journal":"Computers & Industrial Engineering ","volume":"55","number":"3","pages":"707 - 720","year":"2008","note":"","issn":"0360-8352","doi":"http://dx.doi.org/10.1016/j.cie.2008.01.020","url":"http://www.sciencedirect.com/science/article/pii/S0360835208000521","author":"Lotfi K. Gaafar and Sherif A. Masoud and Ashraf O. Nassef","keywords":["Scheduling","Genetic algorithms","Particle swarm optimization","Agile manufacturing","Digraph "],"abstract":"In this paper, genetic algorithms are applied to the scheduling of a manufacturing system that is designed to support an assembly-driven differentiation strategy in the context of agile manufacturing. The system consists of a single flexible machine followed by multiple identical assembly stations. The objective of the scheduling problem is to minimize the makespan. A modified version of the genetic algorithm, inspired by the particle swarm optimization approach, is applied to the problem in addition to the general application of genetic algorithms. The objective is to investigate the potential that the particle swarm optimization concepts may have in improving the performance of genetic algorithms when applied to the chosen problem. The performance of these algorithms is compared to existing heuristics in the literature. A 23 factorial experiment, replicated twice, is used to compare the performance of the various approaches and identify the significant factors that affect the average percentage deviation from a lower bound. The results show that both versions of genetic algorithms applications outperform the existing heuristics in many instances and provide schedules that are shorter by as much as 15.5% in the cases considered. In addition, the modified application of genetic algorithms outperforms the regular application with shorter schedules by as much as 3.6% in many instances. "}},{"citationKey":"Huang2008219","entryType":"article","entryTags":{"title":"ppXML: A generic and extensible language for lifecycle modelling of platform products ","journal":"Computers in Industry ","volume":"59","number":"2-3","pages":"219 - 230","year":"2008","note":"Product Lifecycle Modelling, Analysis and Management ","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2007.06.018","url":"http://www.sciencedirect.com/science/article/pii/S0166361507001054","author":"George Q. Huang and Li Li and X. Chen","keywords":["Product platform","Agile product development","XML","Web services","Mass customization","Manufacturing grid "],"abstract":"This paper presents a new language, ppXML (platform product eXtensible Markup Language), for the lifecycle modelling of platform products in agile product development for mass customization (MC). ppXML has multi-folded meanings. Firstly, ppXML provides a set of constructs that are consistent with concepts and methods widely used in platform product development (PPD) for MC. Secondly, derived from \\{XML\\} as a sublanguage, ppXML is a standard and yet extensible modelling language dedicated to the modelling of product variants and platforms reflecting commonality, modularity, scalability and other strategies. Thirdly, ppXML can also be extended for defining web services deployed in the computation grid of web-based decision support systems (DSS) for platform product development and mass customization. Finally, ppXML serves as a standard interface with the product platform repository and a \\{PPD\\} web service registry, together with a set of online facilities for data representation and transformation between different components and parties involved in the web services. ppXML complements the efforts in product lifecycle data modelling by emphasizing the strategic level of product planning using a platform approach. "}},{"citationKey":"Cheng20081323","entryType":"article","entryTags":{"title":"e-Manufacturing: Characteristics, applications and potentials ","journal":"Progress in Natural Science ","volume":"18","number":"11","pages":"1323 - 1328","year":"2008","note":"","issn":"1002-0071","doi":"http://dx.doi.org/10.1016/j.pnsc.2008.03.027","url":"http://www.sciencedirect.com/science/article/pii/S1002007108002864","author":"Kai Cheng and Richard J. Bateman","keywords":["e-manufacturing","e-design","Global manufacturing","Agile manufacturing","Digital manufacturing "],"abstract":"In this paper, an engineering oriented approach is proposed towards e-manufacturing and its applications. The characteristics and potential of e-manufacturing are presented with a number of application examples developed by the authors' research group. The advances in e-manufacturing and applications are also highlighted and critically reviewed. The paper concludes with a further discussion on the promises and impact of e-manufacturing technology and philosophy on modern manufacturing industry and the practices. "}},{"citationKey":"Sharp2008506","entryType":"article","entryTags":{"title":"Collaboration and co-ordination in mature eXtreme programming teams ","journal":"International Journal of Human-Computer Studies ","volume":"66","number":"7","pages":"506 - 518","year":"2008","note":"Collaborative and social aspects of software development ","issn":"1071-5819","doi":"http://dx.doi.org/10.1016/j.ijhcs.2007.10.004","url":"http://www.sciencedirect.com/science/article/pii/S1071581907001371","author":"Helen Sharp and Hugh Robinson","keywords":["Distributed cognition","Story card","Information radiator","Agile development "],"abstract":"Mature eXtreme programming (XP) teams are highly collaborative and self-organising. In previous studies, we have observed that these teams rely on two apparently simple mechanisms of co-ordination and collaboration: story cards and the Wall. Story cards capture and embody the user stories which form the basis of implementation, while the Wall is a physical space used to organise and display the cards being implemented during the current development cycle (called an iteration). In this paper, we analyse the structure and use of story cards and the Wall in three mature \\{XP\\} teams, using a distributed cognition approach. The teams work in different commercial organisations developing different systems, yet we find significant similarities between their use of these two artefacts. Although simple, teams use the cards and the Wall in sophisticated ways to represent and communicate information that is vital to support their activities. We discuss the significance of the physical medium for the story cards and the Wall in an \\{XP\\} team and discuss the considerations that need to be taken into account for the design of technology to support the teams. "}},{"citationKey":"Blanc2008315","entryType":"article","entryTags":{"title":"A holonic approach for manufacturing execution system design: An industrial application ","journal":"Engineering Applications of Artificial Intelligence ","volume":"21","number":"3","pages":"315 - 330","year":"2008","note":"","issn":"0952-1976","doi":"http://dx.doi.org/10.1016/j.engappai.2008.01.007","url":"http://www.sciencedirect.com/science/article/pii/S0952197608000158","author":"Pascal Blanc and Isabel Demongodin and Pierre Castagna","keywords":["Flexible manufacturing systems","Agile control","Agents","Industrial process","Holonic system and heterarchical architectures "],"abstract":"In the age of globalisation and virtual enterprises, industrial firms are challenged by a volatile and demanding market as well as an everyday more competitive environment. As a main actor of the enterprise integration, manufacturing control systems should be designed in order to answer these necessities of reactivity and profitability in a flexible way. Holonic manufacturing system (HMS) proposes a structure organized as a loosely coupled network of communicating and cooperating agents to solve this problem. Such approach offers concrete solutions to reconfigurability and evolvability issues of manufacturing control systems. This paper presents a manufacturing execution system (MES), using the \\{HMS\\} concepts, and illustrates this approach on a real industrial application.11American Glass Product (AGP; www.agpglass.com) supports and partially finances this project. Such a structure is based on a typology of manufacturing system elements (products, resources, orders). Roles and behaviours for these manufacturing control elements are proposed. Product holons own reference models of products, for manufacturing execution and quality control. Resources holons are components used as bricks with local intelligent decision-making system embedded. Based on characteristics of the tasks they perform, a specialisation of resource holons is proposed. Specific heuristics are suggested for each class of resource holon. Finally, order holons are related to product demand, manufacturing task and product item. They own models of product item and a time model of the manufacturing task. Mechanisms are proposed to synchronize the execution of manufacturing tasks. These mechanisms guarantee the availability of components and enable to impose time constraints on task scheduling. This \\{MES\\} implements a product-centred approach, as shown by the active and opportunistic behaviour of order holons. "}},{"citationKey":"Narasimhadevara2008137","entryType":"article","entryTags":{"title":"On designing a usable interactive system to support transplant nursing ","journal":"Journal of Biomedical Informatics ","volume":"41","number":"1","pages":"137 - 151","year":"2008","note":"","issn":"1532-0464","doi":"http://dx.doi.org/10.1016/j.jbi.2007.03.006","url":"http://www.sciencedirect.com/science/article/pii/S1532046407000226","author":"A. Narasimhadevara and T. Radhakrishnan and B. Leung and R. Jayakumar","keywords":["User centered design","Usability testing","Transplant nursing","Software methodology "],"abstract":"Solid organ transplant has been steadily increasing in number both nationally and internationally. Caring for the transplant patients in the hospital setting, right after the patient is moved from the intensive care unit to the ward, is one of the most challenging tasks in nursing. It involves many procedures, rigid protocols, tight monitoring, and intensive data gathering for use by the other coordinating healthcare professionals. The complexity is further increased when a nurse has to take care of several transplant patients in a single shift. Of late, there has been a growth of computer applications in nursing and clinical information systems. Their acceptability and usability determine the ultimate success of computer support for this complex task. In this paper, we present a case study in which we combine two well-known software engineering techniques--namely, agile programming and user centered design--toward the goal of developing an interactive system for supporting the activities of transplant nurses in a hospital setting. This has resulted in a usable end-product and the user centered approach has motivated the nurses to move towards the use of computers in their jobs for better productivity. The product's usability was formally evaluated and is reported herein. The strengths and limitations of this approach are also discussed. The software product developed has been well accepted and is currently being planned to replace the manual methods followed in the transplant ward of a large metropolitan hospital. "}},{"citationKey":"Bissi2008161","entryType":"article","entryTags":{"title":"A Viterbi decoder architecture for a standard-agile and reprogrammable transceiver ","journal":"Integration, the \\{VLSI\\} Journal ","volume":"41","number":"2","pages":"161 - 170","year":"2008","note":"","issn":"0167-9260","doi":"http://dx.doi.org/10.1016/j.vlsi.2007.04.001","url":"http://www.sciencedirect.com/science/article/pii/S016792600700020X","author":"L. Bissi and P. Placidi and G. Baruffa and A. Scorzoni","keywords":["Viterbi decoder","Software defined radio","Field Programmable Gate Array (FPGA)","Configurable and programmable architecture "],"abstract":"This paper presents a Viterbi decoder (VD) architecture for a programmable data transmission system, implemented using a Field Programmable Gate Array (FPGA) device. This \\{VD\\} has been conceived as a building block of a software defined radio (SDR) mobile transceiver, reconfigurable on request and capable to provide agility in choosing between different standards. \\{UMTS\\} and \\{GPRS\\} Viterbi decoding is achieved by choosing different coding rates and constraint lengths, and the possibility to switch, at run time, between them guarantees a high degree of programmability. The architecture has been tested and verified with a Xilinx \\{XC2V2000\\} \\{FPGA\\} for providing a generalized co-simulation/co-design testbed. The results show that this decoder can sustain an uncoded data rate of about 2 Mbps, with an area occupancy of 46%, due to the efficient resources reuse. "}},{"citationKey":"Rico20081","entryType":"incollection","entryTags":{"title":"History of Computers, Electronic Commerce and Agile Methods ","editor":"Marvin V. Zelkowitz","booktitle":"Advances in COMPUTERSEmerging Technologies","publisher":"Elsevier","year":"2008","volume":"73","pages":"1 - 55","series":"Advances in Computers ","issn":"0065-2458","doi":"http://dx.doi.org/10.1016/S0065-2458(08)00401-4","url":"http://www.sciencedirect.com/science/article/pii/S0065245808004014","author":"David F. Rico and Hasan H. Sayani and Ralph F. Field","abstract":"Abstract The purpose of this chapter is to present a literature review relevant to a study of using agile methods to manage the development of Internet websites and their subsequent quality. This chapter places website quality within the context of the $2.4 trillion U.S. electronic commerce industry. Thus, this chapter provides a history of electronic computers, electronic commerce, software methods, software quality metrics, agile methods and studies on agile methods. None of these histories are without controversy. For instance, some scholars begin the study of the electronic computer by mentioning the emergence of the Sumerian text, Hammurabi code or the abacus. We, however, will align our history with the emergence of the modern electronic computer at the beginning of World War II. The history of electronic commerce also has poorly defined beginnings. Some studies of electronic commerce begin with the widespread use of the Internet in the early 1990s. However, electronic commerce cannot be appreciated without establishing a deeper context. Few scholarly studies, if any, have been performed on agile methods, which is the basic purpose of this literature review. That is, to establish the context to conduct scholarly research within the fields of agile methods and electronic commerce. "}},{"citationKey":"Fuschino200817","entryType":"article","entryTags":{"title":"Search of \\{GRB\\} with \\{AGILE\\} Minicalorimeter ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"588","number":"1-2","pages":"17 - 21","year":"2008","note":"Proceedings of the First International Conference on Astroparticle PhysicsRICAP 07 ","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2008.01.004","url":"http://www.sciencedirect.com/science/article/pii/S0168900208000338","author":"F. Fuschino and C. Labanti and M. Galli and M. Marisaldi and A. Bulgarelli and F. Gianotti and M. Trifoglio and A. Argan and E. Del Monte and I. Donnarumma and M. Feroci and F. Lazzarotto and L. Pacciani and M. Tavani and A. Trois","keywords":["Gamma ray burst","Gamma ray detector "],"abstract":"AGILE, the small scientific mission of the Italian Space Agency devoted to Hard-X and Gamma-ray astrophysics, was successfully launched on April 23, 2007. The \\{AGILE\\} payload is composed of a tungsten-silicon tracker (ST), operating in the gamma-ray energy range 30 MeV-50 GeV; Super-AGILE, an X-ray imager operating in the energy range 15-45 keV; the Minicalorimeter (MCAL) and an Anticoincidence shield. \\{MCAL\\} is a detector of about 1400 cm2 sensitive in the range 0.3-200 MeV, that can be used both as a slave of the \\{ST\\} to contribute to the \\{AGILE\\} Gamma Ray imaging Detector (GRID operative mode) and autonomously for detection of transient events (BURST operative mode). \\{MCAL\\} is made of 30 CsI(Tl) bar-shaped scintillation detectors with photodiode readout at both ends, arranged in two orthogonal layers. Energy and position of interaction can be derived from a proper composition of the signals readout at the bar's ends, absolute time tagging can be achieved with a m s resolution. The Burst logic deals with various rate-meters on different time scales, energy bands, and \\{MCAL\\} spatial zones. Different algorithms can be chosen for Burst triggering considering also the contribution of other detectors like Super AGILE. In this paper the various trigger logic will be reviewed as well as their on-ground test performed with a dedicated experimental setup. "}},{"citationKey":"Tavani200852","entryType":"article","entryTags":{"title":"The \\{AGILE\\} space mission ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"588","number":"1-2","pages":"52 - 62","year":"2008","note":"Proceedings of the First International Conference on Astroparticle PhysicsRICAP 07 ","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2008.01.023","url":"http://www.sciencedirect.com/science/article/pii/S0168900208000405","author":"M. Tavani and G. Barbiellini and A. Argan and A. Bulgarelli and P. Caraveo and A. Chen and V. Cocco and E. Costa and G. De Paris and E. Del Monte and G. Di Cocco and I. Donnarumma and M. Feroci and M. Fiorini and T. Froysland and F. Fuschino and M. Galli and F. Gianotti and A. Giuliani and Y. Evangelista and C. Labanti and I. Lapshov and F. Lazzarotto and P. Lipari and F. Longo and M. Marisaldi and M. Mastropietro and F. Mauri and S. Mereghetti and E. Morelli and A. Morselli and L. Pacciani and A. Pellizzoni and F. Perotti and P. Picozza and C. Pontoni and G. Porrovecchio and M. Prest and G. Pucella and M. Rapisarda and E. Rossi and A. Rubini and P. Soffitta and M. Trifoglio and A. Trois and E. Vallazza and S. Vercellone and A. Zambra and D. Zanello and P. Giommi and A. Antonelli and C. Pittori","keywords":["Astronomical and space-research instrumentation","Astronomical observations","X-ray and gamma-ray "],"abstract":"\\{AGILE\\} is an Italian Space Agency mission dedicated to the exploration of the gamma-ray Universe. The AGILE, very innovative instrument, combines for the first time a gamma-ray imager (sensitive in the range 30 MeV-50 GeV) and a hard X-ray imager (sensitive in the range 18-60 keV). An optimal angular resolution and very large fields of view are obtained by the use of state-of-the-art Silicon detectors integrated in a very compact instrument. \\{AGILE\\} was successfully launched on April 23, 2007 from the Indian base of Sriharikota and was inserted in an optimal low-particle background equatorial orbit. \\{AGILE\\} will provide crucial data for the study of Active Galactic Nuclei, Gamma-Ray Bursts, unidentified gamma-ray sources, galactic compact objects, supernova remnants, TeV sources, and fundamental physics by microsecond timing. The \\{AGILE\\} Cycle-1 pointing program started on 2007 December 1, and is open to the international community through a Guest Observer Program. "}},{"citationKey":"Swafford2008288","entryType":"article","entryTags":{"title":"Achieving supply chain agility through \\{IT\\} integration and flexibility ","journal":"International Journal of Production Economics ","volume":"116","number":"2","pages":"288 - 297","year":"2008","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2008.09.002","url":"http://www.sciencedirect.com/science/article/pii/S0925527308003046","author":"Patricia M. Swafford and Soumen Ghosh and Nagesh Murthy","keywords":["Flexibility","IT integration","Supply chain agility","Empirical methods "],"abstract":"Being responsive is an increasingly important skill for firms in today's global economy; thus firms must be agile. Naturally, it follows that an organization's agility depends on its supply chain being agile. However, achieving supply chain agility is a function of other abilities within the organization, specifically supply chain flexibility and information technology (IT) integration. Using empirical data, we find a domino effect among \\{IT\\} integration, supply chain flexibility, supply chain agility, and competitive business performance. Results from this study indicate that \\{IT\\} integration enables a firm to tap its supply chain flexibility which in turn results in higher supply chain agility and ultimately higher competitive business performance. While these results indicate that firms should invest first in \\{IT\\} for integrating information before investing in flexible processes, additional research is needed. "}},{"citationKey":"Lee200838","entryType":"article","entryTags":{"title":"An expert system using an extended AND-OR graph ","journal":"Knowledge-Based Systems ","volume":"21","number":"1","pages":"38 - 51","year":"2008","note":"","issn":"0950-7051","doi":"http://dx.doi.org/10.1016/j.knosys.2006.10.008","url":"http://www.sciencedirect.com/science/article/pii/S0950705106001894","author":"Kun Chang Lee and Hyung Rae Cho and Jin Sung Kim","keywords":["AND-OR graph","Dermatology","Expert systems","Inference engine","Integer matrix "],"abstract":"The inference engine (IE) is a crucial component of expert systems (ES). As the management environment has become rapidly digitalized with the advent of the Internet, the traditional \\{IE\\} is now facing a severe criticism - i.e., that it cannot effectively provide an agile, knowledge-based decision support suitable for a wide variety of problems. The objective of this paper is to propose a new type of \\{ES\\} called \\{IMIXAO\\} (Integer-Matrix-driven Inference based on an eXtended AND-OR graph), with an integer-matrix-driven \\{IE\\} based on an extended AND-OR graph framework. Traditionally, the AND-OR graph is used for making inferences in the \\{ES\\} area. Theoretical backgrounds of \\{IMIXAO\\} are presented in this paper, focusing on what an extended AND-OR graph is in terms of inference. The experiment conducted in this study, with an illustrative example of dermatological diseases classification, revealed that the proposed \\{IMIXAO\\} can make precise and agile inferences in a complex situation. "}},{"citationKey":"Kumiega2008175","entryType":"incollection","entryTags":{"title":"19 - \\{STAGE\\} 3: Overview ","editor":"Kumiega, Andrew and ,  and Vliet, Benjamin Van ","booktitle":"Quality Money Management ","publisher":"Academic Press","edition":"","address":"Burlington","year":"2008","pages":"175 - 182","series":"Financial Market Technology","isbn":"978-0-12-372549-3","doi":"http://dx.doi.org/10.1016/B978-0-12-372549-3.00019-7","url":"http://www.sciencedirect.com/science/article/pii/B9780123725493000197","author":"Andrew Kumiega and Benjamin Van Vliet","abstract":"Publisher Summary This chapter presents an overview of the Stage 3 of the development of trading and investment systems. This stage accomplishes the transformation task, turning the specifications of the trading/investment system into software and hardware, where the design of the trading system from previous stages becomes the specification requirements for the software design. At this stage, the task of building software and hardware components of the trading/investment system include a development team in addition to the product team. The lead programmer/IT member of the product team manages this somewhat agile development team, which will engage in test-driven development. The financial engineers from the product team over the course of Stage 3 manage software quality assurance of business tier software. The traders from the product team perform and/or oversee quality assurance over GUI, integration, and reporting mechanisms, as well as run user-acceptance tests. The marketing person from the product team writes or oversees the writing of the user documentation for the software. Addition of a risk manager, who will learn the specifics of the trading/investment system and be able to recommend how best to build out the risk management functions and reporting requirements, is also recommended. A development team develops software iteratively, and this iterative development dramatically increases feedback versus sequential development, providing closer communication between the product team and the development team. "}},{"citationKey":"Lanese200827","entryType":"article","entryTags":{"title":"Exploiting User-definable Synchronizations in Graph Transformation ","journal":"Electronic Notes in Theoretical Computer Science ","volume":"211","number":"","pages":"27 - 38","year":"2008","note":"Proceedings of the Fifth International Workshop on Graph Transformation and Visual Modeling Techniques (GT-VMT 2006) ","issn":"1571-0661","doi":"http://dx.doi.org/10.1016/j.entcs.2008.04.027","url":"http://www.sciencedirect.com/science/article/pii/S1571066108002429","author":"Ivan Lanese","keywords":["Graph transformation","Synchronized Hyperedge Replacement","synchronization algebras","mobility "],"abstract":"Parametric Synchronized Hyperedge Replacement (PSHR) is a graph transformation formalism where productions specifying the behavior of single components can be synchronized to give full transitions. The main feature of \\{PSHR\\} is that the synchronization model is user-definable. To enhance the applicability of the approach we propose a simplified and more suggestive semantics, preserving however the expressive power of the original one. We also show how some common synchronization models can be formalized and exploited inside PSHR. This allows to simplify the modelling step, and the produced model too. We apply this approach to the airport case study of FET-GC project AGILE. "}},{"citationKey":"Baker200827","entryType":"article","entryTags":{"title":"The design and operation of distribution centres within agile supply chains ","journal":"International Journal of Production Economics ","volume":"111","number":"1","pages":"27 - 41","year":"2008","note":"Managing Supply Chain Network ","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2006.09.019","url":"http://www.sciencedirect.com/science/article/pii/S0925527307000308","author":"Peter Baker","keywords":["Warehousing","Agility","Flexibility","Capability","Competency "],"abstract":"Although the need to respond to volatile market places has been addressed in recent years by the concept of agility, the precise role of distribution centres within agile supply chains has only been partially explored. This paper examines this particular area by means of nine case studies into how individual business units design and operate distribution centres to provide a rapid response to their markets. The solutions used by these companies are categorised to form a framework for addressing this subject and as a basis for further research into the practical application of agility at the distribution centre level. "}},{"citationKey":"Tong2008145","entryType":"article","entryTags":{"title":"Product lifecycle oriented digitization agile process preparation system ","journal":"Computers in Industry ","volume":"59","number":"2-3","pages":"145 - 153","year":"2008","note":"Product Lifecycle Modelling, Analysis and Management ","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2007.06.017","url":"http://www.sciencedirect.com/science/article/pii/S0166361507000991","author":"Yifei Tong and Dongbo Li and Minghai Yuan","keywords":["Process preparation","Product lifecycle","Process planning","Knowledge reuse and recombination "],"abstract":"After analyzing the features of process preparation, a product lifecycle oriented digitization agile process preparation system (DAPP) is presented. This paper develops a general approach and a system tool for digitization agile process preparation (DAPP). First, according to modern manufacturing concept and the bottleneck problems of computer integrated manufacturing system (CIMS), a concept of \\{DAPP\\} is proposed. Secondly, after analysis of the characteristics of the process preparation system (DAPPS), the needs for \\{DAPPS\\} are explored in depth. Thirdly a framework is proposed to support \\{DAPPS\\} by providing computer-aided and database environments for DAPPS, advisory tools for product structure manufacturability evaluation, rapid process planning, tooling design, process consumption determination as well as field process preparation, and knowledge bases incorporated in the advisory tools. Fourthly, according to the framework, a design support strategy for \\{DAPPS\\} is investigated to guide the coordination of preparation activities. Finally, based on the proposed approach and strategy, the system prototype has been developed employing the knowledge-based approach. The results of this research will facilitate the rationalization of process preparation and thus shorten the preparation time. "}},{"citationKey":"Minoni2008774","entryType":"article","entryTags":{"title":"Surface quality control device for on-line applications ","journal":"Measurement ","volume":"41","number":"7","pages":"774 - 782","year":"2008","note":"","issn":"0263-2241","doi":"http://dx.doi.org/10.1016/j.measurement.2007.11.003","url":"http://www.sciencedirect.com/science/article/pii/S0263224107001169","author":"Umberto Minoni and Fabio Cavalli","keywords":["Optical measurement","On-line inspection","Quality control","Machine tool "],"abstract":"This paper details the development of a novel device for monitoring the quality of the metal surfaces sculptured by modern machine tools. The developed system, that can be proposed as a machine tool accessory, integrates the three functions of dimensional, roughness and waviness measurement. The measure is achieved, without contact, scanning the surface with an optical measuring probe handled like an ordinary tool, which is loaded from the tool magazine and then employed to perform the on-line measurement; a simple fibre connection to the control unit guarantees high immunity to disturbances. The experimental validation proved the capability of the developed solution to meet the severe requirements of the modern production systems showing the particular suitability of the inspection tool to the cases of Flexible Manufacturing Systems and Agile Production. "}},{"citationKey":"Chen2008123","entryType":"article","entryTags":{"title":"Integrative 3D modelling of complex carving surface ","journal":"Computer-Aided Design ","volume":"40","number":"1","pages":"123 - 132","year":"2008","note":"Constrained Design of Curves and Surfaces ","issn":"0010-4485","doi":"http://dx.doi.org/10.1016/j.cad.2007.06.013","url":"http://www.sciencedirect.com/science/article/pii/S0010448507001558","author":"Yutuo Chen and Xuli Han and Minoru Okada and Y. Chen","keywords":["3D modelling","Complex carving surface","Multilayer model","Combinating model","Model interpolation "],"abstract":"Modelling of a complex carving surface is the most important process for digitization of art carving such as Chinese classical furniture carving, and it is difficult to be fulfilled. However, a complex 2D curve flower pattern can be easily acquired or drawn by handcraft or a drawing software. This paper presents a quick integrative 3D modeling method of complex carving surface based on a 2D curve flower pattern. The proposed method uses a scanning analysis algorithm, a normal distribution function and a distance function to model and create carving tracks. In this paper, the delamination, combination and interpolation of modelling process are described as well. The provided research method will make the modelling of complex carving surface more intelligent, agile, and will meet the requirement of integrative 3D modelling of digital art carving. Experimental results show that this method is of quick modelling and multi-model effective characteristics with realizable interactive designing and excellent practicability. "}},{"citationKey":"BenYoo2008641","entryType":"incollection","entryTags":{"title":"16 - Optical burst and packet switching ","editor":"Kaminow, Ivan P. and , and Li, Tingye and ,  and Willner, Alan E. ","booktitle":"Optical Fiber Telecommunications V B (Fifth Edition) ","publisher":"Academic Press","edition":"Fifth Edition","address":"Burlington","year":"2008","pages":"641 - 693","series":"Optics and Photonics","issn":"15575837","doi":"http://dx.doi.org/10.1016/B978-0-12-374172-1.00016-3","url":"http://www.sciencedirect.com/science/article/pii/B9780123741721000163","author":"S.J. Ben Yoo","abstract":"Publisher Summary This chapter discusses optical burst switching (OBS) and optical packet switching (OPS) technologies and examines their roles in future optical networks, covering the roles of optical circuit, burst, and packet switching systems in optical networks, as well as their respective benefits and trade-offs. \\{OPS\\} and \\{OBS\\} technologies seek powerful combinations of the vast optical bandwidth and the agile subwavelength granularity by switching and routing packets and bursts directly in the optical layer. \\{OBS\\} offers best-effort burst transport and switching with one-way signaling so that high network utilization for bursty traffic can be achieved. \\{OPS\\} requires fast switching speeds (in the nanosecond range) to be effective. Recent advances in optical header (label) processing and optical switching led to asynchronous and variable-length \\{OPS\\} with contention resolution in wavelength, time, and space domains at nanosecond switching speeds. Unlike electronic packet switching routers, optical routers can exploit the wavelength domain to greatly reduce the buffer requirement and to discard store-and-buffer architecture involving packet processing in the data plane. A description is given of the networking architecture/protocols, systems, and technologies pertaining to optical burst and packet switching. Optical label switching technology is introduced, which provides a unified platform for interoperating optical circuit, burst, and packet switching techniques. In addition to the reduced complexity and power requirements in optical label switching (OLS) routers resulting from significantly reduced high-speed electronic processing in the data plane, further advances in integrated optoelectronic technologies may eventually allow chip-scale integration of \\{OLS\\} routers for the agile, robust, and high-performance Internet in the future. "}},{"citationKey":"Kumiega200829","entryType":"incollection","entryTags":{"title":"3 - Overview of the Trading/Investment System Development Methodology ","editor":"Kumiega, Andrew and ,  and Vliet, Benjamin Van ","booktitle":"Quality Money Management ","publisher":"Academic Press","edition":"","address":"Burlington","year":"2008","pages":"29 - 44","series":"Financial Market Technology","isbn":"978-0-12-372549-3","doi":"http://dx.doi.org/10.1016/B978-0-12-372549-3.00003-3","url":"http://www.sciencedirect.com/science/article/pii/B9780123725493000033","author":"Andrew Kumiega and Benjamin Van Vliet","abstract":"Publisher Summary This chapter presents an incremental development methodology of trading and investment system, which would ensure a rapid development cycle with quick deliverables and consistent quality standards. However, before the beginning of development methodology, the product team has to raise money to fund the development and to raise money, a product team needs a Money Document. Trading and money management is a business and in order to succeed, product teams need to raise research and development capital as well as trading capital, from either inside the firm or outside it. A well-done Money Document serves as a Vision and Scope Document by outlining the business goals of a proposed trading/investment system in a clear and concise fashion in order to persuade management or outside investors to provide the initial capital needed for research and subsequently for development of a trading/investment system according to the four-stage methodology. The resources allocated to a project, subsequent to the delivery of a Money Document and management approval, enables the process of development methodology. The methodology combines the various aspects of well-known methodologies such as the traditional waterfall of Royce and spiral methodology of Boehm from software, the Stage-Gate (r) methodology of Cooper from new product development, and Lean, Six Sigma, and Agile development. The Royce's traditional waterfall methodology for software development consists of four stages that include analysis, design, implementation, and testing that vaguely map to the four stages of the methodology. By using the waterfall methodology, the teams avoid the pitfalls of creating systems before project plans are precisely defined and approved. In the spiral methodology, a smaller amount of time is initially devoted to the four stages that include research, planning, implementation, and testing, which are followed by several iterations or loops over each. "}},{"citationKey":"Choi20081114","entryType":"article","entryTags":{"title":"Exploring the underlying aspects of pair programming: The impact of personality ","journal":"Information and Software Technology ","volume":"50","number":"11","pages":"1114 - 1126","year":"2008","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2007.11.002","url":"http://www.sciencedirect.com/science/article/pii/S0950584907001292","author":"Kyungsub S. Choi and Fadi P. Deek and Il Im","keywords":["Pair programming","Team programming","Collaborative programming","Myers-Briggs Type Indicator","Personality "],"abstract":"With the recent advent of agile software process methods, a number of seldom used and unorthodox practices have come to the forefront in the field of computer programming. One such practice is that of pair programming, which is characterized by two programmers sharing the same computer for collaborative programming purposes. The very nature of pair programming implies a psychological and social interaction between the participating programmers and thus brings into play a unique element that we do not see with the conventional individual programming model. This paper focuses on the effects that one of these psychosocial factors, a programmer's personality type, may have on the pair programming environment. In this study, a group of university students, 68 undergraduate students and 60 master's degree graduate students, each of whom had been personality type profiled using the Myers-Briggs Type Indicator (MBTI) model, was split into three sub-groups. One group consisted of subjects who were alike in \\{MBTI\\} type. Another group consisted of subjects who were opposite to each other in \\{MBTI\\} type, and the last group was comprised of subjects who were diverse - partially alike and partially opposite - in \\{MBTI\\} type. Through two pair programming sessions, the pairs in each group were assessed for their output, in code productivity. The result showed that the sub-group of subjects who were diverse in \\{MBTI\\} type exhibited higher productivity than both alike and opposite groups. In a comparison between alike and opposite groups, the productivity of the opposite group was greater than that of the alike group. "}},{"citationKey":"Newman2008699","entryType":"article","entryTags":{"title":"Strategic advantages of interoperability for global manufacturing using \\{CNC\\} technology ","journal":"Robotics and Computer-Integrated Manufacturing ","volume":"24","number":"6","pages":"699 - 708","year":"2008","note":"\\{FAIM\\} 200717th International Conference on Flexible Automation and Intelligent Manufacturing ","issn":"0736-5845","doi":"http://dx.doi.org/10.1016/j.rcim.2008.03.002","url":"http://www.sciencedirect.com/science/article/pii/S0736584508000318","author":"S.T. Newman and A. Nassehi and X.W. Xu and R.S.U. Rosso Jr. and L. Wang and Y. Yusof and L. Ali and R. Liu and L.Y. Zheng and S. Kumar and P. Vichare and V. Dhokia","keywords":["CNC","Interoperability","Global manufacturing","STEP-NC "],"abstract":"In the domain of manufacturing, computer numerically controllers (CNC) technology is a major contributor to the production capacity of the enterprises. The advances in \\{CNC\\} technology coupled with enhancements in computing systems have provided the basis to re-examine the way in which computer-aided systems (CAx) can be used to enable global manufacturing. Interoperability of the various components of the \\{CAx\\} chain is therefore a major prerequisite for manufacturing enterprises for becoming strategically agile and consequently globally competitive. Being interoperable, resources can be utilized interchangeably in a plug-and-produce manner. Over the last 8 years the eminence of a \\{STEP\\} standard for machining entitled STEP-NC (numerical control) has become a well-known vehicle for research to improve the level of information availability at the \\{CNC\\} machine tool. In this paper, the authors introduce the background to the evolution of \\{CNC\\} manufacturing over the last 50 years and the current standards available for programming. A review of the literature in interoperable \\{CNC\\} manufacturing is then provided relating to milling, turn-mill and other \\{NC\\} processes. The major part of the paper provides a strategic view of how interoperability can be implemented across the \\{CAx\\} chain with a range of standards used to regulate the flow of information. Finally, the paper outlines the advantages and major issues for future developments in interoperability, identifying future key requirements and limiting factors. "}},{"citationKey":"Genero2008534","entryType":"article","entryTags":{"title":"Defining and validating metrics for assessing the understandability of entity-relationship diagrams ","journal":"Data & Knowledge Engineering ","volume":"64","number":"3","pages":"534 - 557","year":"2008","note":"","issn":"0169-023X","doi":"http://dx.doi.org/10.1016/j.datak.2007.09.011","url":"http://www.sciencedirect.com/science/article/pii/S0169023X07001796","author":"Marcela Genero and Geert Poels and Mario Piattini","keywords":["Conceptual data modelling","ER diagram","Understandability","Structural properties","Metrics","Measurement theory","Experimental validation "],"abstract":"Database and data model evolution cause significant problems in the highly dynamic business environment that we experience these days. To support the rapidly changing data requirements of agile companies, conceptual data models, which constitute the foundation of database design, should be sufficiently flexible to be able to incorporate changes easily and smoothly. In order to understand what factors drive the maintainability of conceptual data models and to improve conceptual modelling processes, we need to be able to assess conceptual data model properties and qualities in an objective and cost-efficient manner. The scarcity of early available and thoroughly validated maintainability measurement instruments motivated us to define a set of metrics for Entity-Relationship (ER) diagrams. In this paper we show that these easily calculated and objective metrics, measuring structural properties of \\{ER\\} diagrams, can be used as indicators of the understandability of the diagrams. Understandability is a key factor in determining maintainability as model modifications must be preceded by a thorough understanding of the model. The validation of the metrics as early understandability indicators opens up the way for an in-depth study of how structural properties determine conceptual data model understandability. It also allows building maintenance-related prediction models that can be used in conceptual data modelling practice. "}},{"citationKey":"Gunasekaran2008549","entryType":"article","entryTags":{"title":"Responsive supply chain: A competitive strategy in a networked economy ","journal":"Omega ","volume":"36","number":"4","pages":"549 - 564","year":"2008","note":"Special Issue on Logistics: New Perspectives and Challenges ","issn":"0305-0483","doi":"http://dx.doi.org/10.1016/j.omega.2006.12.002","url":"http://www.sciencedirect.com/science/article/pii/S0305048307000825","author":"Angappa Gunasekaran and Kee-hung Lai and T.C. Edwin Cheng","keywords":["Responsive supply chain","Scope","Definition","Cases","Framework "],"abstract":"Supply chain management (SCM) has been considered as the most popular operations strategy for improving organizational competitiveness in the twenty-first century. In the early 1990s, agile manufacturing (AM) gained momentum and received due attention from both researchers and practitioners. In the mid-1990s, \\{SCM\\} began to attract interest. Both \\{AM\\} and \\{SCM\\} appear to differ in philosophical emphasis, but each complements the other in objectives for improving organizational competitiveness. For example, \\{AM\\} relies more on strategic alliances/partnerships (virtual enterprise environment) to achieve speed and flexibility. But the issues of cost and the integration of suppliers and customers have not been given due consideration in AM. By contrast, cost is given a great deal of attention in SCM, which focuses on the integration of suppliers and customers to achieve an integrated value chain with the help of information technologies and systems. Considering the significance of both \\{AM\\} and \\{SCM\\} for firms to improve their performance, an attempt has been made in this paper to analyze both \\{AM\\} and \\{SCM\\} with the objective of developing a framework for responsive supply chain (RSC). We compare their characteristics and objectives, review the selected literature, and analyze some case experiences on \\{AM\\} and SCM, and develop an integrated framework for a RSC. The proposed framework can be employed as a competitive strategy in a networked economy in which customized products/services are produced with virtual organizations and exchanged using e-commerce. "}},{"citationKey":"tagkey2008vii","entryType":"article","entryTags":{"title":"Agile Product Line Engineering - List of reviewers ","journal":"Journal of Systems and Software ","volume":"81","number":"6","pages":"vii - ","year":"2008","note":"Agile Product Line Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/S0164-1212(08)00080-0","url":"http://www.sciencedirect.com/science/article/pii/S0164121208000800","key":"tagkey2008vii"}}]