[{"citationKey":"Kettunen2009408","entryType":"article","entryTags":{"title":"Adopting key lessons from agile manufacturing to agile software product development--A comparative study ","journal":"Technovation ","volume":"29","number":"6-7","pages":"408 - 422","year":"2009","note":"","issn":"0166-4972","doi":"http://dx.doi.org/10.1016/j.technovation.2008.10.003","url":"http://www.sciencedirect.com/science/article/pii/S0166497208001302","author":"Petri Kettunen","keywords":["Agile software process models","Software process improvement","Agile manufacturing","New product development","Agile enterprise "],"abstract":"Many industrial new product development (NPD) software projects apply nowadays agile methodologies. These methodologies, such as Scrum, eXtreme Programming (XP), and Feature-Driven Development (FDD) date back to 1990s, and the Agile Manifesto was declared in 2001. However, already before that the concept of agile manufacturing (AM) was discovered to describe a corporate ability for quick adaptation to changing requirements. There is surprising amount in common between these two fields. This raises a question of whether \\{NPD\\} software development companies could take even more overall advantage of those different agile approaches. This interdisciplinary paper explores the commonalities between the key concepts of \\{AM\\} and some of the most popular agile software methods, and consequently suggests potential new areas for software process improvement (SPI) in large-scale \\{NPD\\} organizations. An industrial case example illustrates how agility in embedded software product development can be enhanced by following typical \\{NPD\\} principles. We conclude that there is potential for further improvements in software product development industry in general by seeing agility as a wider, organization-oriented business concept following the AM/NPD learning. Current agile software process models cover only a subset of this space. "}},{"citationKey":"Sharp2009108","entryType":"article","entryTags":{"title":"The role of physical artefacts in agile software development: Two complementary perspectives ","journal":"Interacting with Computers ","volume":"21","number":"1-2","pages":"108 - 116","year":"2009","note":"Special issue: Enactive InterfacesPhysicality &amp; Interaction ","issn":"0953-5438","doi":"http://dx.doi.org/10.1016/j.intcom.2008.10.006","url":"http://www.sciencedirect.com/science/article/pii/S0953543808000659","author":"Helen Sharp and Hugh Robinson and Marian Petre","keywords":["Cognitive dimensions","Ethnography","Software teams","Agile development","Empirical studies "],"abstract":"Agile software development promotes feedback, discipline and close collaboration between all members of the development team, and de-emphasises documentation, 'big design up front' and hierarchical processes. Agile teams tend to be co-located and multi-disciplinary, and rely heavily on face-to-face communication and seemingly simple physical artefacts to support interaction. In this paper we focus on the functionality of two key physical artefacts - the story card and the Wall - which, individually and in combination, underpin the team's activity. These artefacts have two main roles - one which enables a shared understanding of requirements and one which facilitates the development process itself. We consider these roles from two perspectives: a notational perspective and a social perspective. This discussion shows how the two perspectives - the notational and the social - intertwine and are mutually supportive. Any attempt to replace these physical artefacts with alternative support for an agile team needs to take account of both perspectives, and the complex relationships between them. "}},{"citationKey":"Ryan2009229","entryType":"article","entryTags":{"title":"Development of a team measure for tacit knowledge in software development teams ","journal":"Journal of Systems and Software ","volume":"82","number":"2","pages":"229 - 240","year":"2009","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2008.05.037","url":"http://www.sciencedirect.com/science/article/pii/S0164121208001313","author":"Sharon Ryan and Rory V. O'Connor","keywords":["Knowledge","Tacit knowledge","Team tacit knowledge","Repertory grid","Team performance","Team management","Agile methods "],"abstract":"In this paper we operationally define and measure tacit knowledge at the team-level in the software development domain. Through a series of three empirical studies we developed and validated the team tacit knowledge measure (TTKM) for software developers. In the first study, initial scale items were developed using the repertory grid technique and content analysis. In Study 2, supplied repertory grids were administered to novices and experts to establish differential items, and Study 3 validated the \\{TTKM\\} on a sample of 48 industrial software development teams. In developing the \\{TTKM\\} we explored the relationships between tacit knowledge, explicit job knowledge and social interaction and their effect on team performance as measured by efficiency and effectiveness. In addition we assess the implications for managing software development teams and increasing team performance through social interaction. "}},{"citationKey":"Acuna2009627","entryType":"article","entryTags":{"title":"How do personality, team processes and task characteristics relate to job satisfaction and software quality? ","journal":"Information and Software Technology ","volume":"51","number":"3","pages":"627 - 639","year":"2009","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2008.08.006","url":"http://www.sciencedirect.com/science/article/pii/S0950584908001080","author":"Silvia T. Acuna and Marta Gomez and Natalia Juristo","keywords":["Personality factors","Team processes","Task characteristics","Software quality","Job satisfaction "],"abstract":"This article analyses the relationships between personality, team processes, task characteristics, product quality and satisfaction in software development teams. The data analysed here were gathered from a sample of 35 teams of students (105 participants). These teams applied an adaptation of an agile methodology, eXtreme Programming (XP), to develop a software product. We found that the teams with the highest job satisfaction are precisely the ones whose members score highest for the personality factors agreeableness and conscientiousness. The satisfaction levels are also higher when the members can decide how to develop and organize their work. On the other hand, the level of satisfaction and cohesion drops the more conflict there is between the team members. Finally, the teams exhibit a significant positive correlation between the personality factor extraversion and software product quality. "}},{"citationKey":"Santos2009489","entryType":"incollection","entryTags":{"title":"Development of a Software to Analysis and Prepare Mass Balance Data to Reconciliation in Oil Refineries ","editor":"Rita Maria de Brito Alves, Caludio Augusto Oller do Nascimento and Evaristo Chalbaud Biscaia","booktitle":"10th International Symposium on Process Systems Engineering: Part A","publisher":"Elsevier","year":"2009","volume":"27","pages":"489 - 494","series":"Computer Aided Chemical Engineering ","issn":"1570-7946","doi":"http://dx.doi.org/10.1016/S1570-7946(09)70302-5","url":"http://www.sciencedirect.com/science/article/pii/S1570794609703025","author":"Camila L.R. Santos and Douglas C. Mariani and Alexandre A. Campos and Marcelo Malavazi Alves","keywords":["mass balance","software development","data analysis "],"abstract":"Abstract The data utilized on daily mass balance in oil refineries are generated from the records of products movements and flow and quality measurements existing in the refining processes. This data usually shows low quality and inconsistencies and it should be examined and treated. It was used a technique of data reconciliation to assess those inconsistencies and generate a set of data that allow reliable analysis, which support decisions about process. The data generated by data reconciliation are going to feed the accounting systems and support decisions of the operation and analysis teams. In order to improve data reconciliation system management data, it became more agile and practical, it is necessary to treat raw data that come from site and were recorded in the refinery information systems. The software developed has a function of capture raw data record in the system of registration and control of operations and link these data with measurements in the refining processes. This pooling of information brings a gain of quantity and quality to the data reconciliation system, reducing mathematical problems of non-solubility drive by configuration of refining processes and allocation of measurements. The software also evaluates the closing of balance sheet of each tank and carries a previous distribution of differences, which come from low precision of measurements. This functionality of system intended that data were as close to reality of the process as possible and also attend accounting requirements, increasingly rigid, imposed to oil refining companies. To achieve this goal, it was made modifications on a consecrated numerical technique, in order to adapt this to the problem and to the singular objective function that mathematically describes the problem. All these analyses are generated by software algorithms and occur automatically in hours previously scheduled. With the data processed in the case of mathematical problems and evaluated in order to attend mass balance constraints, reports are generated and will be used by analysis accounting team of refinery. This software is deployed in the largest Brazilian oil refinery and the data generated through it as used as the basis for the accounting closure of this site. "}},{"citationKey":"Miranda20091327","entryType":"article","entryTags":{"title":"Sizing user stories using paired comparisons ","journal":"Information and Software Technology ","volume":"51","number":"9","pages":"1327 - 1337","year":"2009","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2009.04.003","url":"http://www.sciencedirect.com/science/article/pii/S0950584909000391","author":"Eduardo Miranda and Pierre Bourque and Alain Abran","keywords":["Agile estimation","Triangulation","Estimating by analogy","Paired comparisons","Software sizing","Expert estimation","Expert judgment","Project planning","Incomplete cyclic designs "],"abstract":"Agile estimation approaches usually start by sizing the user stories to be developed by comparing them to one another. Various techniques, with varying degrees of formality, are used to perform the comparisons - plain contrasts, triangulation, planning poker, and voting. This article proposes the use of a modified paired comparison method in which a reduced number of comparisons is selected according to an incomplete cyclic design. Using two sets of data, the authors show that the proposed method produces good estimates, even when the number of comparisons is reduced by half those required by the original formulation of the method. "}},{"citationKey":"PittFrancis20092452","entryType":"article","entryTags":{"title":"Chaste: A test-driven approach to software development for biological modelling ","journal":"Computer Physics Communications ","volume":"180","number":"12","pages":"2452 - 2471","year":"2009","note":"40 \\{YEARS\\} \\{OF\\} CPC: A celebratory issue focused on quality software for high performance, grid and novel computing architectures ","issn":"0010-4655","doi":"http://dx.doi.org/10.1016/j.cpc.2009.07.019","url":"http://www.sciencedirect.com/science/article/pii/S0010465509002604","author":"Joe Pitt-Francis and Pras Pathmanathan and Miguel O. Bernabeu and Rafel Bordas and Jonathan Cooper and Alexander G. Fletcher and Gary R. Mirams and Philip Murray and James M. Osborne and Alex Walter and S. Jon Chapman and Alan Garny and Ingeborg M.M. van Leeuwen and Philip K. Maini and Blanca Rodriguez and Sarah L. Waters and Jonathan P. Whiteley and Helen M. Byrne and David J. Gavaghan","keywords":["Cardiac electrophysiology","Intestinal crypt simulation "],"abstract":"Chaste ('Cancer, heart and soft-tissue environment') is a software library and a set of test suites for computational simulations in the domain of biology. Current functionality has arisen from modelling in the fields of cancer, cardiac physiology and soft-tissue mechanics. It is released under the \\{LGPL\\} 2.1 licence. Chaste has been developed using agile programming methods. The project began in 2005 when it was reasoned that the modelling of a variety of physiological phenomena required both a generic mathematical modelling framework, and a generic computational/simulation framework. The Chaste project evolved from the Integrative Biology (IB) e-Science Project, an inter-institutional project aimed at developing a suitable \\{IT\\} infrastructure to support physiome-level computational modelling, with a primary focus on cardiac and cancer modelling. Program summary Program title: Chaste Catalogue identifier: AEFD_v1_0 Program summary URL: http://cpc.cs.qub.ac.uk/summaries/AEFD_v1_0.html Program obtainable from: \\{CPC\\} Program Library, Queen's University, Belfast, N. Ireland Licensing provisions: \\{LGPL\\} 2.1 No. of lines in distributed program, including test data, etc.: 5 407 321 No. of bytes in distributed program, including test data, etc.: 42 004 554 Distribution format: tar.gz Programming language: C++ Operating system: Unix Has the code been vectorised or parallelized?: Yes. Parallelized using MPI. RAM: &lt; 90   Megabytes for two of the scenarios described in Section 6 of the manuscript (Monodomain re-entry on a slab or Cylindrical crypt simulation). Up to 16 Gigabytes (distributed across processors) for full resolution bidomain cardiac simulation. Classification: 3. External routines: Boost, CodeSynthesis XSD, CxxTest, HDF5, METIS, MPI, PETSc, Triangle, Xerces Nature of problem: Chaste may be used for solving coupled \\{ODE\\} and \\{PDE\\} systems arising from modelling biological systems. Use of Chaste in two application areas are described in this paper: cardiac electrophysiology and intestinal crypt dynamics. Solution method: Coupled multi-physics with PDE, \\{ODE\\} and discrete mechanics simulation. Running time: The largest cardiac simulation described in the manuscript takes about 6 hours to run on a single 3 \\{GHz\\} core. See results section (Section 6) of the manuscript for discussion on parallel scaling. "}},{"citationKey":"Chan2009803","entryType":"article","entryTags":{"title":"Acceptance of agile methodologies: A critical review and conceptual framework ","journal":"Decision Support Systems ","volume":"46","number":"4","pages":"803 - 814","year":"2009","note":"\\{IT\\} Decisions in Organizations ","issn":"0167-9236","doi":"http://dx.doi.org/10.1016/j.dss.2008.11.009","url":"http://www.sciencedirect.com/science/article/pii/S0167923608002133","author":"Frank K.Y. Chan and James Y.L. Thong","keywords":["Systems development methodologies","Agile methodologies","Knowledge management","Framework "],"abstract":"It is widely believed that systems development methodologies (SDMs) can help improve the software development process. Nevertheless, their deployment often encounters resistance from systems developers. Agile methodologies, the latest batch of \\{SDMs\\} that are most suitable in dealing with volatile business requirements, are likely to face the same challenge as they require developers to drastically change their work habits and acquire new skills. This paper addresses what can be done to overcome the challenge to agile methodologies acceptance. We provide a critical review of the extant literature on the acceptance of traditional \\{SDMs\\} and agile methodologies, and develop a conceptual framework for agile methodologies acceptance based on a knowledge management perspective. This framework can provide guidance for future research into acceptance of agile methodologies, and has implications for practitioners concerned with the effective deployment of agile methodologies. "}},{"citationKey":"Petersen20091479","entryType":"article","entryTags":{"title":"A comparison of issues and advantages in agile and incremental development between state of the art and an industrial case ","journal":"Journal of Systems and Software ","volume":"82","number":"9","pages":"1479 - 1490","year":"2009","note":"SI: \\{QSIC\\} 2007 ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2009.03.036","url":"http://www.sciencedirect.com/science/article/pii/S0164121209000855","author":"Kai Petersen and Claes Wohlin","keywords":["Agile","Incremental","State of the art","Case study "],"abstract":"Recent empirical studies have been conducted identifying a number of issues and advantages of incremental and agile methods. However, the majority of studies focused on one model (Extreme Programming) and small projects. To draw more general conclusions we conduct a case study in large-scale development identifying issues and advantages, and compare the results with previous empirical studies on the topic. The principle results are that (1) the case study and literature agree on the benefits while new issues arise when using agile in large-scale and (2) an empirical research framework is needed to make agile studies comparable. "}},{"citationKey":"Buyukozkan2009840","entryType":"article","entryTags":{"title":"Supplier Selection in an Agile Supply Chain Environment using Fuzzy Axiomatic Design Approach ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"42","number":"4","pages":"840 - 845","year":"2009","note":"13th \\{IFAC\\} Symposium on Information Control Problems in Manufacturing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20090603-3-RU-2001.0504","url":"http://www.sciencedirect.com/science/article/pii/S1474667016338988","author":"Gulcin Buyukozkan and Jbid Arsenyan","keywords":["Supplier selection","Agile supply chain management","Fuzzy axiomatic design","Group decision making "],"abstract":"Abstract In recent years, there has been a growing interest in the design and implementation of agile supply chains (ASCs). Competitive \\{ASCs\\} requires suppliers to also demonstrate agile attributes. Therefore, maximum benefit will be attained from \\{ASC\\} if each company of the chain can identify suitable agile suppliers. This paper proposes to use an analytical model, more precisely an axiomatic design based fuzzy group decision making approach, in order to support the effective evaluation of \\{ASC\\} suppliers. The applicability of the proposed approach is verified through a case study. "}},{"citationKey":"Motogna200995","entryType":"article","entryTags":{"title":"An Agile \\{MDA\\} Approach for Service-Oriented Components ","journal":"Electronic Notes in Theoretical Computer Science ","volume":"253","number":"1","pages":"95 - 110","year":"2009","note":"Proceedings of the Sixth International Workshop on Formal Engineering approches to Software Components and Architectures (FESCA 2009) ","issn":"1571-0661","doi":"http://dx.doi.org/10.1016/j.entcs.2009.09.030","url":"http://www.sciencedirect.com/science/article/pii/S1571066109003843","author":"Simona Motogna and I. Lazar and B. Parv and I. Czibula","keywords":["agile MDA","service-oriented components","component model","executable UML","component-based development "],"abstract":"Two important principles that drive the agile \\{MDA\\} processes are immediate execution and test first development. This paper presents a component model, called iComponent, that allows the development of executable models based on agile principles and service orientation. In order to ensure simple and fast definition of component operations, we use a concrete syntax for \\{UML\\} structured activities and a corresponding \\{UML\\} profile. The study also includes a mapping of iComponent to some existing service-oriented component frameworks (iPOJO, OSGi, SCA). The proposed platform-independent component model is part of a framework for component definition, validation and composition. "}},{"citationKey":"Luo2009249","entryType":"article","entryTags":{"title":"Supplier selection in agile supply chains: An information-processing model and an illustration ","journal":"Journal of Purchasing and Supply Management ","volume":"15","number":"4","pages":"249 - 262","year":"2009","note":"","issn":"1478-4092","doi":"http://dx.doi.org/10.1016/j.pursup.2009.05.004","url":"http://www.sciencedirect.com/science/article/pii/S1478409209000417","author":"Xinxing Luo and Chong Wu and Duska Rosenberg and David Barnes","keywords":["Supplier selection","Agile supply chain","Artificial neural network "],"abstract":"Agile supply chains need to be highly flexible in order to reconfigure quickly in response to changes in their environment. An effective supplier selection process is essential for this. This paper develops a model that helps overcome the information-processing difficulties inherent in screening a large number of potential suppliers in the early stages of the selection process. Based on radial basis function artificial neural network (RBF-ANN), the model enables potential suppliers to be assessed against multiple criteria using both quantitative and qualitative measures. Its efficacy is illustrated using empirical data from the Chinese electrical appliance and equipment manufacturing industries. "}},{"citationKey":"Steer20091071","entryType":"article","entryTags":{"title":"Dichotomies in perceived predation risk of drinking wallabies in response to predatory crocodiles ","journal":"Animal Behaviour ","volume":"78","number":"5","pages":"1071 - 1078","year":"2009","note":"","issn":"0003-3472","doi":"http://dx.doi.org/10.1016/j.anbehav.2009.07.024","url":"http://www.sciencedirect.com/science/article/pii/S0003347209003492","author":"David Steer and J. Sean Doody","keywords":["agile wallaby","apprehension","Crocodylus porosus","group size","Macropus agilis","saltwater crocodile","vigilance "],"abstract":"Most advances in our understanding of predation risk involve foraging animals, yet animals also trade off predation risk with other essential activities. Drinking under the risk of predation may elicit similar prey behaviours to those in foraging animals, but has been little studied. Agile wallabies, Macropus agilis, manipulate their environment by excavating drinking holes just out of reach of predatory saltwater crocodiles. Paradoxically, however, some wallabies drink from the river's edge despite the immediate availability of the lower-risk drinking holes. We studied the behaviour of wallabies with multiple drinking options to test a series of predictions for animals drinking under the risk of predation. More wallabies drank during the day than at night, regardless of drinking site. However, night-drinking wallabies were much more likely to use the excavated holes than the 'riskier' river. This spatiotemporal dichotomy in perceived predation risk may reflect a mismatch in nocturnal sensory capabilities between predator and prey, and would provide sufficient motivation for wallabies to create low-risk drinking holes. Drinking duration, our surrogate for harvest, was not influenced by drinking site type (hole versus river), drinking time or social context (solitary versus group), suggesting that some animals may not forego drinking during high-risk periods, as predicted and observed for some foraging animals. Compared to wallabies in groups, solitary wallabies were less likely to drink from the river, especially at night, and were more vigilant. Although evidence is limited, our research suggests that vigilance may be ineffective for nocturnally drinking wallabies in the face of this concealed, ambush predator. "}},{"citationKey":"Teich2009864","entryType":"article","entryTags":{"title":"\\{MANAGEMENT\\} \\{CONCEPT\\} \\{AND\\} \\{TOOLS\\} \\{OF\\} COMPETENCE-CELL \\{BASED\\} \\{MODULARIZED\\} \\{AGILE\\} \\{SUPPLY\\} \\{CHAINS\\} ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"42","number":"4","pages":"864 - 869","year":"2009","note":"13th \\{IFAC\\} Symposium on Information Control Problems in Manufacturing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20090603-3-RU-2001.0208","url":"http://www.sciencedirect.com/science/article/pii/S1474667016339027","author":"Tobias Teich and Dmitry Ivanov","keywords":["flexible supply network","agile supply chain","competence cells","extended value chain management "],"abstract":"Abstract The paper investigates the issue of how to bring more agility in supply chains through their integrated product-process driven modularizing and structuring. The paper introduces the competence cell based approach of integrated product-process driven modularizing and structuring supply chains and proposes a conceptual framework and information systems of competence cell-based modularized agile supply chains. The approach integrates the product modularization-driven postponement and flexible supply chain structuring downstream the order penetration point. The findings suggest that the integrated modularization and customer-oriented dynamical supply chain structuring are significant drivers of the supply chain agility. The elaborated conceptual framework provides deeper insights into supply chain modularization and agility from coordination and customer-oriented collaboration prospects. The concept is supported by mathematical models and information systems. It is the first in the literature that reports an approach of integrated product-process driven modularizing and structuring supply chains considering their inbound and outbound integrity in the immediate value adding processes. "}},{"citationKey":"Browning200923","entryType":"article","entryTags":{"title":"Reconceptualizing the effects of lean on production costs with evidence from the F-22 program ","journal":"Journal of Operations Management ","volume":"27","number":"1","pages":"23 - 44","year":"2009","note":"","issn":"0272-6963","doi":"http://dx.doi.org/10.1016/j.jom.2008.03.009","url":"http://www.sciencedirect.com/science/article/pii/S0272696308000211","author":"Tyson R. Browning and Ralph D. Heath","keywords":["Lean production","Lean manufacturing","Process improvement","Agile","Aircraft manufacturing","Learning curves","Case/field study "],"abstract":"A central tenet in the theory of lean production is that the implementation of lean practices will reduce waste and thereby decrease costs. However, not all lean implementations have produced such results. Apparently, this effect is moderated by several factors, potentially even to the point of reversal. It is important to increase our understanding of how this might occur. In this paper, we explore how novelty, complexity, instability, and buffering affect the relationship between lean implementation and production costs. An interest in these factors drew us to study the case of Lockheed Martin's production system for the F-22, an extremely complex and innovative product. To build theory, we synthesize our empirical data from the case with other existing theory, such as theories of learning and complexity. Through this analysis, we develop a revised framework that reconceptualizes the effect of lean on production costs and use it to develop 11 propositions to direct further research. Included among these are propositions about how the timing, scale, and extent of lean implementation can regulate the benefits of lean. Furthermore, when the objective of lean is construed as the provision of value, we propose that this value is an emergent property of a complex process, different from the mere sum of the values provided by its constituent tasks. Therefore, the elimination of tasks will not guarantee cost reduction, and lean may provide even greater value by incorporating some aspects of agile manufacturing. Overall, we develop a fuller range of the effects of lean practices on production costs and illuminate how operations managers might control key variables to draw greater benefits from lean implementation. "}},{"citationKey":"Bal2009570","entryType":"article","entryTags":{"title":"Virtual factory approach for implementation of holonic control in industrial applications: A case study in die-casting industry ","journal":"Robotics and Computer-Integrated Manufacturing ","volume":"25","number":"3","pages":"570 - 581","year":"2009","note":"","issn":"0736-5845","doi":"http://dx.doi.org/10.1016/j.rcim.2008.03.020","url":"http://www.sciencedirect.com/science/article/pii/S0736584508000586","author":"Mert Bal and Majid Hashemipour","keywords":["Agile manufacturing","Holonic manufacturing system","Virtual reality","Virtual factory","Re-configurability","Flow-line manufacturing "],"abstract":"Design and implementation of holonic manufacturing control systems for the real industrial applications require risky, careful decisions to ensure that the manufacturing system will successfully satisfy the demands of an ever-changing market. This paper suggests a virtual reality (VR)-based methodology for enhancing the design and implementation process of holonic control systems in manufacturing practice. The major focus has been given to the implementation of holonic control into the small to medium size manufacturing enterprises (SMEs). The 'virtual holonic factory' concept has been introduced, as a test bed for integration of a holonic control into a virtual factory, i.e. three-dimensional \\{VR\\} model of a factory in order to visually realize the effects of holonic control, when implemented to a real manufacturing system. A case study has been carried out in a medium size die-casting manufacturing plant. Through the virtual factory, a holonic control architecture for flow-line manufacturing system has been implemented for dynamic scheduling of machines in the medium size factory in order to achieve robustness necessary to handle the disturbances. The system performance and key attributes of the holonic control, such as re-configurability and robustness, have been tested and validated by using \\{VR\\} technology and analysis results have been presented. "}},{"citationKey":"Dimitropoulos2009248","entryType":"article","entryTags":{"title":"Agility index of automatic production systems: Reconfigurable logic and open source as agility enablers ","journal":"Computers in Industry ","volume":"60","number":"4","pages":"248 - 256","year":"2009","note":"The role of \\{IT\\} in advancing lean manufacturing ","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2009.01.007","url":"http://www.sciencedirect.com/science/article/pii/S0166361509000232","author":"Georgios P. Dimitropoulos","keywords":["Adaptability evaluation","Production timeliness","Control software cost","POSIX","Parametric control software "],"abstract":"Production agility becomes a measurable quantity when its scope is limited to those agility enablers that are demonstrated to positively influence the operation of a company. Strategic and tactical planning, along with flexible production, communication and cooperation infrastructures, were empirically demonstrated, in prior independent research, as significant predictors of financial performance. This paper introduces an index for measuring the ability of a company to timely and profitably exploit windows of upcoming commercial opportunity and a model for calculating the long-term cost of software in agile production environments. The evaluation focuses on the effects of the production infrastructure on the strategic and tactical ability of the company. Through the introduced index and software cost model, the impact of software on the agility of automatic production systems is explained, along with the benefits from reconfigurable production control software build upon open standards. "}},{"citationKey":"Cummins20091","entryType":"incollection","entryTags":{"title":"Chapter 1 - The Agile Enterprise ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"1 - 26","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00001-7","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000017","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter introduces basic concepts of the agile enterprise. An agile enterprise rapidly adapts to changing business challenges and opportunities and continuously improves to optimize cost, quality, and speed of delivery. It enables top management to quickly implement new strategies and control key business parameters to gain competitive advantage. Agility resolves some common business challenges faced by many enterprises. But the agile enterprise does not fit current business models. It requires a new business paradigm--a new way of thinking about the business and new ways of planning, organizing, operating, and controlling the business. Service-oriented architecture (SOA), business process management (BPM), and \\{MBM\\} are important aspects of this new agile enterprise business paradigm that is enabled by the supporting technologies. These concepts and relationships are applicable across many industries. Manufacturing provides a rich diversity of business functions and challenges, and it touches on most other industries. In financial services, much of the ability to develop and deliver new products depends on information technology. Telecommunications and financial services typically have great opportunities to exploit SOA, since these companies tend to experience many unresolved mergers and acquisitions. The telecommunications business is just starting to undergo major transformation with wireless technology and convergence with cable, the Internet, and entertainment. "}},{"citationKey":"Candido2009939","entryType":"article","entryTags":{"title":"\\{SOA\\} in reconfigurable supply chains: A research roadmap ","journal":"Engineering Applications of Artificial Intelligence ","volume":"22","number":"6","pages":"939 - 949","year":"2009","note":"Artificial Intelligence Techniques for Supply Chain Management ","issn":"0952-1976","doi":"http://dx.doi.org/10.1016/j.engappai.2008.10.020","url":"http://www.sciencedirect.com/science/article/pii/S0952197608001735","author":"Goncalo Candido and Jose Barata and Armando Walter Colombo and Francois Jammes","keywords":["Service-oriented architecture","Reconfigurable supply chains","SOA challenges","Roadmap","Service granularity","Industrial automation","DPWS "],"abstract":"Originally coming from the business world, service-oriented architecture (SOA) paradigm is expanding its range of application into several different environments. Industrial automation is increasingly interested on adopting it as a unifying approach with several advantages over traditional automation. In particular, the paradigm is well indicated to support agile and reconfigurable supply chains due to its dynamic nature. In this domain, the main goals are short time-to-market, fast application (re)configurability, more intelligent devices with lifecycle support, technology openness, seamless \\{IT\\} integration, etc. The current research challenges associated to the application of \\{SOA\\} into reconfigurable supply chains are enumerated and detailed with the aim of providing a roadmap into a major adoption of \\{SOA\\} to support agile reconfigurable supply chains. "}},{"citationKey":"Bottani2009380","entryType":"article","entryTags":{"title":"A fuzzy \\{QFD\\} approach to achieve agility ","journal":"International Journal of Production Economics ","volume":"119","number":"2","pages":"380 - 391","year":"2009","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2009.02.013","url":"http://www.sciencedirect.com/science/article/pii/S0925527309000929","author":"Eleonora Bottani","keywords":["Agility","Supply chain management","Quality function deployment","House of quality","Fuzzy logic "],"abstract":"In modern business environments, agility is advocated as the fundamental characteristics for competitiveness. Little research, however, exists which provides integrated methodologies suitable to be practically adopted to enhance agility of companies. This paper presents an original approach, which, by linking competitive bases, agile attributes and agile enablers, aims at identifying the most appropriate enablers to be implemented by companies starting from competitive characteristics of the related market. The approach is based on the quality function deployment (QFD) methodology, and, in particular, on the house of quality (HOQ), which has been successfully adopted in the new product development field. The whole scaffold exploits fuzzy logic, to translate linguistics judgements required for relationships and correlations matrixes into numerical values. An illustrative example, grounded on data available in literature, is proposed and discussed to show the application of the tool developed. "}},{"citationKey":"Cummins200927","entryType":"incollection","entryTags":{"title":"Chapter 2 - Service-Oriented Architecture ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"27 - 73","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00002-9","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000029","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter provides a first-step approach in understanding the fundamental nature of service-oriented architecture (SOA). It also discusses other aspects of the agile enterprise and examines how they complement or support SOA. A \\{SOA\\} is a new business design paradigm, a fundamental aspect of the design of an agile enterprise that supports improved speed, cost, and quality. Service units are its building blocks. A \\{SOA\\} does not require electronic technology, but automation, integration, and modeling using electronic technologies are essential to an optimal implementation of SOA. The full implementation of \\{SOA\\} transforms the enterprise from top to bottom. \\{SOA\\} enables the sharing of business capabilities where those capabilities may be used in a variety of business contexts. \\{SOA\\} provides the transparency that allows a shared capability to be provided by a service unit within the enterprise or as a service of a different enterprise. "}},{"citationKey":"Cummins2009231","entryType":"incollection","entryTags":{"title":"Chapter 9 - Agile Governance ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"231 - 267","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00009-1","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000091","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter describes a governance framework as a basis for governance of an agile enterprise. Alignment with the governance framework gives the board of directors and executive management improved oversight and control of the enterprise operation--and much greater assurance that the enterprise is doing the right thing and doing it well. It also empowers individual service units to optimize the value they contribute from an enterprise perspective while holding them accountable for meeting performance objectives and complying with enterprise directives and government regulations. Many factors must converge to achieve the agile enterprise level. Service-oriented architecture (SOA) provides the basic architectural pattern for defining, integrating, and managing the capabilities of the enterprise--the service units. Other factors support integration, optimization, security, accountability, and adaptation of those service units. Governance is what pulls it all together and directs the efforts to achieve enterprise agility and stockholder value. "}},{"citationKey":"Cummins2009127","entryType":"incollection","entryTags":{"title":"Chapter 5 - Enterprise Information Management ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"127 - 154","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00005-4","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000054","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter focuses on the information management issues of a service-oriented, agile enterprise. It discusses their implications for enterprise information management (EIM). It is not a comprehensive discussion of \\{EIM\\} requirements and methodology but rather a discussion of \\{EIM\\} from a business perspective and a focus on the aspects of \\{EIM\\} that require particular attention in a service-oriented, agile enterprise. Information is the lifeblood of the enterprise. Without information there can be no coordinated activity, no record of accomplishments, no plans for the future. Management of information is a critical responsibility and becomes increasingly critical as enterprises become international and require greater agility. \\{EIM\\} involves the validation, transformation, storage, communication, and presentation of data to provide information to support the pursuit of enterprise objectives. Data are the raw materials typically managed by computers; information is the organized presentation of data in context that has business meaning to humans. "}},{"citationKey":"Cummins2009155","entryType":"incollection","entryTags":{"title":"Chapter 6 - \\{SOA\\} Security ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"155 - 185","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00006-6","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000066","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter focuses on security concerns that arise or are amplified for the agile enterprise, particularly concerns raised by service-oriented architecture (SOA). It assumes that attention has already been given to such concerns as physical security, threats of intrusion from the World Wide Web, and virus protection. Its purpose is to provide an understanding of the requirements and approaches for optimizing security for services, from an enterprise perspective, so that management can plan for and commit to the necessary enterprise transformation. With the advent of the public Internet and the World Wide Web, security risks have increased dramatically. Systems are exposed to public access and email messages can carry or link to corrupting software. Automation and electronic communications have added new dimensions to security concerns. Electronic integration of services, extending beyond the walls of the enterprise, has created new security exposures. Fortunately, \\{SOA\\} technology and related industry standards have created new opportunities for accountability and control. "}},{"citationKey":"Hussain2009196","entryType":"article","entryTags":{"title":"An Intranet based system as an enabler in effective project management and implementation of quality standards: A case study ","journal":"Journal of Engineering and Technology Management ","volume":"26","number":"3","pages":"196 - 210","year":"2009","note":"","issn":"0923-4748","doi":"http://dx.doi.org/10.1016/j.jengtecman.2009.06.003","url":"http://www.sciencedirect.com/science/article/pii/S0923474809000253","author":"Zahid Hussain and Kevin Barber and Naveed Hussain","keywords":["Intranet based information systems","Quality standards","ISO9001:2000","Engineering case study","Knowledge management "],"abstract":"This paper reports on the development of an Intranet based system, as an enabler in project management and implementation of a quality standard (ISO9001:2000) at Tyco Fire &amp; Integrated Solutions Oil Gas &amp; Marine Europe, a subsidiary of Tyco International a worldwide Engineering Conglomerate, (Referred to as TFIS). The system enabled stakeholders to follow standard project protocols, playing an important role in creating integration between different sub-sections. This paper discusses the strategic relevance of the system in achieving desired business outcomes, by making the organisation more responsive, agile and increasing the accountability of stakeholders involved in managing projects. "}},{"citationKey":"Ganguly2009410","entryType":"article","entryTags":{"title":"Evaluating agility in corporate enterprises ","journal":"International Journal of Production Economics ","volume":"118","number":"2","pages":"410 - 423","year":"2009","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2008.12.009","url":"http://www.sciencedirect.com/science/article/pii/S092552730800385X","author":"Anirban Ganguly and Roshanak Nilchiani and John V. Farr","keywords":["Agility","Metrics","Quantification","Corporate enterprises "],"abstract":"Being able to adapt successfully and efficiently to unexpected changes in the business environment or agile is key in gaining a competitive advantage in the global market. There has been little discussion in the open literature on measuring and quantifying agility. This paper is devoted to developing a framework and quantifying the notion of agility. We propose three techniques and associated metrics for determining enterprise agility. Lastly, the paper presents a case study related to Apple's(r) digital media to demonstrate the utility of the methodology and associated metrics. "}},{"citationKey":"Cummins2009207","entryType":"incollection","entryTags":{"title":"Chapter 8 - Event-Driven Agility ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"207 - 229","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00008-X","url":"http://www.sciencedirect.com/science/article/pii/B978012374445600008X","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter focuses on how events drive change in the enterprise. The enterprise must recognize relevant events, analyze the threat or opportunity to determine a resolution, and implement appropriate changes to its business operations to maintain or improve its role in the ecosystem. Enterprises are not only driven by requests for services but also by events that occur both within the enterprise and in the business environment in which the enterprise functions. Not all events drive change. There are many events that occur in the normal course of business, such as receipt of a customer order, a payment became overdue, a defect was detected, a machine failed, a shift ended. However, disruptive events are those that suggest that a change has occurred in the enterprise ecosystem that impacts the ability of the enterprise to achieve optimal value now or particularly in the future. Service-oriented architecture (SOA) can make an enterprise more flexible, accountable, and efficient, but it does not necessarily make it agile. The agile enterprise must be responsive to disruptive events. At the same time, an enterprise that is responsive to disruptive events is not agile if the responses are not timely and effective. \\{SOA\\} enables changes to be implemented more quickly and efficiently because--capabilities are consolidated and consistent, so changes can be more easily defined and deployed, service units can change their capabilities with minimal impact on other service units, automated business processes can be more quickly changed, and the impact of changes on related products, services, and capabilities can be more easily understood and optimized from an enterprise perspective. "}},{"citationKey":"Miller2009343","entryType":"article","entryTags":{"title":"Resolving dynamic parameters of the August 2007 Titania and Ariel occultations by Umbriel ","journal":"Icarus ","volume":"200","number":"1","pages":"343 - 346","year":"2009","note":"","issn":"0019-1035","doi":"http://dx.doi.org/10.1016/j.icarus.2008.12.010","url":"http://www.sciencedirect.com/science/article/pii/S0019103508004363","author":"C. Miller and N.J. Chanover","keywords":["Occultations","Uranus","satellites","Orbit determination","Satellites","dynamics","Satellites","surfaces "],"abstract":"We observed the 15 August 2007 occultation of the uranian satellite Titania and the 19 August 2007 occultation of Ariel by Umbriel using the Agile high-speed photometer on the \\{APO\\} 3.5 m telescope. We find that the Titania event midpoint occurred at 09:16:39.20 \\{UT\\} and the Ariel event midpoint at 07:59:49.4 UT, which was 26.2 s and 37.4 s later than predicted, respectively. Our best fit impact parameter was 71.0 km for the Titania occultation and 476.9 km for the Ariel event, both of which were less than predicted. "}},{"citationKey":"Cummins2009269","entryType":"incollection","entryTags":{"title":"Chapter 10 - Model-Based Management ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"269 - 285","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00010-8","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000108","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter examines the requirements for business modeling, particularly those requirements related to business design and the agile enterprise. This is an emerging technology, so some of the capabilities are supported by modeling tools and some needs are just gaining recognition. It focuses at current modeling technology and examines some enhanced modeling capabilities that should be integrated into modeling tools in the future. It discusses tactical approaches that use currently available tools and technology. Service-oriented architecture (SOA) and business process management (BPM) provide the basis of a consistent business architecture to enable more robust models to be developed. Models are abstractions. To be valid abstractions, they must be able to make certain assumptions about the consistency of the problem space. Business models should be built to provide increasingly powerful models for managing, optimizing, and transforming the enterprise. Service units are persistent components of the business with consistent mechanisms for their interaction. An agile enterprise based on \\{SOA\\} and \\{BPM\\} preserves most of the operational units and their optimized capabilities as the business changes, even though the management hierarchy may change dramatically and new lines of business may require significantly new value chains. "}},{"citationKey":"Cummins200975","entryType":"incollection","entryTags":{"title":"Chapter 3 - Business Process Management ","editor":"Cummins, Fred A. ","booktitle":"Building the Agile Enterprise ","publisher":"Morgan Kaufmann","edition":"","address":"Burlington","year":"2009","pages":"75 - 108","series":"The MK/OMG Press","isbn":"978-0-12-374445-6","doi":"http://dx.doi.org/10.1016/B978-0-12-374445-6.00003-0","url":"http://www.sciencedirect.com/science/article/pii/B9780123744456000030","author":"Fred A. Cummins","abstract":"Publisher Summary This chapter reveals how business process management (BPM) complements and extends service-oriented architecture (SOA) to enable the definition, integration, and continuous improvement of services. \\{BPM\\} is a management discipline that focuses on the design of business processes and continuous improvement of the speed, cost, and quality of business operations. \\{BPM\\} emphasizes the documentation of repeatable business processes as the basis for analysis and improvement. This includes both manual and automated business processes. Information technology provides the ability to model business processes for more precise specifications and the ability to automate processes for controlled execution. Though not all business processes are automated, the speed, reliability, and discipline of automated processes suggest that most business processes should be automated, if possible. In particular, the processes that drive the integration and high-level execution of service unit activities should be automated to support consistent and effective operations. Consequently, though the agile enterprise includes manual business processes, our emphasis here is on the automated business processes that, for the most part, drive the operation of an agile enterprise. \\{SOA\\} brings a fundamental pattern to the design of business processes. Business processes do not exist independent of service units, and processes are confined to management of activities within an associated service unit. Business processes specify how service units produce value. For readers who are familiar with object-oriented programming, service units are like objects and business processes are like methods. "}},{"citationKey":"Strube2009334","entryType":"article","entryTags":{"title":"Stage-dependent transcriptional changes and characterization of paramyosin of the bovine lungworm Dictyocaulus viviparus ","journal":"Parasitology International ","volume":"58","number":"4","pages":"334 - 340","year":"2009","note":"","issn":"1383-5769","doi":"http://dx.doi.org/10.1016/j.parint.2009.07.003","url":"http://www.sciencedirect.com/science/article/pii/S1383576909000750","author":"C. Strube and S. Buschbaum and G. von Samson-Himmelstjerna and T. Schnieder","keywords":["Dictyocaulus viviparus","Lungworm","Paramyosin","Introns","Real time PCR","Relative quantification "],"abstract":"The bovine lungworm Dictyocaulus viviparus is of major economic importance in cattle farming in the temperate zones. The invertebrate protein paramyosin is one of the main components of muscle thick filaments but can also exhibit immunomodulatory functions. It represents a promising vaccine candidate in parasitic helminths. In this study, D. viviparus paramyosin (DvPmy) was characterized on the transcriptional as well as genomic level. The identified genomic sequence comprises 19 introns compared to only 10 introns in the Caenorhabditis elegans orthologue. Quantitative real time \\{PCR\\} transcriptional analysis revealed paramyosin transcription throughout the whole parasite's life cycle with the highest transcription rate in the agile moving first-stage larvae and the lowest in motionless hypobiosis induced third stage larvae. Recombinantly expressed DvPmy was found to bind collagen and IgG. Thereby the present study is the first showing that nematode paramyosin has the capability for immunomodulation and thus may be involved in host immune defence. "}},{"citationKey":"Borangiu2009505","entryType":"article","entryTags":{"title":"An implementing framework for holonic manufacturing control with multiple robot-vision stations ","journal":"Engineering Applications of Artificial Intelligence ","volume":"22","number":"4-5","pages":"505 - 521","year":"2009","note":"","issn":"0952-1976","doi":"http://dx.doi.org/10.1016/j.engappai.2009.03.001","url":"http://www.sciencedirect.com/science/article/pii/S095219760900061X","author":"Theodor Borangiu and Pascal Gilbert and Nick-Andrei Ivanescu and Andrei Rosu","keywords":["Holonic manufacturing","Semi-heterarchical control","Robotics","Real-time vision","Applied \\{AI\\} "],"abstract":"The paper describes a holonic control architecture and implementing issues for agile job shop assembly with networked intelligent robots, based on the dynamic simulation of material processing and transportation. The holarchy was defined considering the \\{PROSA\\} reference architecture relative to which in-line vision-based quality control was added by help of feature-based descriptions of the material flow. Two solutions for production planning are proposed: a knowledge-based algorithm using production rules, and an \\{OO\\} resolved scheduling rate planner (RSRP) based on variable-timing simulation. Failure- and recovery-management are developed as generic scenarios embedding the \\{CNP\\} mechanism into production self-rescheduling. Aggregate Order Holon execution is realized by OPC-based \\{PLC\\} software integration and event-driven product transportation. The holonic control of multiple networked robot-vision stations also features tolerance to station computer- (IBM PC-type), station controller- (robot controller), quality control- (machine vision) and communication- (LAN) failure. Fault tolerance and high availability at shop-floor level are provided due to the multiple physical communication capabilities of the robot controllers, to their multiple-axis multitasking operating capability, and to hardware redundancy of single points of failure (SPOF). Implementing solutions and experiments are reported for a 6-station robot-vision assembly cell with twin-track closed-loop pallet transportation system and product-racking RD/WR devices. Future developments will consider manufacturing integration at enterprise level. "}},{"citationKey":"Nyari2009613","entryType":"article","entryTags":{"title":"Phylogenetic relationships of flowerpeckers (Aves: Dicaeidae): Novel insights into the evolution of a tropical passerine clade ","journal":"Molecular Phylogenetics and Evolution ","volume":"53","number":"3","pages":"613 - 619","year":"2009","note":"","issn":"1055-7903","doi":"http://dx.doi.org/10.1016/j.ympev.2009.06.014","url":"http://www.sciencedirect.com/science/article/pii/S1055790309002528","author":"Arpad S. Nyari and A. Townsend Peterson and Nathan H. Rice and Robert G. Moyle","keywords":["Dicaeidae","Dicaeum","Prionochilus","Flowerpeckers","Molecular phylogeny","Monophyly","Taxonomy","Morphological evolution "],"abstract":"Understanding the relationships and evolution of flowerpeckers has been challenging, particularly as no phylogenetic study has as yet assessed the group. Here, we present a first such analysis of this clade based on sequences of two mitochondrial genes and one nuclear intron. Our analyses offer strong support for monophyly of the Dicaeidae. Within the family, 4 Dicaeum species (D. chrysorrheum, D. melanoxanthum, D. agile, and D. everetii) had closer affinity to Prionochilus, although tests of alternative topologies could not reject reciprocal monophyly of the two genera. Across the family, overall bill shape trends from more stout bills basally to more slender and medium bills, whereas sexual dichromatism and plumage patterns show much more homoplasy. Taxonomically, generic allocations may need to be changed to reflect historical relationships better. "}},{"citationKey":"Zhu20092606","entryType":"article","entryTags":{"title":"A service-oriented city portal framework and collaborative development platform ","journal":"Information Sciences ","volume":"179","number":"15","pages":"2606 - 2617","year":"2009","note":"Including Special Issue on Computer-Supported Cooperative WorkTechniques and ApplicationsThe 11th Edition of the International Conference on \\{CSCW\\} in Design ","issn":"0020-0255","doi":"http://dx.doi.org/10.1016/j.ins.2009.01.038","url":"http://www.sciencedirect.com/science/article/pii/S0020025509000668","author":"Donglai Zhu and Yinsheng Li and Junshuai Shi and Yingxiao Xu and Weiming Shen","keywords":["Service-oriented architecture","Web services","Digital city","Service-oriented portal","Model driven architecture "],"abstract":"Cities are being equipped with multiple information systems to provide public services for city officials, officers, citizens, and tourists. There have been concerns with efficient service implementation and provision, e.g., data islands and function overlaps between systems and applications. Service-oriented portals are efficient at facilitating information sharing and collaborative work between city systems and users. The goal of this research is to make cities responsive, agile and to provide composite services efficiently and cost efficiently. A service-oriented framework for city portals is proposed to design, integrate and streamline city systems and applications. A model driven collaborative development platform of the proposed framework was developed for service-oriented digital portals. The architecture and implementation issues of the platform are discussed. The service identification policies are discussed within the framework. A case study has been developed and evaluated on the platform to provide a composite service, i.e., a traffic search service on a city portal. "}},{"citationKey":"Kuhnrich200949","entryType":"article","entryTags":{"title":"Formal Model-Driven Design of Distributed Algorithms ","journal":"Electronic Notes in Theoretical Computer Science ","volume":"251","number":"","pages":"49 - 64","year":"2009","note":"Proceedings of the International Doctoral Workshop on Mathematical and Engineering Methods in Computer Science (MEMICS 2008) ","issn":"1571-0661","doi":"http://dx.doi.org/10.1016/j.entcs.2009.08.027","url":"http://www.sciencedirect.com/science/article/pii/S1571066109003521","author":"Morten Kuhnrich","keywords":["Model Driven Development","Fault Tolerance","Distributed Consensus","Distributed Agreement","Model Checking","Formal Verification "],"abstract":"We examine the use of formal model-driven development for creation and improvement of distributed algorithms. We use the integrated modeling and verification tool \\{UPPAAL\\} as our supporting tool. Instead of the traditional design, code and test-cycles known from agile paradigms, we employ formal model, verification and correction-cycles. The success of this approach is demonstrated on a distributed agreement algorithm from 1996 by Chandra and Toueg. We improve the number of communication rounds needed in the best-case from n to 2 where n is the number of agents. We end the paper with a correctness argument for systems with n agents. Formal model-driven development thus seems to be a fruitful approach for development of distributed algorithms. "}},{"citationKey":"Grefen200986","entryType":"article","entryTags":{"title":"Dynamic business network process management in instant virtual enterprises ","journal":"Computers in Industry ","volume":"60","number":"2","pages":"86 - 103","year":"2009","note":"","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2008.06.006","url":"http://www.sciencedirect.com/science/article/pii/S0166361508000675","author":"Paul Grefen and Nikolay Mehandjiev and Giorgos Kouvas and Georg Weichhart and Rik Eshuis","keywords":["Business process management","Virtual enterprise","Dynamic supply chain","Electronic business "],"abstract":"Nowadays, business supply chains for the production of complex products or services are likely to involve a number of autonomous organizations. The competitive market requires that these supply chains are highly agile, effective and efficient. Agility and effectiveness are obtained by forming highly dynamic virtual enterprises within supplier networks. We call these instant virtual enterprises (IVEs). The required efficiency of creating and operating \\{IVEs\\} can only be obtained by automated support for design, setup and enactment of business processes within these IVEs. This process support involves the dynamic composition of local processes of network members into global processes at the \\{IVE\\} level. This functionality goes significantly beyond traditional approaches for interorganizational workflow management. The approach, architecture and technology required for this dynamic network process management in \\{IVEs\\} are outlined in this paper. We show how the developed approach is applied in the automotive industry in the context of the CrossWork \\{IST\\} project. "}},{"citationKey":"Wang2009620","entryType":"article","entryTags":{"title":"A multi-agent based agile manufacturing planning and control system ","journal":"Computers & Industrial Engineering ","volume":"57","number":"2","pages":"620 - 640","year":"2009","note":"Challenges for Advanced Technology ","issn":"0360-8352","doi":"http://dx.doi.org/10.1016/j.cie.2009.05.015","url":"http://www.sciencedirect.com/science/article/pii/S0360835209001715","author":"Li-Chih Wang and Sian-Kun Lin","keywords":["RFID","Multi-agent","Manufacturing planning and control "],"abstract":"In today's manufacturing enterprise, the performance of customer service level (e.g., short ordering-to-delivery time, low price) is highly dependent on the effectiveness of its manufacturing planning and control system (MPCS). However, most of the current MPCS, employed the hierarchical planning approach, may have some drawbacks, such as structural rigidity, difficulty of designing a control system, and lack of flexibility. Currently, \\{RFID\\} (Radio Frequency Identification) technology has been applied to enhance the visibility, accountability, track ability and traceability of manufacturing system whenever the accurate and detailed manufacturing information (e.g., raw material, WIP, products in factory and products in the down streams) of products will be followed in real-time basis by \\{RFID\\} technique. In addition, a multi-agent approach may be applied in a distributed and autonomous system which allows negotiation-based decision making. Therefore, the objective of this research is to study the application of \\{RFID\\} technique and multi-agent system (MAS) in developing an agent-based agile manufacturing planning and control system (AMPCS) to respond to the dynamically changing manufacturing activities and exceptions. In AMPCS, RFID-based manufacturing control (R-MC) module plays the role of controlling the manufacturing system in which production items and manufacturing resources attached with \\{RFID\\} tag may actively feedback production status to and receive production and operations schedule from advanced manufacturing planning (AMP) module. In addition, a bidding process and algorithm is developed to generate operations schedule by using the characteristics of MAS. Performance analysis (PA) module is responsible not only for evaluating the scheduling results but also for evaluating the performance of production execution. The development of an \\{AMPCS\\} for an automated manufacturing cell demonstrates that the integration of \\{RFID\\} technique and \\{MAS\\} in developing an agile manufacturing planning and control system can really possess the characteristics of visibility, accountability, track ability, responsiveness, and flexibility in a distributed and dynamic manufacturing system. "}},{"citationKey":"Wellington2009195","entryType":"incollection","entryTags":{"title":"Chapter 6 - Cognitive Policy Engines ","editor":"Fette, Bruce A. ","booktitle":"Cognitive Radio Technology (Second Edition) ","publisher":"Academic Press","edition":"Second Edition","address":"Oxford","year":"2009","pages":"195 - 222","isbn":"978-0-12-374535-4","doi":"http://dx.doi.org/10.1016/B978-0-12-374535-4.00006-0","url":"http://www.sciencedirect.com/science/article/pii/B9780123745354000060","author":"Robert J. Wellington","abstract":"Publisher Summary This chapter discusses the cognitive policy engines. It concerns the application of policy management to cognitive radio (CR) technology in general, and to spectrum management for frequency-agile radios in particular. It focuses on what lessons can be learned from prior applications of policy management to network resource problems. It reviews and leverages previous standards, research, and commercial implementations for policy engines, and applies them to the architecture and design of policy engines for CRs. The concept of automatic policy management of resources has its commercial roots in the administration of information systems and networks. Policy management refers to a particular approach for automating network management activities by specifying organizational objectives that can be interpreted and enforced by the network itself. The automatic application of management policies provides flexibility to change the configuration of network devices at runtime to satisfy administrative goals and constraints regarding security, resource allocation, application priorities, or quality of service. "}},{"citationKey":"Staicu2009409","entryType":"article","entryTags":{"title":"Recursive modelling in dynamics of Agile Wrist spherical parallel robot ","journal":"Robotics and Computer-Integrated Manufacturing ","volume":"25","number":"2","pages":"409 - 416","year":"2009","note":"","issn":"0736-5845","doi":"http://dx.doi.org/10.1016/j.rcim.2008.02.001","url":"http://www.sciencedirect.com/science/article/pii/S0736584508000100","author":"Stefan Staicu","keywords":["Dynamics","Kinematics","Parallel robot","Virtual work "],"abstract":"Recursive matrix relations for kinematics and dynamics of the 3-RRR Agile Wrist spherical parallel robot are established in this paper. The prototype of the robot is a three-degrees-of-freedom mechanism with three identical legs. Controlled by concurrent torques, which are generated by some electric motors, the active elements of the robot have three independent rotations. Knowing the rotation motion of the moving platform, we develop first the inverse kinematical problem and determine the velocities and accelerations. Further, the principle of virtual work is used in the inverse dynamic problem. Matrix equations offer iterative expressions and graphs for the power requirement comparison of each of three actuators in two computational complexities: complete dynamic model and simplified dynamic model. "}},{"citationKey":"Afsarmanesh2009209","entryType":"article","entryTags":{"title":"On management of 2nd generation Virtual Organizations Breeding Environments ","journal":"Annual Reviews in Control ","volume":"33","number":"2","pages":"209 - 219","year":"2009","note":"","issn":"1367-5788","doi":"http://dx.doi.org/10.1016/j.arcontrol.2009.05.007","url":"http://www.sciencedirect.com/science/article/pii/S1367578809000571","author":"Hamideh Afsarmanesh and Luis M. Camarinha-Matos and Simon S. Msanjila","keywords":["Virtual organization","Collaborative networks","Virtual Organizations Breeding Environment","Reference framework","Trust","Value system","Competency management","Ontology engineering","Negotiation "],"abstract":"Nowadays, in a wide variety of sectors from production-based to service-oriented, temporary collaboration among organizations in the so-called Virtual Organizations (VOs), is the trend adopted by most, and in particular by small and medium enterprises. Pre-existence of long-term associations/clusters of active and competitive organizations, the so-called Virtual Organizations Breeding Environments (VBEs), is shown to greatly enhance dynamic creation of VOs. A number of \\{VBEs\\} have been formed world-wide during the last decade, mostly among organizations located in a common region, with common business culture, and primarily focus on specific lines of activities. This paper however addresses the 2nd generation \\{VBEs\\} that are not bound to geographical regions or specific activities. These \\{VBEs\\} shall play an active role in the society/market as competitive entities, and need to effectively support agile configuration and establishment of dynamic VOs. Furthermore, the 2nd generation \\{VBEs\\} require enabling \\{ICT\\} infrastructure and tools, to facilitate their daily management activities as well as supporting the collaboration among their member organizations. The paper introduces a number of models, methodologies and tools designed and developed to support 2nd generation VBEs. "}},{"citationKey":"Gosling2009741","entryType":"article","entryTags":{"title":"Engineer-to-order supply chain management: A literature review and research agenda ","journal":"International Journal of Production Economics ","volume":"122","number":"2","pages":"741 - 754","year":"2009","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2009.07.002","url":"http://www.sciencedirect.com/science/article/pii/S0925527309002394","author":"Jonathan Gosling and Mohamed M. Naim","keywords":["Engineer-to-order","Project","One-of-a-kind","Supply chain","Literature review "],"abstract":"Product proliferation as a result of meeting ever increasing customer demand preferences is well documented. In addition, customisation has been promoted as a source of competitive advantage. Despite these factors, most of the published research in operations and supply chain management has neglected the needs of the 'engineer-to-order' (ETO) sector and there is no major systematic literature review for the \\{ETO\\} supply chain. This paper presents a comprehensive literature review of published material relating to \\{ETO\\} supply chains. It contributes to the development of a more robust definition of the \\{ETO\\} supply chain, helps to identify strategies that are suitable and investigates the relationship of the \\{ETO\\} sector with lean and agile approaches. The review also presents an analysis of research methods and industry sectors that emerge from the literature search. By analysing different streams of literature this paper helps to provide a foundation for thinking about engineer-to-order supply chain definitions and strategies and provides a research agenda to guide further study. "}},{"citationKey":"Hanafizadeh200910120","entryType":"article","entryTags":{"title":"Designing fuzzy-genetic learner model based on multi-agent systems in supply chain management ","journal":"Expert Systems with Applications ","volume":"36","number":"6","pages":"10120 - 10134","year":"2009","note":"","issn":"0957-4174","doi":"http://dx.doi.org/10.1016/j.eswa.2009.01.008","url":"http://www.sciencedirect.com/science/article/pii/S095741740900044X","author":"Payam Hanafizadeh and Mohammad Hussein Sherkat","keywords":["Supply chain management (SCM)","Multi-agent system (MAS)","Fuzzy inference (FI)","Genetic algorithm (GA)","Self organized maps (SOM) "],"abstract":"Abstract Supply chain requirements and challenges in recent years have made managers to explore new methods in dealing with supply chain management (SCM) problems. Methods with high flexibility which can adapt plans to real conditions help one to make a decision at the right time. In the SCM, distribution and allocation problems are of enormous significance and due to their applications in the cross-functional and final parts of \\{SCM\\} problems, they are in a particular position among the \\{SCM\\} problems. In this paper, by proposing an architecture based up on multi-agent system (MAS), a model is developed to tackle such problems as the nature of supply chain distributions, dynamic distributions systems (DS), uncertain parameters in DS, management of diverse objectives in DS, need for flexibility in \\{DS\\} and other factors considered as challenges and designing requirements in an agile model which can be all found in the SCM. \\{MAS\\} was used in this article owing to their special attributes and features. In MAS, each agent follows up a duty in a self-contained way and is able to adapt it to the environmental changes, after all helping the system to stay alive. "}},{"citationKey":"Leidner200980","entryType":"article","entryTags":{"title":"The role of \\{IT\\} in crisis response: Lessons from the \\{SARS\\} and Asian Tsunami disasters ","journal":"The Journal of Strategic Information Systems ","volume":"18","number":"2","pages":"80 - 99","year":"2009","note":"","issn":"0963-8687","doi":"http://dx.doi.org/10.1016/j.jsis.2009.05.001","url":"http://www.sciencedirect.com/science/article/pii/S096386870900016X","author":"Dorothy E. Leidner and Gary Pan and Shan L. Pan","keywords":["Crisis response","Disaster response","Resource based view","Coordination theory","Crisis response information system","Soft positivism "],"abstract":"Research on crisis management recognizes the important role of information although few studies of crisis response deal explicitly with information systems. In this paper, we present a case study of Singapore's response to the \\{SARS\\} and Asian Tsunami disasters. Using the resource-based view of the firm as our theoretical lens, we examine three research questions: what \\{IS\\} resources are needed in crisis response, how are these \\{IS\\} resources bundled with other non-IS resources, and how are they effectively coordinated? Our analysis of the case suggests that existing assets such as information technology infrastructure, leadership, and collaborative networks and existing capabilities such as the ability to build and apply IT, the ability to recognize signals and the ability to see the big picture are critical during crisis response. The actions taken using these assets and capabilities include informing resolutely, gaining stakeholder commitment and agile mobilizing of people and IT. Our analysis further suggests that coordination mechanisms, namely the crisis response organizational, informational, and \\{IT\\} structures, are important facilitators of the response actions. The resulting framework of resource deployment during crisis response extends the resource based view of the firm into a cooperative setting, aiming to understand the nature of \\{IS\\} resource value in a cooperative context, and considers not just the resources per se, but the means of coordination the resources. "}},{"citationKey":"Franzen2009462","entryType":"article","entryTags":{"title":"Single point incremental forming of \\{PVC\\} ","journal":"Journal of Materials Processing Technology ","volume":"209","number":"1","pages":"462 - 469","year":"2009","note":"","issn":"0924-0136","doi":"http://dx.doi.org/10.1016/j.jmatprotec.2008.02.013","url":"http://www.sciencedirect.com/science/article/pii/S0924013608001398","author":"V. Franzen and L. Kwiatkowski and P.A.F. Martins and A.E. Tekkaya","keywords":["Single point incremental forming","PVC","Formability "],"abstract":"Polymers represent an important percentage of the raw materials currently utilized in manufacturing applications but their conventional processing techniques are mainly suitable for mass production. Growing requirements of low volume, high quality, customized products are triggering the need for developing innovative flexible polymer processing techniques that are capable of dealing with the new agile manufacturing trends involving very short life cycles and very short development and production lead times. This paper is concerned with these issues and is focused on the possibility of employing the single point incremental forming technology currently being developed for flexible sheet metal forming applications, for producing low cost, small-batch, high-quality polymeric sheet components. Experimentation is based on the utilization of an ordinary \\{CNC\\} milling machine and a single point forming tool to shape commercial \\{PVC\\} sheets and the overall investigation is centred on the characterization and evaluation of the formability limits of the process as a function of the major operating parameters. Results show that single point incremental forming of commercial \\{PVC\\} sheets at room temperature seems promising for the manufacture of complex polymer sheet components with very high depths. "}},{"citationKey":"Borangiu2009624","entryType":"article","entryTags":{"title":"Management of changes in a holonic manufacturing system with dual-horizon dynamic rescheduling of production orders ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"42","number":"4","pages":"624 - 629","year":"2009","note":"13th \\{IFAC\\} Symposium on Information Control Problems in Manufacturing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20090603-3-RU-2001.0139","url":"http://www.sciencedirect.com/science/article/pii/S1474667016338642","author":"Theodor Borangiu and Silviu Raileanu and Andrei Rosu and Mihai Parlea and Florin D. Anton","keywords":["holonic manufacturing","distributed control","reconfigurable systems","robotics","applied \\{AI\\} "],"abstract":"Abstract The paper describes a solution and implementing framework for the management of changes which may occur in a holonic manufacturing system. This solution is part of the semi-heterarchical control architecture developed for agile job shop assembly with intelligent robots-vision workstations. Two categories of changes in the manufacturing system are considered: (i) changes occurring in resource status at process level: resource breakdown, failure of (vision-based) in-line inspection operation, and depletion of local robot storages; (ii) changes in production orders at business (ERP) level: rush orders. All these situations trigger production plan update and rescheduling (redefine the list of Order Holons) by pipelining CNP-type resource bidding at shop-floor horizon with global product scheduling at aggregate batch horizon. Failure- and recovery management are developed as generic scenarios embedding the \\{CNP\\} mechanism into production self-rescheduling. Implementing solutions and experimental results are reported for a 6-station robot-vision assembly cell with twin-track closed-loop pallet transportation system and product tracking RD/WR devices. Future developments will consider manufacturing integration at enterprise level. "}},{"citationKey":"Bishop200937","entryType":"incollection","entryTags":{"title":"Chapter 4 - Design from the top-down ","editor":"Bishop, Tony ","booktitle":"Next Generation Datacenters in Financial Services ","publisher":"Elsevier","edition":"","address":"Boston","year":"2009","pages":"37 - 73","isbn":"978-0-12-374956-7","doi":"http://dx.doi.org/10.1016/B978-0-12-374956-7.00004-8","url":"http://www.sciencedirect.com/science/article/pii/B9780123749567000048","author":"Tony Bishop","abstract":"Publisher Summary The traditional bottom-up datacenter model, complete with generic resources organized into silos of operations to meet business needs, results in missed business opportunities and is at the root of datacenter sprawl. A top-down model oriented around the business value chain that defines business demand in real time and drives the dynamic allocation of virtual resources from tailored fit-for-purpose physical resources leads to an effective business solution and resource efficient Next Generation Datacenter (NGDC). Becoming top-down business-demand focused requires a more nimble infrastructure design and a radically different management model. The primary goal of a top-down design is to be responsive to real-time business events. \\{RTI\\} design requires a significant understanding of the needs of the environment. The introduction of Fit-for-Purpose \\{RTI\\} as an approach for \\{IT\\} to become more agile is not just about buying particular sets of technology. The Next Generation Datacenter reference architecture is used to guide the design and construction approaches necessary to build the NGDC. Finally, this chapter discusses a set of guiding design principles organized around efficient, high performance, and control. "}},{"citationKey":"Hartel200953","entryType":"article","entryTags":{"title":"Pond and landscape determinants of Rana dalmatina population sizes in a Romanian rural landscape ","journal":"Acta Oecologica ","volume":"35","number":"1","pages":"53 - 59","year":"2009","note":"","issn":"1146-609X","doi":"http://dx.doi.org/10.1016/j.actao.2008.08.002","url":"http://www.sciencedirect.com/science/article/pii/S1146609X08001240","author":"Tibor Hartel and Szilard Nemes and Dan Cogalniceanu and Kinga Ollerer and Cosmin Ioan Moga and David Lesbarreres and Laszlo Demeter","keywords":["Rural landscapes","Rana dalmatina","Population sizes","Conservation","Romania "],"abstract":"Amphibians are good indicators of human impact, declining steadily worldwide. We explored the relationships between the ponds and nearby landscape parameters and population size of the Agile Frog (Rana dalmatina), estimated from the number of egg masses, in a cultural landscape within the central section of Tarnava Mare Basin, Romania. Forty-three permanent ponds were surveyed in a 2600 km2 area. The average number of egg masses per pond was 211.13 (SD = 426.41). The egg mass number was significantly and positively related to the emergent aquatic macrophyte cover (its effect peaks at around 50%) and the green connecting corridors between the ponds and forests, and negatively related to the extent of nearby urban areas. The proximity of the forest (positive effect) and the presence of high traffic roads (negative effect) were highly correlated with green corridors and further eliminated from the model due to multicollinearity. Both these variables had significant effects when incorporated in univariate models and multivariate models without green corridors. Since a large part of our study area was currently declared as Natura 2000 site, there is an increased need for management proposals and conservation applications for biodiversity, including amphibians. Rana dalmatina is an important species for monitoring because it is common in the studied area and is suited for short surveys. "}},{"citationKey":"Colwill2009186","entryType":"article","entryTags":{"title":"Human factors in information security: The insider threat - Who can you trust these days? ","journal":"Information Security Technical Report ","volume":"14","number":"4","pages":"186 - 196","year":"2009","note":"Human Factors in Information Security ","issn":"1363-4127","doi":"http://dx.doi.org/10.1016/j.istr.2010.04.004","url":"http://www.sciencedirect.com/science/article/pii/S1363412710000051","author":"Carl Colwill","keywords":["Insider threat","Human factors","Security risk management","Outsourcing "],"abstract":"This paper examines some of the key issues relating to insider threats to information security and the nature of loyalty and betrayal in the context of organisational, cultural factors and changing economic and social factors. It is recognised that insiders pose security risks due to their legitimate access to facilities and information, knowledge of the organisation and the location of valuable assets. Insiders will know how to achieve the greatest impact whilst leaving little evidence. However, organisations may not have employed effective risk management regimes to deal with the speed and scale of change, for example the rise of outsourcing. Outsourcing can lead to the fragmentation of protection barriers and controls and increase the number of people treated as full time employees. Regional and cultural differences will manifest themselves in differing security threat and risk profiles. At the same time, the recession is causing significant individual (and organisational) uncertainty and may prompt an increase in abnormal behaviour in long-term employees and managers - those traditionally most trusted - including members of the security community. In this environment, how can organisations know who to trust and how to maintain this trust? The paper describes a practitioner's view of the issue and the approaches used by \\{BT\\} to assess and address insider threats and risks. Proactive measures need to be taken to mitigate against insider attacks rather than reactive measures after the event. A key priority is to include a focus on insiders within security risk assessments and compliance regimes. The application of technology alone will not provide solutions. Security controls need to be workable in a variety of environments and designed, implemented and maintained with people's behaviour in mind. Solutions need to be agile and build and maintain trust and secure relationships over time. This requires a focus on human factors, education and awareness and greater attention on the security 'aftercare' of employees and third parties. "}},{"citationKey":"Pardini2009545","entryType":"article","entryTags":{"title":"Assessment of the consequences of the Fengyun-1C breakup in low Earth orbit ","journal":"Advances in Space Research ","volume":"44","number":"5","pages":"545 - 557","year":"2009","note":"","issn":"0273-1177","doi":"http://dx.doi.org/10.1016/j.asr.2009.04.014","url":"http://www.sciencedirect.com/science/article/pii/S0273117709002531","author":"C. Pardini and L. Anselmo","keywords":["Fengyun-1C breakup","Anti-satellite test","Orbital debris","Ballistic parameters estimation","Fragments cloud evolution","Collision risk evaluation "],"abstract":"On 11 January 2007, the People's Republic of China conducted a successful anti-satellite test against one of their defunct polar-orbiting weather satellites. The target satellite, called Fengyun-1C, had a mass of 880 kg and was orbiting at an altitude of about 863 km when the collision occurred. Struck by a direct-ascent interceptor at a speed of 9.36 km/s, the satellite disintegrated, spreading the cataloged fragments between 200 and 4000 km, with the highest concentration near the breakup height. By the end of April 2008, 2377 pieces of debris, including the original payload remnant, had officially been cataloged by the \\{US\\} Space Surveillance Network. Of these, nearly 1% had reentered the Earth's atmosphere. This deliberate act is the largest debris-generating event on record, and its consequences will adversely affect circumterrestrial space for many years. In an attempt to assess the impact of the Fengyun-1C breakup on the low Earth environment, the cloud of cataloged debris was propagated for nearly 8 years, taking into account the relevant orbit perturbations and a debris cloud ballistic coefficient distribution based on orbit decay calibrations. The immediate consequence of the Chinese anti-satellite test was to significantly increase the probability of collision with man-made debris. For the Italian spacecraft launched in the first half of 2007, the collision probability with cataloged objects increased by 10% for AGILE, in equatorial orbit, and by 60% for COSMO-SkyMed 1 and 2, in sun-synchronous orbit. During the next few years, the debris cloud generated by the Fengyun-1C breakup was found to remain relatively stable, with nearly 80% of the cataloged fragments still in orbit about 9 years after the event. "}},{"citationKey":"Ozgul2009194","entryType":"article","entryTags":{"title":"Bandwidth-adaptive \\{MIMO\\} \\{OFDM\\} for dynamic spectrum access networks ","journal":"Physical Communication ","volume":"2","number":"3","pages":"194 - 203","year":"2009","note":"","issn":"1874-4907","doi":"http://dx.doi.org/10.1016/j.phycom.2009.01.002","url":"http://www.sciencedirect.com/science/article/pii/S1874490709000032","author":"B. Ozgul and P.D. Sutton and L.E. Doyle","keywords":["DySPAN","OFDM","MIMO schemes","Cyclostationary signatures "],"abstract":"In a Dynamic Spectrum Access Network (DySPAN), nodes opportunistically make use of white spaces for transmission. The frequencies and bandwidth of available white spaces will of course vary in these networks. Hence a DySPAN transmitter will need to be capable of frequency agile and bandwidth-adaptive transmissions and a DySPAN receiver will need to accordingly respond to any changes made by a transmitter. This paper introduces a novel space-time (ST) scheme that facilitates the detection of bandwidth-adaptive transmissions without the need for a control channel. The scheme is based on orthogonal frequency-division multiplexing (OFDM) and ensures a high diversity gain. By using multiple transmit antennas, the proposed scheme also allows the application of \\{ST\\} block-coded \\{OFDM\\} (STBC-OFDM) which not only increases the robustness against bit errors but also preserves the spectral efficiency of the system. For frequency acquisition and bandwidth estimation, the receiving nodes in the DySPAN exploit the cyclostationary signatures intentionally embedded in the \\{OFDM\\} signals using a small set of subcarriers. In this way, communication links are established autonomously without any need for control channels. The \\{ST\\} scheme in this paper carries out appropriate multi-antenna transmissions of the signature information on the aforementioned subcarriers, which result in highly robust cyclostationary feature detection over the frequency selective multipath fading channels. Moreover, lower bit-error rates (BERs) are attained by applying STBC-OFDM to the data symbols on the rest of the subcarriers. Both feature detection and the \\{BER\\} performance are improved further by deploying multiple receive antennas. Detailed performance comparisons are presented by using simulation results. "}},{"citationKey":"Sycara200925","entryType":"article","entryTags":{"title":"An integrated approach to high-level information fusion ","journal":"Information Fusion ","volume":"10","number":"1","pages":"25 - 50","year":"2009","note":"Special Issue on High-level Information Fusion and Situation Awareness ","issn":"1566-2535","doi":"http://dx.doi.org/10.1016/j.inffus.2007.04.001","url":"http://www.sciencedirect.com/science/article/pii/S1566253507000437","author":"Katia Sycara and Robin Glinton and Bin Yu and Joseph Giampapa and Sean Owens and Michael Lewis and LTC Charles Grindle","keywords":["High-level fusion","Intent inference","Integrated framework "],"abstract":"In today's fast paced military operational environment, vast amounts of information must be sorted out and fused not only to allow commanders to make situation assessments, but also to support the generation of hypotheses about enemy force disposition and enemy intent. Current information fusion technology has the following two limitations. First, current approaches do not consider the battlefield context as a first class entity. In contrast, we consider situational context in terms of terrain analysis and inference. Second, there are no integrated and implemented models of the high-level fusion process. This paper describes the HiLIFE (High-Level Information Fusion Environment) computational framework for seamless integration of high levels of fusion (levels 2, 3 and 4). The crucial components of HiLIFE that we present in this paper are: (1) multi-sensor fusion algorithms and their performance results that operate in heterogeneous sensor networks to determine not only single targets but also force aggregates, (2) computational approaches for terrain-based analysis and inference that automatically combine low-level terrain features (such as forested areas, rivers, etc.) and additional information, such as weather, and transforms them into high-level militarily relevant abstractions, such as NO-GO, SLOW-GO areas, avenues of approach, and engagement areas, (3) a model for inferring adversary intent by mapping sensor readings of opponent forces to possible opponent goals and actions, and (4) sensor management for positioning intelligence collection assets for further data acquisition. The HiLIFE framework closes the loop on information fusion by specifying how the different components can computationally work together in a coherent system. Furthermore, the framework is inspired by a military process, the Intelligence Preparation of the Battlefield, that grounds the framework in practice. HiLIFE is integrated with a distributed military simulation system, OTBSAF, and the \\{RETSINA\\} multi-agent infrastructure to provide agile and sophisticated reasoning. In addition, the paper presents validation results of the automated terrain analysis that were obtained through experiments using military intelligence Subject Matter Experts (SMEs). "}},{"citationKey":"Tchouakeu2009495","entryType":"article","entryTags":{"title":"Creating Agile Business Systems with Reusable Knowledge, Amit Mitra, Amar Gupta. Cambridge University Press (2007). $110, Hardback, ISBN: 13 978-0-521-85163-3 ","journal":"Information Processing & Management ","volume":"45","number":"4","pages":"495 - 496","year":"2009","note":"","issn":"0306-4573","doi":"http://dx.doi.org/10.1016/j.ipm.2009.01.002","url":"http://www.sciencedirect.com/science/article/pii/S0306457309000041","author":"Louis-Marie Ngamassi Tchouakeu"}},{"citationKey":"Ribeiro2009950","entryType":"article","entryTags":{"title":"Supporting agile supply chains using a service-oriented shop floor ","journal":"Engineering Applications of Artificial Intelligence ","volume":"22","number":"6","pages":"950 - 960","year":"2009","note":"Artificial Intelligence Techniques for Supply Chain Management ","issn":"0952-1976","doi":"http://dx.doi.org/10.1016/j.engappai.2008.10.023","url":"http://www.sciencedirect.com/science/article/pii/S0952197608001632","author":"Luis Ribeiro and Jose Barata and Armando Colombo","keywords":["Service-oriented architectures","Ambient intelligence","Self-actions","Supply chain management","Reconfigurable supply chain "],"abstract":"The globalized nature of current business environments led to the emergence of new networked enterprise organizational paradigms (supply chains, extended enterprises, virtual enterprises, collaborative networks, etc.) to meet changing requirements and tackle profitable but volatile opportunities overall agility is required. Eventually the shop floor will have to react and accommodate (re)adjustments in the supply chain making it an important piece in the competitiveness puzzle. So far, the research focus has been in high level aspects of supply chain management and the integration of shop floor activities in the process has been left relatively unattended. However, shop floor data is increasingly required in business tools that support decision making. In this context, failing to support agility at shop floor level can compromise the agility of the supply chain. Recent developments in networked information technologies and embedded devices allow enabling intelligence in shop floor rendering it an active and live entity that further enhances the dynamics of the supply chain. The goal of the present work, supported by an implemented test case in the assembly domain, is to demonstrate how one is able to seamless integrate the shop floor with external tools and achieve a highly reconfigurable environment that adapts to changing production requirements and disturbances using service-oriented technology. "}}]