[{"citationKey":"Faegri20101118","entryType":"article","entryTags":{"title":"Introducing knowledge redundancy practice in software development: Experiences with job rotation in support work ","journal":"Information and Software Technology ","volume":"52","number":"10","pages":"1118 - 1132","year":"2010","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2010.06.002","url":"http://www.sciencedirect.com/science/article/pii/S0950584910001011","author":"Tor Erlend Faegri and Tore Dyba and Torgeir Dingsoyr","keywords":["Job rotation","Personnel rotation","Empirical software engineering","Agile organizations","Organizational learning","Software development "],"abstract":"Context Job rotation is a widely known approach to increase knowledge redundancy but empirical evidence regarding introduction and adoption in software development is scant. A lack of knowledge redundancy is a limiting factor for collaboration, flexibility, and coordination within teams and within the organization. Objective The scientific objective of this investigation was to explore benefits and challenges with improving knowledge redundancy among developers participating in job rotation. There were two practical objectives; (a) to establish customer support as a legitimate organizational function that would shield developers from support enquiries, and (b) to contribute to improved flexibility in project staffing by enabling overlapping product experience among developers. Method We used action research to integrate organizational change with scientific inquiry. During a period of eighteen weeks, nine developers rotated to customer support. We collected data throughout the period of collaboration; in meetings, from comprehensive interviews, and from customer support work logs. Results Perceptions of reduced efficiency and unnecessary redundancy outweighed benefits of shielding and learning about different products. Although there were strong indications of increased knowledge redundancy, the benefits were not sufficient to justify job rotation. Job rotation was abandoned after the trial period. Conclusions Job rotation can contribute to improved knowledge redundancy. Benefits of knowledge redundancy include innovation stemming from integration of different knowledge domains and improved appreciation of organizational concerns. However, knowledge redundancy incurs a collective cost that must be amortized and legitimized by the organization. An adoption process that accommodates open and trustful discussion among all involved stakeholders is therefore encouraged. "}},{"citationKey":"Hazzan20102363","entryType":"article","entryTags":{"title":"Disciplined and free-spirited: 'Time-out behaviour' at the Agile conference ","journal":"Journal of Systems and Software ","volume":"83","number":"11","pages":"2363 - 2365","year":"2010","note":"Interplay between Usability Evaluation and Software Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2010.06.018","url":"http://www.sciencedirect.com/science/article/pii/S0164121210001676","author":"Orit Hazzan and Uri Leron","keywords":["Software psychology","Methodologies","Management","Agile software development "],"abstract":"In this article we observe and try to understand a peculiar duality in the agile community, whereby on the one hand, we see a serious professional community working hard to improve the quality of software products and submitting to the strictest discipline of high professional standards, while on the other hand, in its conferences, we see the same community adopting a playful free-spirited stance. Invoking an anthropological perspective, we propose that both the serious professional aspects and the playful free-spirited atmosphere at the conference, as well as the connection between the two, can all be seen to emerge from the fundamental principles of the agile community as expressed by its Manifesto. "}},{"citationKey":"Moe2010480","entryType":"article","entryTags":{"title":"A teamwork model for understanding an agile team: A case study of a Scrum project ","journal":"Information and Software Technology ","volume":"52","number":"5","pages":"480 - 491","year":"2010","note":"TAIC-PART 2008TAIC-PART 2008 ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2009.11.004","url":"http://www.sciencedirect.com/science/article/pii/S0950584909002043","author":"Nils Brede Moe and Torgeir Dingsoyr and Tore Dyba","keywords":["Agile software development","Scrum","Software engineering","Teamwork","Empirical software engineering","Case study "],"abstract":"Context Software development depends significantly on team performance, as does any process that involves human interaction. Objective Most current development methods argue that teams should self-manage. Our objective is thus to provide a better understanding of the nature of self-managing agile teams, and the teamwork challenges that arise when introducing such teams. Method We conducted extensive fieldwork for 9 months in a software development company that introduced Scrum. We focused on the human sensemaking, on how mechanisms of teamwork were understood by the people involved. Results We describe a project through Dickinson and McIntyre's teamwork model, focusing on the interrelations between essential teamwork components. Problems with team orientation, team leadership and coordination in addition to highly specialized skills and corresponding division of work were important barriers for achieving team effectiveness. Conclusion Transitioning from individual work to self-managing teams requires a reorientation not only by developers but also by management. This transition takes time and resources, but should not be neglected. In addition to Dickinson and McIntyre's teamwork components, we found trust and shared mental models to be of fundamental importance. "}},{"citationKey":"Williams20101","entryType":"incollection","entryTags":{"title":"Agile Software Development Methodologies and Practices ","editor":"Marvin V. Zelkowitz","booktitle":"Advances in Computers","publisher":"Elsevier","year":"2010","volume":"80","pages":"1 - 44","series":"Advances in Computers ","issn":"0065-2458","doi":"http://dx.doi.org/10.1016/S0065-2458(10)80001-4","url":"http://www.sciencedirect.com/science/article/pii/S0065245810800014","author":"Laurie Williams","abstract":"Beginning in the mid-1990s, a number of consultants independently created and evolved what later came to be known as agile software development methodologies. Agile methodologies and practices emerged as an attempt to more formally and explicitly embrace higher rates of change in software requirements and customer expectations. Some prominent agile methodologies are Adaptive Software Development, Crystal, Dynamic Systems Development Method, Extreme Programming (XP), Feature-Driven Development (FDD), Pragmatic Programming, and Scrum. This chapter presents the principles that underlie and unite the agile methodologies. Then, 32 practices used in agile methodologies are presented. Finally, three agile methodologies (XP, FDD, and Scrum) are explained. Most often, software development teams select a subset of the agile practices and create their own hybrid software development methodology rather than strictly adhere to all the practices of a predefined agile methodology. Teams that use primarily agile practices are most often small- to medium-sized, colocated teams working on less complex projects. "}},{"citationKey":"Joshi20102045","entryType":"article","entryTags":{"title":"Measuring effectiveness of \\{HCI\\} integration in software development processes ","journal":"Journal of Systems and Software ","volume":"83","number":"11","pages":"2045 - 2058","year":"2010","note":"Interplay between Usability Evaluation and Software Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2010.03.078","url":"http://www.sciencedirect.com/science/article/pii/S0164121210001391","author":"Anirudha Joshi and N.L. Sarda and Sanjay Tripathi","keywords":["HCI-SE integration","Usability goals","Metrics "],"abstract":"Integrating human-computer interaction (HCI) activities in software engineering (SE) processes is an often-expressed desire. Two metrics to demonstrate the impact of integrating \\{HCI\\} activities in \\{SE\\} processes are proposed. Usability Goals Achievement Metric (UGAM) is a product metric that measures the extent to which the design of a product achieves its user-experience goals. Index of Integration (IoI) is a process metric that measures the extent of integration of the \\{HCI\\} activities in the \\{SE\\} process. Both the metrics have an organizational perspective and can be applied to a wide range of products and projects. An attempt has been made to keep the metrics easy to use in the industrial context. While the two metrics were proposed mainly to establish a correlation between the two and thereby demonstrate the effectiveness of integration of \\{HCI\\} in \\{SE\\} processes, several other applications seem likely. The two metrics were evaluated in three independent studies: a classroom-based evaluation with two groups of students, a qualitative feedback from three industry projects, and a quantitative evaluation using 61 industry projects. The metrics were found to be useful, easy to use, and helpful in making the process more systematic. Our studies showed that the two metrics correlate well with each other and that IoI is a good predictor of UGAM. Regression analysis showed that IoI has a somewhat greater effect on \\{UGAM\\} in projects that use the agile process model than the waterfall process and in the projects that are executed as a contracted software development service than in the projects in product companies. \\{UGAM\\} also correlated well with the traditional usability evaluations. "}},{"citationKey":"Bottani2010251","entryType":"article","entryTags":{"title":"Profile and enablers of agile companies: An empirical investigation ","journal":"International Journal of Production Economics ","volume":"125","number":"2","pages":"251 - 261","year":"2010","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2010.02.016","url":"http://www.sciencedirect.com/science/article/pii/S092552731000068X","author":"Eleonora Bottani","keywords":["Agility","Agile attributes","Agile enablers","Empirical investigation "],"abstract":"Agile attributes and agile enablers, i.e., the capabilities which allow promptly responding to changes in business environment and the available leverages to achieve the agile capabilities, respectively, have been widely debated in literature. Few studies, however, provide empirical evidence about the main characteristics of agile enterprises and tools practically exploited by companies to achieve agility. This paper attempts to improve the existing knowledge on agility, by presenting the results of an empirical research, whose aim is to investigate both the profile of agile companies and the enablers practically adopted by companies to achieve agility. The empirical investigation was performed on a sample of about 190 companies, about 65% of which were small and medium enterprises (SMEs). Results of the analysis provide a detailed investigation of the agile paradigm; moreover, outcomes suggest new taxonomies for agile attributes and enablers, and in particular provide evidence of attributes and enablers that appear as most relevant in embracing an agile strategy. "}},{"citationKey":"Miranda20101205","entryType":"article","entryTags":{"title":"Agile monitoring using the line of balance ","journal":"Journal of Systems and Software ","volume":"83","number":"7","pages":"1205 - 1215","year":"2010","note":"\\{SPLC\\} 2008 ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2010.01.043","url":"http://www.sciencedirect.com/science/article/pii/S0164121210000294","author":"Eduardo Miranda and Pierre Bourque","keywords":["Scrum","Feature Driven Development","Project management","Tracking and control","Line of balance","Release planning","Burn down charts","Cumulative flow diagrams","Agile methodologies","LOB "],"abstract":"There is a need to collect, measure, and present progress information in all projects, and Agile projects are no exception. In this article, the authors show how the line of balance, a relatively obscure indicator, can be used to gain insights into the progress of projects not provided by burn down charts or cumulative flow diagrams, two of the most common indicators used to track and report progress in Agile projects. The authors also propose to replace the original plan-based control point lead-time calculations with dynamic information extracted from a version control system and introduce the concept of the ideal plan to measure progress relative to both, end of iteration milestones and project completion date. "}},{"citationKey":"Pearson201022","entryType":"article","entryTags":{"title":"Process control in an agile supply chain network ","journal":"International Journal of Production Economics ","volume":"128","number":"1","pages":"22 - 30","year":"2010","note":"Integrating the Global Supply Chain ","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2010.01.027","url":"http://www.sciencedirect.com/science/article/pii/S0925527310000630","author":"Michael Pearson and Ron Masson and Anthony Swain","keywords":["Agile supply chain","Inventory","Process control","Push and pull strategies","Bullwhip effect "],"abstract":"We illustrate a new theoretical development applied to aid decision making in an increasingly important commercial sector. Agile supply, where small volumes of high margin, short life cycle innovative products are offered, is increasingly carried out through a complex global supply chain network. We apply an equilibrium solution in such a supply chain network, which works through limited cooperation and coordination along edges (links) in the network. The links constitute the stochastic modelling entities rather than the nodes of the network. We utilise newly developed phase plane analysis to identify, model and predict characteristic behaviour in supply chain networks. The phase plane charts profile the flow of inventory and identify out of control conditions. They maintain quality within the network, as well as intelligently track the way the network evolves in conditions of changing variability. The methodology is essentially distribution free, relying as it does on the study of forecasting errors, and can be used to examine contractual details as well as strategic and game theoretical concepts between decision-making components (agents) of a network. We illustrate with data drawn from supply chain agile fashion products. "}},{"citationKey":"Wu2010284","entryType":"article","entryTags":{"title":"Formulating partner selection criteria for agile supply chains: A Dempster-Shafer belief acceptability optimisation approach ","journal":"International Journal of Production Economics ","volume":"125","number":"2","pages":"284 - 293","year":"2010","note":"","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2010.02.010","url":"http://www.sciencedirect.com/science/article/pii/S0925527310000599","author":"Chong Wu and David Barnes","keywords":["Agile supply chain","Partner selection criteria","Dempster-Shafer theory","Belief acceptability","Optimisation "],"abstract":"Today's more dynamic business environment increases the need for greater agility in supply chains, which increases both the importance and frequency of partner selection decision-making. Previous research has suggested that the application of the Dempster-Shafer and optimisation theories offers a way of solving this problem under conditions of resource constraints. This paper advances this approach by offering a simplified yet thorough, rigorous yet still practical method for formulating criteria to use in partner selection decision-making in agile supply chains. An empirical illustrative example is used to demonstrate the approach, obtain insights into its application and identify issues for future research. "}},{"citationKey":"Ronnback20101229","entryType":"article","entryTags":{"title":"Anchor modeling -- Agile information modeling in evolving data environments ","journal":"Data & Knowledge Engineering ","volume":"69","number":"12","pages":"1229 - 1253","year":"2010","note":"Special issue on 28th International Conference on Conceptual Modeling (ER 2009) ","issn":"0169-023X","doi":"http://dx.doi.org/10.1016/j.datak.2010.10.002","url":"http://www.sciencedirect.com/science/article/pii/S0169023X10001229","author":"L. Ronnback and O. Regardt and M. Bergholtz and P. Johannesson and P. Wohed","keywords":["Anchor Modeling","Database modeling","Normalization","6NF","Data warehousing","Agile development","Temporal databases","Table elimination "],"abstract":"Maintaining and evolving data warehouses is a complex, error prone, and time consuming activity. The main reason for this state of affairs is that the environment of a data warehouse is in constant change, while the warehouse itself needs to provide a stable and consistent interface to information spanning extended periods of time. In this article, we propose an agile information modeling technique, called Anchor Modeling, that offers non-destructive extensibility mechanisms, thereby enabling robust and flexible management of changes. A key benefit of Anchor Modeling is that changes in a data warehouse environment only require extensions, not modifications, to the data warehouse. Such changes, therefore, do not require immediate modifications of existing applications, since all previous versions of the database schema are available as subsets of the current schema. Anchor Modeling decouples the evolution and application of a database, which when building a data warehouse enables shrinking of the initial project scope. While data models were previously made to capture every facet of a domain in a single phase of development, in Anchor Modeling fragments can be iteratively modeled and applied. We provide a formal and technology independent definition of anchor models and show how anchor models can be realized as relational databases together with examples of schema evolution. We also investigate performance through a number of lab experiments, which indicate that under certain conditions anchor databases perform substantially better than databases constructed using traditional modeling techniques. "}},{"citationKey":"Vinodh20101015","entryType":"article","entryTags":{"title":"Improvement of agility and sustainability: A case study in an Indian rotary switches manufacturing organisation ","journal":"Journal of Cleaner Production ","volume":"18","number":"10-11","pages":"1015 - 1020","year":"2010","note":"","issn":"0959-6526","doi":"http://dx.doi.org/10.1016/j.jclepro.2010.02.018","url":"http://www.sciencedirect.com/science/article/pii/S0959652610000673","author":"S. Vinodh","keywords":["Agile manufacturing","Sustainable engineering","Computer aided design","Environmental product design "],"abstract":"Increasing competition has been forcing the modern manufacturing organisations to adopt advanced manufacturing paradigms. Agile Manufacturing (AM) is an advanced manufacturing paradigm that enables an organisation to survive in the competitive business environment. Agility is the performance measure of \\{AM\\} practices. Simultaneously, modern business organisations are forced to evolve environmental friendly products. Sustainability is regarded as an important concept for survival by the modern organisations. In this context, agility and sustainability are regarded as performance measures for contemporary organisations. This paper reports a case study which has been carried out in an Indian rotary switches manufacturing organisation. The candidate product is the knob of rotary switch. Initially Computer Aided Design (CAD) has been used to digitalise the baseline model. Keeping the baseline model as reference, five new knob models have been evolved. Then the sustainability analysis has been carried out to determine the environmental impact of the knob models. The analysis results indicated that the proposed knob models possess minimal environmental impact. The conduct of case study has lead to an inference that there is a significant improvement of agility and sustainability in the design and development of knob of rotary switch. "}},{"citationKey":"Hyde201093","entryType":"article","entryTags":{"title":"W-band frequency-swept \\{EPR\\} ","journal":"Journal of Magnetic Resonance ","volume":"205","number":"1","pages":"93 - 101","year":"2010","note":"","issn":"1090-7807","doi":"http://dx.doi.org/10.1016/j.jmr.2010.04.005","url":"http://www.sciencedirect.com/science/article/pii/S1090780710001072","author":"James S. Hyde and Robert A. Strangeway and Theodore G. Camenisch and Joseph J. Ratke and Wojciech Froncisz","keywords":["W-band","Frequency agile \\{EPR\\} spectroscopy "],"abstract":"This paper describes a novel experiment on nitroxide radical spin labels using a multiarm \\{EPR\\} W-band bridge with a loop-gap resonator (LGR). We demonstrate \\{EPR\\} spectroscopy of spin labels by linear sweep of the microwave frequency across the spectrum. The high bandwidth of the LGR, about 1 \\{GHz\\} between 3 dB points of the microwave resonance, makes this new experiment possible. A frequency-tunable yttrium iron garnet (YIG) oscillator provides sweep rates as high as 1.8 x 105 GHz/s, which corresponds to 6.3 kT/s in magnetic field-sweep units over a 44 \\{MHz\\} range. Two experimental domains were identified. In the first, linear frequency sweep rates were relatively slow, and pure absorption and pure dispersion spectra were obtained. This appears to be a practical mode of operation at the present level of technological development. The main advantage is the elimination of sinusoidal magnetic field modulation. In the second mode, the frequency is swept rapidly across a portion of the spectrum, and then the frequency sweep is stopped for a readout period; \\{FID\\} signals from a swept line oscillate at a frequency that is the difference between the spectral position of the line in frequency units and the readout position. If there is more than one line, oscillations are superimposed. The sweep rates using the \\{YIG\\} oscillator were too slow, and the portion of the spectrum too narrow to achieve the full \\{EPR\\} equivalent of Fourier transform (FT) NMR. The paper discusses technical advances required to reach this goal. The hypothesis that trapezoidal frequency sweep is an enabling technology for \\{FT\\} \\{EPR\\} is supported by this study. "}},{"citationKey":"Yimer2010411","entryType":"article","entryTags":{"title":"A genetic approach to two-phase optimization of dynamic supply chain scheduling ","journal":"Computers & Industrial Engineering ","volume":"58","number":"3","pages":"411 - 422","year":"2010","note":"Supply, Production and Distribution Systems ","issn":"0360-8352","doi":"http://dx.doi.org/10.1016/j.cie.2009.01.010","url":"http://www.sciencedirect.com/science/article/pii/S0360835209000126","author":"Alebachew D. Yimer and Kudret Demirli","keywords":["Genetic algorithm","Build-to-order","Supply chain scheduling","Agile manufacturing","Mixed integer programming "],"abstract":"In today's competitive environment, agility and leanness have become two crucial strategic concerns for many manufacturing firms in their efforts to broaden market share. Recently, the build-to-order (BTO) manufacturing strategy is becoming a popular operation strategy to achieve both in a mass-scale customization process. \\{BTO\\} system combines the characteristics of make-to-order strategy with a forecast driven make-to-stock strategy. As a means to improve customer responsiveness, customized products are assembled according to specific orders while standard components are pre-manufactured based on short-term forecasts. Planning of the two subsystems using a two-phase sequential approach offers both operational and modeling incentives. In this paper, we formulate a two-phase mixed integer linear programming (MILP) model for material procurement, components fabrication, product assembly and distribution scheduling of a \\{BTO\\} supply chain system. In the proposed approach, the entire problem is first decomposed into two subsystems and evaluated sequentially. The first phase deals with assembling and distribution scheduling of customizable products, while the second phase addresses fabrication and procurement planning of components and raw-materials. The objective of both models is to minimize the aggregate costs associated with each subsystem, while meeting customer service requirements. The search space for the first phase problem involves a complex landscape with too many candidate solutions. A genetic algorithm based solution procedure is proposed to solve the sub-problem efficiently. "}},{"citationKey":"Candido2010156","entryType":"article","entryTags":{"title":"Semantic \\{SOA\\} approach to support agile reengineering at device level ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"43","number":"4","pages":"156 - 161","year":"2010","note":"10th \\{IFAC\\} Workshop on Intelligent Manufacturing Systems ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20100701-2-PT-4011.00028","url":"http://www.sciencedirect.com/science/article/pii/S1474667015301348","author":"Goncalo Candido and Francois Jammes and Jose Barata and Armando W. Colombo","keywords":["Service-oriented Architecture","Semantic Web","Web Services","Shop floor device Level","Agile Reengineering","Industry Automation "],"abstract":"Abstract Recognized as the major deployed paradigm for business and enterprise integration, Service-oriented Architecture (SOA) is expanding into several domains of application, including production systems device level, envisioning a unified solution suitable across all different layers of an enterprise infrastructure. Additionally, semantic web research paves the way to allow machines to understand and process information. The merge of these two approaches promises to deliver more intelligent and automated systems able to understand the context and behave accordingly. The scope of this work mainly focuses on how to assist systems integrators during the discovery, identification and deployment of new devices in a service-oriented production system. To answer this need, this document presents and describes a semantic \\{SOA\\} approach, comprising a set of distributed components that can be employed in a combined manner to provide a complete range of services to enhance agility at device level during (re)engineering processes. This approach covers several different aspects of service-oriented production systems lifecycle, including the plug and unplug of new devices and services in a heterogeneous environment. "}},{"citationKey":"Carvalho2010139","entryType":"article","entryTags":{"title":"A Methodology for Supply Chain Design An Application to Auto-part Industry ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"43","number":"17","pages":"139 - 143","year":"2010","note":"5th \\{IFAC\\} Conference on Management and Control of Production Logistics ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20100908-3-PT-3007.00028","url":"http://www.sciencedirect.com/science/article/pii/S1474667016308916","author":"Marcius F. Carvalho and Adriano Silveira and Jose Ramos","keywords":["Supply chain design","supply chain management","agile manufacture","strategic design decision","auto-part industry","car industry "],"abstract":"Abstract A supply chain is an alliance of independent business players, such as supplier, manufacturing, and distribution processes that perform the critical functions in order reach a business objective delivering value to customer and companies. Strategic design decisions as number of supply chain levels, numbers of nodes at each level, distance between nodes and definition of operations for each node contribute for better performance of the production and delivery of a variety of products to the customers. This paper presents an auto-part automotive supply chain redesign case study that has as objective to delivery modules to the assemble plant at lowest cost, high quality, and short lead time. It starts with a review of the legal procedures as the fees and taxes of the concerned States and after an analysis of logistics costs, values of labor, agility of the entire system and competitiveness, essential for the automobile company in the current scenario, are considered. At the end indexes of performance of the actual and proposed supply chain are compared to show the advantages of a new design. "}},{"citationKey":"Bulgarelli2010213","entryType":"article","entryTags":{"title":"The \\{AGILE\\} silicon tracker: Pre-launch and in-flight configuration ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"614","number":"2","pages":"213 - 226","year":"2010","note":"","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2009.12.051","url":"http://www.sciencedirect.com/science/article/pii/S0168900209023882","author":"A. Bulgarelli and A. Argan and G. Barbiellini and M. Basset and A. Chen and G. Di Cocco and L. Foggetta and F. Gianotti and A. Giuliani and F. Longo and S. Mereghetti and F. Monzani and L. Nicolini and R. Pavesi and A. Pellizzoni and C. Pontoni and M. Prest and G. Pucella and M. Tavani and M. Trifoglio and A. Trois and E. Vallazza and S. Vercellone","keywords":["Silicon detector","g - Ray detector","Floating strip","Noise characterization","AIV","Commissioning "],"abstract":"\\{AGILE\\} is an \\{ASI\\} (Italian Space Agency) Small Scientific Mission dedicated to high-energy astrophysics which was successfully launched on April 23, 2007. The \\{AGILE\\} instrument is composed of three main detectors: a Tungsten-Silicon Tracker designed to detect and image photons in the 30 MeV-50 GeV energy band, an X-ray imager called Super-AGILE operating in the 18-60 keV energy band, and a Mini-Calorimeter that detects gamma-rays and charged particles energy deposits between 300 keV and 100 MeV. The instrument is surrounded by an anti-coincidence (AC) system. In this paper, we present the noise characterization and the front-end configuration of the Silicon Tracker. Two crucial (and unique, among gamma-ray astrophysics missions) characteristic of the \\{AGILE\\} Silicon Tracker are the analog signal acquisition (aimed at obtaining an optimal angular resolution for gamma-ray imaging) and the very small dimension of the instrument (the total height including the active elements is [?] 21 cm and therefore the Silicon Tracker is the lightest and most compact g - ray imager sent in orbit). The results presented in this paper were obtained during the \\{AIV\\} (Assembly, Integration and Verification) pre-launch testing phase and during the post-launch commissioning phase. The \\{AGILE\\} Silicon Tracker has been optimally configured with a very good response of the frontend system and of the data acquisition units. "}},{"citationKey":"tagkey2010299","entryType":"incollection","entryTags":{"title":"Subject Index ","editor":"Marvin V. Zelkowitz","booktitle":"Advances in Computers","publisher":"Elsevier","year":"2010","volume":"80","pages":"299 - 306","series":"Advances in Computers ","issn":"0065-2458","doi":"http://dx.doi.org/10.1016/S0065-2458(10)80016-6","url":"http://www.sciencedirect.com/science/article/pii/S0065245810800166","key":"tagkey2010299","abstract":"Publisher Summary This section lists the important subjects that are discussed in Volume 80 of the book Advances in Computers, such as acceptance test-driven development, activity diagrams, agile and lean principles, comparison, and others. The terms are mentioned along with the page numbers where they are discussed in the book, for the ease of the reader. "}},{"citationKey":"Blom20101511","entryType":"article","entryTags":{"title":"Is Scrum and \\{XP\\} suitable for \\{CSE\\} Development? ","journal":"Procedia Computer Science ","volume":"1","number":"1","pages":"1511 - 1517","year":"2010","note":"\\{ICCS\\} 2010 ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2010.04.168","url":"http://www.sciencedirect.com/science/article/pii/S1877050910001699","author":"Martin Blom","keywords":["Scrum","XP","Computational science and engineering "],"abstract":"This article discusses the question if Scrum and \\{XP\\} is well suited for development of Computational Science and Engineering (CSE) software. The reason for choosing Scrum and \\{XP\\} is based on two facts. Firstly, \\{CSE\\} developers are not used to formal processes for software development and Scrum and \\{XP\\} are informal in nature, hence easier to adopt. Secondly \\{CSE\\} projects are often once-off and aimed at producing scientific results rather than commercial software, so the overhead of a process or methodology needs to be kept at a minimum. Scrum and \\{XP\\} are focused on producing software, thus keeping everything else, i.e. the overhead to a minimum, a fact that benefits \\{CSE\\} development. In this article, the characteristics of Scrum and \\{XP\\} in particular and agile development in general are evaluated against the needs of \\{CSE\\} developers. The results show that almost all the key points in both methodologies are well suited for \\{CSE\\} development and that agile development in general is a good match with CSE. "}},{"citationKey":"Lukins2010972","entryType":"article","entryTags":{"title":"Bug localization using latent Dirichlet allocation ","journal":"Information and Software Technology ","volume":"52","number":"9","pages":"972 - 990","year":"2010","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2010.04.002","url":"http://www.sciencedirect.com/science/article/pii/S0950584910000650","author":"Stacy K. Lukins and Nicholas A. Kraft and Letha H. Etzkorn","keywords":["Bug localization","Program comprehension","Latent Dirichlet allocation","Information retrieval "],"abstract":"Context Some recent static techniques for automatic bug localization have been built around modern information retrieval (IR) models such as latent semantic indexing (LSI). Latent Dirichlet allocation (LDA) is a generative statistical model that has significant advantages, in modularity and extensibility, over both \\{LSI\\} and probabilistic \\{LSI\\} (pLSI). Moreover, \\{LDA\\} has been shown effective in topic model based information retrieval. In this paper, we present a static LDA-based technique for automatic bug localization and evaluate its effectiveness. Objective We evaluate the accuracy and scalability of the LDA-based technique and investigate whether it is suitable for use with open-source software systems of varying size, including those developed using agile methods. Method We present five case studies designed to determine the accuracy and scalability of the LDA-based technique, as well as its relationships to software system size and to source code stability. The studies examine over 300 bugs across more than 25 iterations of three software systems. Results The results of the studies show that the LDA-based technique maintains sufficient accuracy across all bugs in a single iteration of a software system and is scalable to a large number of bugs across multiple revisions of two software systems. The results of the studies also indicate that the accuracy of the LDA-based technique is not affected by the size of the subject software system or by the stability of its source code base. Conclusion We conclude that an effective static technique for automatic bug localization can be built around LDA. We also conclude that there is no significant relationship between the accuracy of the LDA-based technique and the size of the subject software system or the stability of its source code base. Thus, the LDA-based technique is widely applicable. "}},{"citationKey":"Bullett20101156","entryType":"article","entryTags":{"title":"Application of Autoscala to ionograms recorded by the \\{VIPIR\\} ionosonde ","journal":"Advances in Space Research ","volume":"45","number":"9","pages":"1156 - 1172","year":"2010","note":"Special Issue: Recent Advances in Space Weather Monitoring, Modelling, and Forecasting ","issn":"0273-1177","doi":"http://dx.doi.org/10.1016/j.asr.2010.01.024","url":"http://www.sciencedirect.com/science/article/pii/S027311771000061X","author":"T. Bullett and A. Malagnini and M. Pezzopane and C. Scotto","keywords":["Autoscala","Ionosphere","Ionogram","Electron density","Monitoring and modelling "],"abstract":"In November 2008, the ionosonde station at Boulder, Colorado, \\{USA\\} (40.0degN; 105.3degW) became the host of a new ionosonde (VIPIR, Vertical Incidence Pulsed Ionospheric Radar) developed and built by Scion Associates. The \\{VIPIR\\} is a fully digital frequency agile radar that operates between 0.3 and 26 MHz. It features 8 digital receivers and a digital transmit exciter. Extremely high performance analog receive electronics and a 4 kW solid state amplifier provide interface to the real world. This work describes the application of Autoscala to the ionograms recorded by this ionosonde. First results, in terms of ionograms and autoscaled characteristics, are presented and discussed. "}},{"citationKey":"Fernandez201018","entryType":"article","entryTags":{"title":"\\{SBPMN\\} -- An easier business process modeling notation for business users ","journal":"Computer Standards & Interfaces ","volume":"32","number":"1-2","pages":"18 - 28","year":"2010","note":"","issn":"0920-5489","doi":"http://dx.doi.org/10.1016/j.csi.2009.04.006","url":"http://www.sciencedirect.com/science/article/pii/S0920548909000300","author":"H. Fernandez Fernandez and Elias Palacios-Gonzalez and Vicente Garcia-Diaz and B. Cristina Pelayo G-Bustelo and Oscar Sanjuan Martinez and Juan Manuel Cueva Lovelle","keywords":["BPM","BPMN","UML","Usability","Evaluation "],"abstract":"At the moment the notations for the modeling of business process is based in technical aspects. Therefore most notations are not understood by the business users due to the complexity of them. In this paper we present a notation that allows business users to model their business process. For this reason the notation must be agile, easy to learn and design, and capable to provide semantic information about the process. With the objective of demonstrating the characteristics of the proposal notation in this paper we make a research to compare and evaluate the usability of the notation with the standard notation more extended, BPMN. "}},{"citationKey":"Naylor2010280","entryType":"article","entryTags":{"title":"An \\{FPGA\\} based control unit for synchronization of laser Thomson scattering measurements to plasma events on \\{MAST\\} ","journal":"Fusion Engineering and Design ","volume":"85","number":"3-4","pages":"280 - 285","year":"2010","note":"Proceedings of the 7th \\{IAEA\\} Technical Meeting on Control, Data Acquisition, and Remote Participation for Fusion Research ","issn":"0920-3796","doi":"http://dx.doi.org/10.1016/j.fusengdes.2010.04.042","url":"http://www.sciencedirect.com/science/article/pii/S0920379610001833","author":"G.A. Naylor","keywords":["FPGA","Data acquisition","Real-time","Thomson scattering "],"abstract":"The power and flexibility of modern Field Programmable Gate Arrays (FPGAs) is now being recognised in many areas of instrumentation and control [1-3]. The high performance of modern \\{ADCs\\} and the high throughput of \\{FPGAs\\} allow the emulation of many specialised analogue instruments. The functions of heterodyne detection, phase measurements, spectrum analyzers, phase sensitive detectors, counters, etc. can be achieved in relatively simple hardware using an FPGA. The complex filtering functions can be efficiently performed digitally in the FPGA, without recourse to a separate \\{DSP\\} chip. This paper describes the use of a custom off the shelf \\{FPGA\\} board with a collection of custom interface boards to produce a powerful custom trigger system. This has been developed for agile triggering of \\{YAG\\} lasers on MAST. This unit allows various analogue inputs including magnetics data to be processed in real-time and allow Thomson scattering data to be collected at accurate times with respect to randomly occurring \\{MHD\\} phenomena such as neoclassical tearing modes (NTMs). The \\{FPGA\\} allows a 'System On a Chip' architecture in order to perform fast filtering in logic coupled to a dedicated soft processor for real-time fixed latency operations and a second soft processor to handle external communications with the control system for system configuration and reporting of status/archived data. The use of such a generic structure in order to provide a common approach, with reduced software development times, for diverse diagnostic situations will be discussed. "}},{"citationKey":"Doz2010370","entryType":"article","entryTags":{"title":"Embedding Strategic Agility: A Leadership Agenda for Accelerating Business Model Renewal ","journal":"Long Range Planning ","volume":"43","number":"2-3","pages":"370 - 382","year":"2010","note":"Business Models ","issn":"0024-6301","doi":"http://dx.doi.org/10.1016/j.lrp.2009.07.006","url":"http://www.sciencedirect.com/science/article/pii/S0024630109000570","author":"Yves L. Doz and Mikko Kosonen","abstract":"Strategic discontinuities and disruptions usually call for changes in business models. But, over time, efficient firms naturally evolve business models of increasing stability - and therefore rigidity. Resolving this contradiction can be made easier by developing three core meta-capabilities to make an organization more agile: strategic sensitivity, leadership unity and resource fluidity. This article reviews the underlying determinants of these capabilities, based on detailed research undertaken in a dozen companies who were re-conceiving their business models - among others, Nokia, easyGroup, HP, \\{SAP\\} and Kone are used as examples. We propose a repertoire of concrete leadership actions enabling the meta-capabilities needed to accelerate the renewal and transformation of business models. To organize our argument we borrow the three main dimensions of the strategic agility framework presented in our earlier work, and develop corresponding vectors of leadership actions, each of which can enhance a firm's ability to renew its business models. "}},{"citationKey":"Stark2010175","entryType":"article","entryTags":{"title":"Competing in engineering design--The role of Virtual Product Creation ","journal":"\\{CIRP\\} Journal of Manufacturing Science and Technology ","volume":"3","number":"3","pages":"175 - 184","year":"2010","note":"","issn":"1755-5817","doi":"http://dx.doi.org/10.1016/j.cirpj.2010.08.003","url":"http://www.sciencedirect.com/science/article/pii/S1755581710000854","author":"R. Stark and F.-L. Krause and C. Kind and U. Rothenburg and P. Muller and H. Hayka and H. Stockert","keywords":["Virtual Product Creation","Engineering design","Digital technologies","Information and competence management","Sustainability","Systems integration","Process execution "],"abstract":"Product creation is facing the next level of fundamental changes. Global demands are growing substantially to achieve energy efficient and sustainable value creation networks for production, products and services without compromising traditional success factors such as time to market, cost and quality. To stay competitive within such an environment development partners in industry and public sectors will require new interplay solutions for engineering design execution, domain knowledge representation, expert competence utilization and digital assistance systems. This scenario offers the chance for virtual production creation solutions to become critical for the future by offering unique engineering capabilities, which have not yet been explored or deployed. The paper investigates key elements of modern Virtual Product Creation - such as agile process execution, functional product modeling and context appropriate information management - towards their competitive role in satisfying increasing numbers of product requirements, in delivering robust systems integration and in ensuring true sustainable product lifecycle solutions. "}},{"citationKey":"Ni2010595","entryType":"article","entryTags":{"title":"The bony labyrinth of the early platyrrhine primate Chilecebus ","journal":"Journal of Human Evolution ","volume":"59","number":"6","pages":"595 - 607","year":"2010","note":"","issn":"0047-2484","doi":"http://dx.doi.org/10.1016/j.jhevol.2010.06.008","url":"http://www.sciencedirect.com/science/article/pii/S0047248410001223","author":"Xijun Ni and John J. Flynn and Andre R. Wyss","keywords":["Chilecebus carrascoensis","Cochlea","Semicircular canal "],"abstract":"We document the morphology of the bony labyrinth of Chilecebus carrascoensis, one of the best preserved early platyrrhines known, based on high resolution \\{CT\\} scanning and 3D digital reconstruction. The cochlea is low and conical in form, as in other anthropoids, but has only 2.5 spiral turns. When the allometric relationship with body mass is considered, cochlear size is similar to that in extant primates. The relative size of the semicircular canals, which is well within the range of other primates, indicates that Chilecebus carrascoensis was probably not as agile in its locomotion as other small-bodied platyrrhines such as Leontopithecus rosalia, Saguinus oedipus, and Callithrix jacchus, but it probably was not a suspensory acrobat or a slow climber. The proportion, shape, and orientation of the semicircular canals in Chilecebus carrascoensis also mirror that typically seen in extant primates. However, no single variable can be used for predicting the locomotor pattern in Chilecebus carrascoensis. Based on Principle Component Analysis (PCA) scores we calculated rescaled Euclidean distances for various taxa; primates with similar locomotor patterns tend to share shorter distances. Results for Chilecebus carrascoensis underscore its general resemblance to living quadrupedal primate taxa, but it is not positioned especially near any single living taxon. "}},{"citationKey":"Blau2010460","entryType":"article","entryTags":{"title":"A multidimensional procurement auction for trading composite services ","journal":"Electronic Commerce Research and Applications ","volume":"9","number":"5","pages":"460 - 472","year":"2010","note":"Special Section on Strategy, Economics and Electronic Commerce ","issn":"1567-4223","doi":"http://dx.doi.org/10.1016/j.elerap.2009.11.001","url":"http://www.sciencedirect.com/science/article/pii/S156742230900074X","author":"Benjamin Blau and Tobias Conte and Clemens van Dinther","keywords":["Auction markets","Bundling strategy","Economic analysis","Electronic markets","Mechanism design","Path auctions","Procurement "],"abstract":"Recently, static value chains have gradually been giving way to highly agile service value networks. This involves novel economic and organizational challenges. Added value for customers is created by feasible compositions of distributed service components. This work focuses on the design of a multidimensional procurement auction for trading service compositions and the analysis of strategies for service providers that participate in the procurement process. The mechanism implementation is incentive-compatible, so that it results in an equilibrium in which revealing the true multidimensional type (quality of service and valuation) is a weakly-dominant strategy for all service providers. Due to combinatorial restrictions imposed by the underlying graph topology, the winner determination problem can be solved in polynomial time, in contrast to computationally-intractable combinatorial auctions which cannot be solved this way. Furthermore, we provide a simulation-based analysis based on a reinforcement learning model of bundling and unbundling strategies of service providers that participate in the auction. Based on our results we discuss strategic recommendations for service providers depending on how they are situated within the network. "}},{"citationKey":"Zhang20103140","entryType":"article","entryTags":{"title":"Searching for overlapping coalitions in multiple virtual organizations ","journal":"Information Sciences ","volume":"180","number":"17","pages":"3140 - 3156","year":"2010","note":"Including Special Section on Virtual Agent and Organization Modeling: Theory and Applications ","issn":"0020-0255","doi":"http://dx.doi.org/10.1016/j.ins.2010.04.028","url":"http://www.sciencedirect.com/science/article/pii/S0020025510001933","author":"Guofu Zhang and Jianguo Jiang and Zhaopin Su and Meibin Qi and Hua Fang","keywords":["Multi-agent systems","Multiple virtual organizations","Overlapping coalition formation","Discrete particle swarm optimization","Two-dimensional binary encoding","Resource conflict","Encoding repair "],"abstract":"Coalition formation is an active and essential component for multi-agent systems (MAS) in task-oriented domains in which tasks can be too complicated to be accomplished by a single agent with insufficient resources. By forming a coalition, agents are able to cooperate and combine resources to complete tasks that are impossible to accomplish alone within a given time bound. For example, in virtual enterprises, small and agile enterprises can provide more services and make more profits than an individual can. In many multi-task environments, especially in parallel multi-task environments, an individual abundant in resources is inclined to undertake more than one task to make more profits and participate in multiple virtual organizations (MVOs) at the same time, where every member has to decide how to allocate different parts of its resources to serve multiple different project tasks. Such overlapping property is a very intractable problem in practical decision making, and to the best of our knowledge, current coalition formation algorithms typically exclude the possibility of having overlapping coalitions, that is an agent can only be a member of one coalition at any given time, leading to waste of resources, preventing the system from efficiently allocating all agents' resources, and limiting the scope of their applications in real-world scenarios. Indeed, overlapping coalition formation (OCF) is an important research question, because \\{MVOs\\} are very crucial and beneficial in parallel multi-task domains where only a few selected individuals have rare, but highly demanded, resources. With this in mind, we develop a discrete particle swarm optimization based algorithm to solve the \\{OCF\\} problem in MVOs, applicable for more complex virtual enterprises environments. We introduce a two-dimensional binary encoding scheme and propose a novel repairing strategy for resolving conflicts over the usage of joint resources among overlapping coalitions. With this novel strategy for cooperative conflict resolution, any invalid encoding can be adjusted into a valid one without any resource conflict. Finally, simulations are conducted to show the efficiency of the proposed algorithm. "}},{"citationKey":"EscuderoCarretero201016","entryType":"article","entryTags":{"title":"Fibromyalgia: Patient perception on their disease and health system. Qualitative research study ","journal":"Reumatologia Clinica (English Edition) ","volume":"6","number":"1","pages":"16 - 22","year":"2010","note":"","issn":"2173-5743","doi":"http://dx.doi.org/10.1016/S2173-5743(10)70005-8","url":"http://www.sciencedirect.com/science/article/pii/S2173574310700058","author":"Maria Jose Escudero-Carretero and Noelia Garcia-Toyos and Maria Angeles Prieto-Rodriguez and Olivia Perez-Corral and Joan Carles March-Cerda and Manuela Lopez-Doblas","keywords":["Fibromyalgia","Patient expectation","Patient satisfaction","Qualitative analysis","Quality of health care","Professional-patient relationship","Fibromialgia","Expectativas de pacientes","Satisfaccion de pacientes","Analisis cualitativo","Calidad de la atencion de salud","Relaciones profesional-paciente "],"abstract":"Objective To know the experiences and expectations of persons with fibromyalgia towards the health system and its professionals. Methods Qualitative study with three focal groups. The first focal group included patients with fibromyalgia, 20 women and 1 man, receiving care in the public health system, with different assistance paths and progression. Informed Consent was required. Content analysis was done. Results Patients describe a difficult experience, with symptoms that may involve incapacity for daily activities. Until knowing their diagnosis, they feel a lack of understanding and also loneliness. They develop different coping strategies, as looking for information or association. From the health system they expect: attention and a fast diagnosis, accessibility to consultations, medical exams and therapies or an impulse for research. They want trained professionals, proactive attitudes, interest, empathy and information. Discussion Qualitative methods seem suitable for delving into patient experience. Health assistance must improve patients' quality of life, facilitating their assistance process and offering companionship, interest, comprehension and support. "}},{"citationKey":"Young2010154","entryType":"article","entryTags":{"title":"Lightgrid--an agile distributed computing architecture for Geant4 ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"614","number":"1","pages":"154 - 158","year":"2010","note":"","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2009.12.019","url":"http://www.sciencedirect.com/science/article/pii/S0168900209023365","author":"Jason Young and John O. Perry and Tatjana Jevremovic","keywords":["Geant4","Monte Carlo","Grid computing","MySQL","PHP "],"abstract":"A light weight grid based computing architecture has been developed to accelerate Geant4 computations on a variety of network architectures. This new software is called LightGrid. LightGrid has a variety of features designed to overcome current limitations on other grid based computing platforms, more specifically, smaller network architectures. By focusing on smaller, local grids, LightGrid is able to simplify the grid computing process with minimal changes to existing Geant4 code. LightGrid allows for integration between Geant4 and MySQL, which both increases flexibility in the grid as well as provides a faster, reliable, and more portable method for accessing results than traditional data storage systems. This unique method of data acquisition allows for more fault tolerant runs as well as instant results from simulations as they occur. The performance increases brought along by using LightGrid allow simulation times to be decreased linearly. LightGrid also allows for pseudo-parallelization with minimal Geant4 code changes. "}},{"citationKey":"Mettler2010773","entryType":"article","entryTags":{"title":"Agile autonomous guidance using spatial value functions ","journal":"Control Engineering Practice ","volume":"18","number":"7","pages":"773 - 788","year":"2010","note":"Special Issue on Aerial Robotics ","issn":"0967-0661","doi":"http://dx.doi.org/10.1016/j.conengprac.2010.02.013","url":"http://www.sciencedirect.com/science/article/pii/S0967066110000730","author":"B. Mettler and N. Dadkhah and Z. Kong","keywords":["UAV","Autonomy","Guidance","Optimization","Trajectory","Cost-to-go "],"abstract":"This paper describes an autonomous guidance system based on receding horizon (RH) optimization. The system is integrated around a spatial, state-dependent cost-to-go (SVF) function that is computed as an approximation to the value function associated with the optimal trajectory planning problem. The function captures the critical interaction between the vehicle dynamics and environment, thereby resulting in tighter coupling between planning and control. The consistency achieved between the \\{RH\\} optimization and the \\{SVF\\} enables a more rigorous implementation of the \\{RH\\} framework to autonomous vehicle guidance. The paper describes the overall approach along flight experimental results obtained in an Interactive Guidance and Control Laboratory. "}}]