[{"citationKey":"Dingsoyr20121213","entryType":"article","entryTags":{"title":"A decade of agile methodologies: Towards explaining agile software development ","journal":"Journal of Systems and Software ","volume":"85","number":"6","pages":"1213 - 1221","year":"2012","note":"Special Issue: Agile Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.02.033","url":"http://www.sciencedirect.com/science/article/pii/S0164121212000532","author":"Torgeir Dingsoyr and Sridhar Nerur and VenuGopal Balijepally and Nils Brede Moe","keywords":["Agile software development","Theory","Software engineering","Information systems","eXtreme programming, XP","Scrum","Lean software development","Crystal method","Feature-driven development "],"abstract":"Ever since the agile manifesto was created in 2001, the research community has devoted a great deal of attention to agile software development. This article examines publications and citations to illustrate how the research on agile has progressed in the 10 years following the articulation of the manifesto. Specifically, we delineate the conceptual structure underlying agile scholarship by performing an analysis of authors who have made notable contributions to the field. Further, we summarize prior research and introduce contributions in this special issue on agile software development. We conclude by discussing directions for future research and urging agile researchers to embrace a theory-based approach in their scholarship. "}},{"citationKey":"Strode20121222","entryType":"article","entryTags":{"title":"Coordination in co-located agile software development projects ","journal":"Journal of Systems and Software ","volume":"85","number":"6","pages":"1222 - 1238","year":"2012","note":"Special Issue: Agile Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.02.017","url":"http://www.sciencedirect.com/science/article/pii/S0164121212000465","author":"Diane E. Strode and Sid L. Huff and Beverley Hope and Sebastian Link","keywords":["Agile methods","Agile software development project","Coordination effectiveness","Coordination strategy","Coordination Theory","Extreme Programming","Scrum "],"abstract":"Agile software development provides a way to organise the complex task of multi-participant software development while accommodating constant project change. Agile software development is well accepted in the practitioner community but there is little understanding of how such projects achieve effective coordination, which is known to be critical in successful software projects. A theoretical model of coordination in the agile software development context is presented based on empirical data from three cases of co-located agile software development. Many practices in these projects act as coordination mechanisms, which together form a coordination strategy. Coordination strategy in this context has three components: synchronisation, structure, and boundary spanning. Coordination effectiveness has two components: implicit and explicit. The theoretical model of coordination in agile software development projects proposes that an agile coordination strategy increases coordination effectiveness. This model has application for practitioners who want to select appropriate practices from agile methods to ensure they achieve coordination coverage in their project. For the field of information systems development, this theory contributes to knowledge of coordination and coordination effectiveness in the context of agile software development. "}},{"citationKey":"Moe2012853","entryType":"article","entryTags":{"title":"Challenges of shared decision-making: A multiple case study of agile software development ","journal":"Information and Software Technology ","volume":"54","number":"8","pages":"853 - 865","year":"2012","note":"Special Issue: Voice of the Editorial BoardSpecial Issue: Voice of the Editorial Board ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2011.11.006","url":"http://www.sciencedirect.com/science/article/pii/S0950584911002308","author":"Nils Brede Moe and Aybuke Aurum and Tore Dyba","keywords":["Agile software development","Scrum","Decision-making","Self-management","Alignment","Teamwork "],"abstract":"Context Agile software development changes the nature of collaboration, coordination, and communication in software projects. Objective Our objective was to understand the challenges of shared decision-making in agile software development teams. Method We designed a multiple case study consisting of four projects in two software product companies that recently adopted Scrum. We collected data in semi-structured interviews, through participant observations, and from process artifacts. Results We identified three main challenges to shared decision-making in agile software development: alignment of strategic product plans with iteration plans, allocation of development resources, and performing development and maintenance tasks in teams. Conclusion Agile software development requires alignment of decisions on the strategic, tactical, and operational levels in order to overcome these challenges. Agile development also requires a transition from specialized skills to redundancy of functions and from rational to naturalistic decision-making. This takes time; the case companies needed from one to two years to change from traditional, hierarchical decision-making to shared decision-making in software development projects. "}},{"citationKey":"Vijayasarathy2012137","entryType":"article","entryTags":{"title":"Drivers of agile software development use: Dialectic interplay between benefits and hindrances ","journal":"Information and Software Technology ","volume":"54","number":"2","pages":"137 - 148","year":"2012","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2011.08.003","url":"http://www.sciencedirect.com/science/article/pii/S0950584911001807","author":"Leo Vijayasarathy and Dan Turk","keywords":["Agile software development","Innovation adoption","Subjective norm","Training","Dialectic theory","Perceived hindrance "],"abstract":"Context Agile software development with its emphasis on producing working code through frequent releases, extensive client interactions and iterative development has emerged as an alternative to traditional plan-based software development methods. While a number of case studies have provided insights into the use and consequences of agile, few empirical studies have examined the factors that drive the adoption and use of agile. Objective We draw on intention-based theories and a dialectic perspective to identify factors driving the use of agile practices among adopters of this software development methodology. Method Data for the study was gathered through an anonymous online survey of software development professionals. We requested participation from members of a selected list of online discussion groups, and received 98 responses. Results Our analyses reveal that subjective norm and training play a significant role in influencing software developers' use of agile processes and methods, while perceived benefits and perceived limitations are not primary drivers of agile use among adopters. Interestingly, perceived benefit emerges as a significant predictor of agile use only if adopters face hindrances to their agile practices. Conclusion We conclude that research in the adoption of software development innovations should examine the effects of both enabling and detracting factors and the interactions between them. Since training, subjective norm, and the interplay between perceived benefits and perceived hindrances appear to be key factors influencing the adoption of agile methods, researchers can focus on how to (a) perform training on agile methods more effectively, (b) facilitate the dialog between developers and managers about perceived benefits and hindrances, and (c) capitalize on subjective norm to publicize the benefits of agile methods within an organization. Further, when managing the transition to new software development methods, we recommend that practitioners adapt their strategies and tactics contingent on the extent of perceived hindrances to the change. "}},{"citationKey":"Bjarnason20121107","entryType":"article","entryTags":{"title":"Are you biting off more than you can chew? A case study on causes and effects of overscoping in large-scale software engineering ","journal":"Information and Software Technology ","volume":"54","number":"10","pages":"1107 - 1124","year":"2012","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2012.04.006","url":"http://www.sciencedirect.com/science/article/pii/S0950584912000778","author":"Elizabeth Bjarnason and Krzysztof Wnuk and Bjorn Regnell","keywords":["Requirements scoping","Empirical study","Software release planning","Case study","Agile requirements engineering "],"abstract":"Context Scope management is a core part of software release management and often a key factor in releasing successful software products to the market. In a market-driven case, when only a few requirements are known a priori, the risk of overscoping may increase. Objective This paper reports on findings from a case study aimed at understanding overscoping in large-scale, market-driven software development projects, and how agile requirements engineering practices may affect this situation. Method Based on a hypothesis of which factors that may be involved in an overscoping situation, semi-structured interviews were performed with nine practitioners at a large, market-driven software company. The results from the interviews were validated by six (other) practitioners at the case company via a questionnaire. Results The results provide a detailed picture of overscoping as a phenomenon including a number of causes, root causes and effects, and indicate that overscoping is mainly caused by operating in a fast-moving market-driven domain and how this ever-changing inflow of requirements is managed. Weak awareness of overall goals, in combination with low development involvement in early phases, may contribute to 'biting off' more than a project can 'chew'. Furthermore, overscoping may lead to a number of potentially serious and expensive consequences, including quality issues, delays and failure to meet customer expectations. Finally, the study indicates that overscoping occurs also when applying agile requirements engineering practices, though the overload is more manageable and perceived to result in less wasted effort when applying a continuous scope prioritization, in combination with gradual requirements detailing and a close cooperation within cross-functional teams. Conclusion The results provide an increased understanding of scoping as a complex and continuous activity, including an analysis of the causes, effects, and a discussion on possible impact of agile requirements engineering practices to the issue of overscoping. The results presented in this paper can be used to identify potential factors to address in order to achieve a more realistic project scope. "}},{"citationKey":"Drury20121239","entryType":"article","entryTags":{"title":"Obstacles to decision making in Agile software development teams ","journal":"Journal of Systems and Software ","volume":"85","number":"6","pages":"1239 - 1254","year":"2012","note":"Special Issue: Agile Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.01.058","url":"http://www.sciencedirect.com/science/article/pii/S0164121212000374","author":"Meghann Drury and Kieran Conboy and Ken Power","keywords":["Agile decision making","Agile project management","Agile software development","Case study","Decision making","Decision obstacles","Focus group","Iteration decisions","Iteration Planning","Iteration Review","Retrospective","Scrum","Software engineering","Team decisions "],"abstract":"The obstacles facing decision making in Agile development are critical yet poorly understood. This research examines decisions made across four stages of the iteration cycle: Iteration Planning, Iteration Execution, Iteration Review and Iteration Retrospective. A mixed method approach was employed, whereby a focus group was initially conducted with 43 Agile developers and managers to determine decisions made at different points of the iteration cycle. Subsequently, six illustrative mini cases were purposefully conducted as examples of the six obstacles identified in these focus groups. This included interviews with 18 individuals in Agile projects from five different organizations: a global consulting organization, a multinational communications company, two multinational software development companies, and a large museum organization. This research contributes to Agile software development literature by analyzing decisions made during the iteration cycle and identifying six key obstacles to these decisions. Results indicate the six decision obstacles are unwillingness to commit to decisions; conflicting priorities; unstable resource availability; and lack of: implementation; ownership; empowerment. These six decision obstacles are mapped to descriptive decision making principles to demonstrate where the obstacles affect the decision process. The effects of these obstacles include a lack of longer-term, strategic focus for decisions, an ever-growing backlog of delayed work from previous iterations, and a lack of team engagement. "}},{"citationKey":"Mishra20121067","entryType":"article","entryTags":{"title":"Impact of physical ambiance on communication, collaboration and coordination in agile software development: An empirical evaluation ","journal":"Information and Software Technology ","volume":"54","number":"10","pages":"1067 - 1078","year":"2012","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2012.04.002","url":"http://www.sciencedirect.com/science/article/pii/S0950584912000730","author":"Deepti Mishra and Alok Mishra and Sofiya Ostrovska","keywords":["Collaboration","Communication","Coordination","Physical settings","Agile software development "],"abstract":"Context Communication, collaboration and coordination are key enablers of software development and even more so in agile methods. The physical environment of the workspace plays a significant role in effective communication, collaboration, and coordination among people while developing software. Objective In this paper, we have studied and further evaluated empirically the effect of different constituents of physical environment on communication, coordination, and collaboration, respectively. The study aims to provide a guideline for prospective agile software developers. Method A survey was conducted among software developers at a software development organization. To collect data, a survey was carried out along with observations, and interviews. Results It has been found that half cubicles are 'very effective' for the frequency of communication. Further, half cubicles were discovered 'effective' but not 'very effective' for the quality/effectiveness of communication. It is found that half-height cubicles and status boards are 'very effective' for the coordination among team members according to the survey. Communal/discussion space is found to be 'effective' but not 'very effective' for coordination among team members. Our analysis also reveals that half-height glass barriers are 'very effective' during the individuals problem-solving activities while working together as a team. Infact, such a physically open environment appears to improve communication, coordination, and collaboration. Conclusion According to this study, an open working environment with only half-height glass barriers and communal space plays a major role in communication among team members. The presence of status boards significantly help in reducing unnecessary communication by providing the required information to individuals and therefore, in turn reduce distractions a team member may confront in their absence. As communication plays a significant role in improving coordination and collaboration, it is not surprising to find the effect of open working environment and status boards in improving coordination and collaboration. An open working environment increases the awareness among software developers e.g. who is doing what, what is on the agenda, what is taking place, etc. That in turn, improves coordination among them. A communal/discussion space helps in collaboration immensely. "}},{"citationKey":"Hanssen20121455","entryType":"article","entryTags":{"title":"A longitudinal case study of an emerging software ecosystem: Implications for practice and theory ","journal":"Journal of Systems and Software ","volume":"85","number":"7","pages":"1455 - 1466","year":"2012","note":"Software Ecosystems ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2011.04.020","url":"http://www.sciencedirect.com/science/article/pii/S0164121211000963","author":"Geir K. Hanssen","keywords":["Software ecosystems","Software product line engineering","Agile software development","Longitudinal case study "],"abstract":"Software ecosystems is an emerging trend within the software industry, implying a shift from closed organizations and processes towards open structures, where actors external to the software development organization are becoming increasingly involved in development. This forms an ecosystem of organizations that are related through the shared interest in a software product, leading to new opportunities and new challenges to the industry and its organizational environment. To understand why and how this change occurs, we have followed the development of a software product line organization for a period of approximately five years. We have studied their change from a waterfall-like approach, via agile software product line engineering, towards an emerging software ecosystem. We discuss implications for practice, and propose a nascent theory on software ecosystems. We conclude that the observed change has led to an increase in collaboration across (previously closed) organizational borders, and to the development of a shared value consisting of two components: the technology (the product line, as an extensible platform), and the business domain it supports. Opening up both the technical interface of the product and the organizational interfaces are key enablers of such a change. "}},{"citationKey":"Magdaleno2012351","entryType":"article","entryTags":{"title":"Reconciling software development models: A quasi-systematic review ","journal":"Journal of Systems and Software ","volume":"85","number":"2","pages":"351 - 369","year":"2012","note":"Special issue with selected papers from the 23rd Brazilian Symposium on Software Engineering ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2011.08.028","url":"http://www.sciencedirect.com/science/article/pii/S0164121211002287","author":"Andrea Magalhaes Magdaleno and Claudia Maria Lima Werner and Renata Mendes de Araujo","keywords":["Systematic review","Software process","Reconciliation among development models","Plan-driven","Agile","Free/open source software "],"abstract":"Purpose The purpose of this paper is to characterize reconciliation among the plan-driven, agile, and free/open source software models of software development. Design/methodology/approach An automated quasi-systematic review identified 42 papers, which were then analyzed. Findings The main findings are: there exist distinct - organization, group and process - levels of reconciliation; few studies deal with reconciliation among the three models of development; a significant amount of work addresses reconciliation between plan-driven and agile development; several large organizations (such as Microsoft, Motorola, and Philips) are interested in trying to combine these models; and reconciliation among software development models is still an open issue, since it is an emerging area and research on most proposals is at an early stage. Research limitations Automated searches may not capture relevant papers in publications that are not indexed. Other data sources not amenable to execution of the protocol were not used. Data extraction was performed by only one researcher, which may increase the risk of threats to internal validity. Implications This characterization is important for practitioners wanting to be current with the state of research. This review will also assist the scientific community working with software development processes to build a common understanding of the challenges that must be faced, and to identify areas where research is lacking. Finally, the results will be useful to software industry that is calling for solutions in this area. Originality/value There is no other systematic review on this subject, and reconciliation among software development models is an emerging area. This study helps to identify and consolidate the work done so far and to guide future research. The conclusions are an important step towards expanding the body of knowledge in the field. "}},{"citationKey":"Adolph20121269","entryType":"article","entryTags":{"title":"Reconciling perspectives: A grounded theory of how people manage the process of software development ","journal":"Journal of Systems and Software ","volume":"85","number":"6","pages":"1269 - 1286","year":"2012","note":"Special Issue: Agile Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.01.059","url":"http://www.sciencedirect.com/science/article/pii/S0164121212000386","author":"Steve Adolph and Philippe Kruchten and Wendy Hall","keywords":["Software engineering","Software team","Agile manifesto agile software development","Scrum","Shared mental model","Grounded theory "],"abstract":"Social factors are significant cost drivers for the process of software development. In this field study we generate a grounded theory of how people manage the process of software development. The main concern of engineers involved in the process of software development is getting the job done. To get the job done, people engage in a four-stage process of Reconciling Perspectives. Reconciling Perspectives represents an attempt to converge individuals' points of view or perspectives about a software project. The process emphasizes the importance of individuals' abilities to both reach out and engage in negotiations and create shelter from environmental noise to bring a software project to fruition. "}},{"citationKey":"Ghanam2012968","entryType":"article","entryTags":{"title":"Making the leap to a software platform strategy: Issues and challenges ","journal":"Information and Software Technology ","volume":"54","number":"9","pages":"968 - 984","year":"2012","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2012.03.005","url":"http://www.sciencedirect.com/science/article/pii/S0950584912000547","author":"Yaser Ghanam and Frank Maurer and Pekka Abrahamsson","keywords":["Software platform","Software reuse","Platform challenges","Ethnographic study","Grounded Theory "],"abstract":"Context While there are many success stories of achieving high reuse and improved quality using software platforms, there is a need to investigate the issues and challenges organizations face when transitioning to a software platform strategy. Objective This case study provides a comprehensive taxonomy of the challenges faced when a medium-scale organization decided to adopt software platforms. The study also reveals how new trends in software engineering (i.e. agile methods, distributed development, and flat management structures) interplayed with the chosen platform strategy. Method We used an ethnographic approach to collect data by spending time at a medium-scale company in Scandinavia. We conducted 16 in-depth interviews with representatives of eight different teams, three of which were working on three separate platforms. The collected data was analyzed using Grounded Theory. Results The findings identify four classes of challenges, namely: business challenges, organizational challenges, technical challenges, and people challenges. The article explains how these findings can be used to help researchers and practitioners identify practical solutions and required tool support. Conclusion The organization's decision to adopt a software platform strategy introduced a number of challenges. These challenges need to be understood and addressed in order to reap the benefits of reuse. Researchers need to further investigate issues such as supportive organizational structures for platform development, the role of agile methods in software platforms, tool support for testing and continuous integration in the platform context, and reuse recommendation systems. "}},{"citationKey":"Kuhner20122232","entryType":"article","entryTags":{"title":"Progress on standardization and automation in software development on \\{W7X\\} ","journal":"Fusion Engineering and Design ","volume":"87","number":"12","pages":"2232 - 2237","year":"2012","note":"Proceedings of the 8th \\{IAEA\\} Technical Meeting on Control, Data Acquisition, and Remote Participation for Fusion Research ","issn":"0920-3796","doi":"http://dx.doi.org/10.1016/j.fusengdes.2012.06.003","url":"http://www.sciencedirect.com/science/article/pii/S0920379612003067","author":"Georg Kuhner and Torsten Bluhm and Peter Heimann and Christine Hennig and Hugo Kroiss and Jon Krom and Heike Laqua and Marc Lewerentz and Josef Maier and Jorg Schacht and Anett Spring and Andreas Werner and Manfred Zilker","keywords":["W7-X","Software development","Quality management","Standardization","ISO/IEC 15504 "],"abstract":"For a complex experiment like \\{W7X\\} being subject to changes all along its projected lifetime the advantages of a formalized software development method have already been stated [1]. Quality standards like ISO/IEC-12207 provide a guideline for structuring of development work and improving process and product quality. A considerable number of tools has emerged supporting and automating parts of development work. On \\{W7X\\} progress has been made during the last years in exploiting the benefit of automation and management during software development:- Continuous build, integration and automated test of software artefacts.[?] Syntax checks and code quality metrics. [?] Documentation generation. [?] Feedback for developers by temporal statistics. - Versioned repository for build products (libraries, executables). - Separate snapshot and release repositories and automatic deployment. - Semi-automatic provisioning of applications. - Feedback from testers and feature requests by ticket system. This toolset is working efficiently and allows the team to concentrate on development. The activity there is presently focused on increasing the quality of the existing software to become a dependable product. Testing of single functions and qualities must be simplified. So a restructuring is underway which relies more on small, individually testable components with standardized interfaces providing the capability to construct arbitrary function aggregates for dedicated tests of quality attributes as availability, reliability, performance. A further activity is on improving the development cycle. The use of release cycles has already provided favourable concentration of work and predictability of delivery times. However, the demand has risen, to react quickly on priority changes from W7X-project management. So a more agile development cycle is being prepared relying on smaller working packages, shorter release cycles and an associated release plan giving the software development responsible the possibility to react on a shorter time scale. "}},{"citationKey":"Choudhari2012761","entryType":"article","entryTags":{"title":"Story Points Based Effort Estimation Model for Software Maintenance ","journal":"Procedia Technology ","volume":"4","number":"","pages":"761 - 765","year":"2012","note":"2nd International Conference on Computer, Communication, Control and Information Technology( C3IT-2012) on February 25 - 26, 2012 ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2012.05.124","url":"http://www.sciencedirect.com/science/article/pii/S2212017312004033","author":"Jitender Choudhari and Ugrasen Suman","keywords":["Story point","software maintenance","RC story","maintenance project effort estimation","SMEEM "],"abstract":"Software is developed with prior requirements and it is maintained continuously with rapid progresses in domain, technology, economy, and other fields. Software maintenance is vital and it requires more efforts and resources than development phase. There are fewer methods available for maintenance effort estimation. An iterative maintenance life cycle using extreme programming is a model for software maintenance based on agile methodology that uses \\{RC\\} stories as requirement artifacts. Agile methodology uses analogy and expert opinion based estimation techniques such as planning poker. But in software maintenance, historical data and experts may not be present or accurate. Therefore, a heuristic method is required for the calculation of maintenance efforts. In this paper, we propose a Software Maintenance Effort Estimation Model (SMEEM) for software maintenance estimation. The \\{SMEEM\\} technique uses story points to calculate the volume of maintenance and value adjustment factors that are affecting story points for effort estimation. The proposed model will be illustrated with various types of maintenance projects. The model generates accurate and effective results as compared to other software maintenance effort estimation models. This model is applicable only for agile and extreme programming based maintenance environment. "}},{"citationKey":"Ohmori2012344","entryType":"article","entryTags":{"title":"Design and Implementation of Enterprise Systems in Fine-Grained Concurrent Computation ","journal":"Procedia Technology ","volume":"5","number":"","pages":"344 - 353","year":"2012","note":"4th Conference of \\{ENTERprise\\} Information Systems - aligning technology, organizations and people (CENTERIS 2012) ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2012.09.038","url":"http://www.sciencedirect.com/science/article/pii/S2212017312004690","author":"Kenji Ohmori","keywords":["Communicating Sequential Processes","Model-View-Control Software Architecture","Agile Software Development "],"abstract":"The computational power required to an enterprise system changes dynamically depending on services and the number of users. Massive concurrent computing is excellent in scalability, so that the paper proposes utilizing it for designing and implementing enterprise systems. The proposed accounting system is developed using Agile software development method to study the scalability of massive concurrent systems. When combining two subsystems in Agile, an attaching function is introduced. The system is designed using Model-View-Control software architecture and communicating sequential processes and then implemented with JCSP. Before implementation, the validity of the model is verified using verification tools. It reduces development cost and time. "}},{"citationKey":"Mahnic20122086","entryType":"article","entryTags":{"title":"On using planning poker for estimating user stories ","journal":"Journal of Systems and Software ","volume":"85","number":"9","pages":"2086 - 2095","year":"2012","note":"Selected papers from the 2011 Joint Working IEEE/IFIP Conference on Software Architecture (WICSA 2011) ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.04.005","url":"http://www.sciencedirect.com/science/article/pii/S0164121212001021","author":"Viljan Mahnic and Tomaz Hovelja","keywords":["Agile software development","Effort estimation","User story","Planning poker","Expert judgment","Scrum "],"abstract":"While most studies in psychology and forecasting stress the possible hazards of group processes when predicting effort and schedule, agile software development methods recommend the use of a group estimation technique called planning poker for estimating the size of user stories and developing release and iteration plans. It is assumed that the group discussion through planning poker helps in identifying activities that individual estimators could overlook, thus providing more accurate estimates and reducing the over-optimism that is typical for expert judgment-based methods. In spite of the widespread use of agile methods, there is little empirical evidence regarding the accuracy of planning poker estimates. In order to fill this gap a study was conducted requiring 13 student teams to develop a Web-based student records information system. All teams were given the same set of user stories which had to be implemented in three Sprints. Each team estimated the stories using planning poker and the estimates provided by each team member during the first round were averaged to obtain the statistical combination for further comparison. In the same way the stories were estimated by a group of experts. The study revealed that students' estimates were over-optimistic and that planning poker additionally increased the over-optimism. On the other hand, the experts' estimates obtained through planning poker were much closer to actual effort spent and tended to be more accurate than the statistical combination of their individual estimates. The results indicate that the optimism bias caused by group discussion diminishes or even disappears as the expertise of the people involved in the group estimation process increases. "}},{"citationKey":"FuentesFernandez2012247","entryType":"article","entryTags":{"title":"A model-driven process for the modernization of component-based systems ","journal":"Science of Computer Programming ","volume":"77","number":"3","pages":"247 - 269","year":"2012","note":"Feature-Oriented Software Development (FOSD 2009) ","issn":"0167-6423","doi":"http://dx.doi.org/10.1016/j.scico.2011.04.003","url":"http://www.sciencedirect.com/science/article/pii/S0167642311001110","author":"Ruben Fuentes-Fernandez and Juan Pavon and Francisco Garijo","keywords":["Modernization of software systems","Component","Software methodology","Software engineering","Agile process","Model-driven engineering "],"abstract":"Software modernization is critical for organizations that need cost-effective solutions to deal with the rapid obsolescence of software and the increasing demand for new functionality. This paper presents the \\{XIRUP\\} modernization methodology, which proposes a highly iterative process, structured into four phases: preliminary evaluation, understanding, building and migration. This modernization process is feature-driven, component-based, focused on the early elicitation of key information, and relies on a model-driven approach with extensive use of experience from the previous projects. \\{XIRUP\\} has been defined in the European \\{IST\\} project MOMOCS, which has also built a suite of support tools. This paper introduces the process using a case study that illustrates its activities, related tools and results. The discussion highlights the specific characteristics of modernization projects and how a customized methodology can take advantage of them. "}},{"citationKey":"Senapathi20121255","entryType":"article","entryTags":{"title":"Understanding post-adoptive agile usage: An exploratory cross-case analysis ","journal":"Journal of Systems and Software ","volume":"85","number":"6","pages":"1255 - 1268","year":"2012","note":"Special Issue: Agile Development ","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2012.02.025","url":"http://www.sciencedirect.com/science/article/pii/S0164121212000489","author":"Mali Senapathi and Ananth Srinivasan","keywords":["Post-adoptive agile usage","Effectiveness","Kanban","Scrum "],"abstract":"While past research has contributed to the understanding of how organizations adopt agile methodologies (AM), little is known about their post-adoptive usage in organizations. By integrating theories from systems development methodologies, diffusion of innovations, and agile methodology literature, this paper proposes a new model that identifies a set of critical factors pertinent to post-adoptive usage of agile practices. This model is used to inform analysis of post-adoptive usage of agile practices in two major organizations. The results indicate relative advantage, team attitude and technical competence, championing, and top management support (TMS) are the key factors determining the extent to which agile practices can be assimilated into an organization. Specifically, both findings and this model confirm that the deeper the assimilation of agile practices into the organization, the better understanding of how assimilation leads to specific improvements in its systems development outcomes. "}},{"citationKey":"BenDavid2012723","entryType":"article","entryTags":{"title":"Supplier ranking by multi-alternative proposal analysis for agile projects ","journal":"International Journal of Project Management ","volume":"30","number":"6","pages":"723 - 730","year":"2012","note":"European Academy of Management (EURAM 2011) Conference ","issn":"0263-7863","doi":"http://dx.doi.org/10.1016/j.ijproman.2012.01.002","url":"http://www.sciencedirect.com/science/article/pii/S0263786312000038","author":"Arie Ben-David and Roy Gelbard and Irena Milstein","keywords":["\\{IT\\} projects","RFP","Proposal analysis","Agile","ROC curve","Cost-benefit curve "],"abstract":"Changing requirements and on-going decision making along the entire project life cycle are well handled by Agile methods. However Agile projects still use evaluation methods during the \\{RFP\\} stage that do not fulfill the flexibility mandated by the Agile manifesto. Current evaluation methods assume a single development alternative, and thus a fixed cost-benefit tradeoff. The proposed model provides a more realistic approach by relaxing this assumption. It assumes that a supplier can propose several different alternatives (Multi-Alternative Proposal) reflecting diverse potential cost-benefit tradeoffs. The model makes it possible to rank the suppliers of these Multi-Alternative Proposals at the \\{RFP\\} stage. The ideas behind the method combine concepts from both the Agile approach and Data Mining. Thus suppliers who provide multi-alternative proposals can be ranked in an objective, but very intuitive manner. "}},{"citationKey":"Hasan2012898","entryType":"article","entryTags":{"title":"Agility and production flow layouts: An analytical decision analysis ","journal":"Computers & Industrial Engineering ","volume":"62","number":"4","pages":"898 - 907","year":"2012","note":"","issn":"0360-8352","doi":"http://dx.doi.org/10.1016/j.cie.2011.12.011","url":"http://www.sciencedirect.com/science/article/pii/S0360835211003846","author":"Mohd. Asif Hasan and Joseph Sarkis and Ravi Shankar","keywords":["Agile manufacturing","Agility","Layout","Production layout","Production flow layout","Analytical Network Process (ANP) "],"abstract":"The term 'agile manufacturing' has referred to operational aspects of a manufacturing company concerning their ability to produce customized products at mass production prices and with short lead times. A core issue faced within agile manufacturing is the need for appropriate and supporting production and operations systems. Many design dimensions of agility and agile manufacturing exist. To help attain this goal for integrating the many design dimensions, operations infrastructure and capacity must be carefully planned to manage production flow, and thus production layout planning takes on an increasingly important role. Given the importance of these dimensions in response to agility, this paper seeks to make a contribution by providing insights into a decision aid for evaluating production flow layouts that support and enhance the agile manufacture of products. Layout design has a significant impact on the performance of a manufacturing or service industry system and has been an active research area for many decades. Strategic evaluation of production layouts requires consideration of both qualitative and quantitative factors (managerial, organizational, and technical). This paper makes use of the Analytical Network Process (ANP) which captures interdependencies among different criteria, sub-criteria and dimensions, an evident characteristic of production flow layouts in complex agile manufacturing environments. An application case study exemplifying the practical usefulness of this type of model describes how management, after implementation of the model, made a mid-course correction related to the production layout initially selected. "}},{"citationKey":"Freiberg201210177","entryType":"article","entryTags":{"title":"Extensible Prototyping for pragmatic engineering of knowledge-based systems ","journal":"Expert Systems with Applications ","volume":"39","number":"11","pages":"10177 - 10190","year":"2012","note":"","issn":"0957-4174","doi":"http://dx.doi.org/10.1016/j.eswa.2012.02.110","url":"http://www.sciencedirect.com/science/article/pii/S0957417412003739","author":"Martina Freiberg and Albrecht Striffler and Frank Puppe","keywords":["Evolutionary prototyping","UI prototyping","Mixed fidelity prototyping","Participatory development","Agile development","Engineering knowledge-based systems "],"abstract":"Knowledge-based systems (KBSs) have been built and practically applied in various contexts for decades. Yet, they still challenge developers by their complexity: Apart from a sound knowledge base they likewise require comprehensive user interface (UI) and interaction design for supporting the task at hand optimally. However, current KBS-Engineering methodologies still mostly focus on knowledge base development, regarding UI/interaction design a more incidental, low priority task. Thus, the \\{UI\\} often is developed in a rather ad hoc manner, thereby neglecting the potential of experimental design and creating reusable solutions. The integration of (rapid) evolutionary prototyping activities with \\{KBS\\} Engineering offers the chance for incorporating UI/interaction design more prominently into the process while at the same time leveraging the overall development task; specifically, we propose Extensible Prototyping as a tailored prototyping approach and we suggest its integration with the Agile Process Model for knowledge-based systems in this paper. For practical support, we further introduce the customized prototyping and knowledge systems engineering tool ProKEt, and we report on practical experiences with applying both the approach and the tool. "}},{"citationKey":"Kowalkowski2012765","entryType":"article","entryTags":{"title":"Service infusion as agile incrementalism in action ","journal":"Journal of Business Research ","volume":"65","number":"6","pages":"765 - 772","year":"2012","note":"(1) Scientific Muddling (2) Executional Elements In Advertising ","issn":"0148-2963","doi":"http://dx.doi.org/10.1016/j.jbusres.2010.12.014","url":"http://www.sciencedirect.com/science/article/pii/S0148296310002778","author":"Christian Kowalkowski and Daniel Kindstrom and Thomas Brashear Alejandro and Staffan Brege and Sergio Biggemann","keywords":["Service infusion","Service transition","Agile incrementalism","Strategy "],"abstract":"As product markets mature, firms are increasingly offering industrial services, in order to differentiate themselves and remain competitive. The general strategic view emerging from the services literature is that service infusion in manufacturing industries takes a somewhat unidirectional path from products to service provision. Based on in-depth case study research in the materials handling industry and drawing on Lindblom's (1979) concept of disjointed incrementalism, this study shows how service infusion often takes place in small steps without clearly directed efforts. The study identifies elements of incrementalism central to service infusion and demonstrates how a successful service strategy involves continuous modifications, adaptability, the seizing of ad hoc innovation, a continuous recalibration of opportunities, and the management of intertwining goals. The study introduces the concept of agile incrementalism; this concept aptly describes this contingency approach. The article contributes to a multifaceted and nuanced picture of service strategy and the service-infusion process. "}},{"citationKey":"Ahn201217","entryType":"article","entryTags":{"title":"Rethinking XML-enabled agile supply chains ","journal":"International Journal of Information Management ","volume":"32","number":"1","pages":"17 - 23","year":"2012","note":"","issn":"0268-4012","doi":"http://dx.doi.org/10.1016/j.ijinfomgt.2011.06.002","url":"http://www.sciencedirect.com/science/article/pii/S0268401211000697","author":"Hyung Jun Ahn and Paul Childerhouse and Gottfried Vossen and Habin Lee","keywords":["Agile supply chain","Supply chain","XML","Business to business","ebXML","RosettaNet","Web Services "],"abstract":"This paper critically discusses the use of Extensible Markup Language (XML) for agile supply chains and proposes practical guidelines and future research directions for the field. \\{XML\\} has been identified by many as a prominent technology for enabling electronic supply chain integration, but the adoption of it in the industry has been rather slow and limited. This paper discusses the factors that enable agility in supply chains, and explains why \\{XML\\} is the best candidate for facilitating such factors. Then the major XML-based integration initiatives such as ebXML, RosettaNet, and Web Services are diagnosed in terms of their pros and cons for supply chain agility, as well as the reasons for their slow diffusion. Based on the discussion, this paper proposes that: the integration efforts need to first focus on the industries that need agility; stringent business process standards are necessary; and implementation should be made much easier and more affordable for small and medium enterprises (SMEs). Further research issues are also suggested based on the discussion. "}},{"citationKey":"Turner2012309","entryType":"article","entryTags":{"title":"Effectiveness of kanban approaches in systems engineering within rapid response environments ","journal":"Procedia Computer Science ","volume":"8","number":"","pages":"309 - 314","year":"2012","note":"Conference on Systems Engineering Research ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2012.01.065","url":"http://www.sciencedirect.com/science/article/pii/S187705091200066X","author":"Richard Turner and Dan Ingold and Jo Ann Lane and Ray Madachy and David Anderson","keywords":["Agile systems engineering","lean systems engineering","kanban","rapid response","scheduling","systems engineering management "],"abstract":"Effective application of systems engineering in rapid response environments has been difficult, particularly those where large, complex brownfield systems or systems of systems exist and are constantly being updated with both short and long term software enhancements. This paper proposes a general case for solving this problem by combining a services approach to systems engineering with a kanban-based scheduling system. It provides the basis for validating the approach with agent-based simulations. "}},{"citationKey":"Ribeiro20121142","entryType":"article","entryTags":{"title":"\\{IMS\\} 10--Validation of a co-evolving diagnostic algorithm for evolvable production systems ","journal":"Engineering Applications of Artificial Intelligence ","volume":"25","number":"6","pages":"1142 - 1160","year":"2012","note":"","issn":"0952-1976","doi":"http://dx.doi.org/10.1016/j.engappai.2012.02.008","url":"http://www.sciencedirect.com/science/article/pii/S0952197612000450","author":"Luis Ribeiro and Jose Barata","keywords":["Distributed diagnostic systems","Mechatronic networks","Mechatronic Agents","Multiagent systems","Agile manufacturing "],"abstract":"With the systematic implantation and acceptance of \\{IT\\} in the shop-floor a wide range of production paradigms, relying in open interoperable architectures, have been developed. Exploring these technological novelties, they promise to revolutionize the way current plant floors operate and react to emerging opportunities and disturbances. There is a high interest of module providers in the adoption of these open mechatronic architectures as they may provide a new business model where the automation solution can be easily tailored for each customer in due time and ships with a significant part of the control solution (high added value). Final customers on their side can contract operating hours rather than buying modules. Moreover, the automation solution can be swiftly modified to meet changing requirements. The necessary increase in the number of distributed and autonomous components that interact in the execution of processes implies that new diagnostic approaches should be developed to tackle the network layer of these highly dynamic systems. In fact fault propagation events can be harder to understand and can affect the system in unpredictable and pervasive ways. Following this rationale the paper presents a potential diagnostic solution that targets multiagent-based mechatronic systems where their components are highly decoupled from a control point of view. The diagnostic architecture presented tackles the problem of fault propagation while preserving the decoupled nature of the Mechatronic Agent concept. In this context the diagnostic system explores self-organization to enact an emergent response that denotes macro-level coherence. The system's response is the result of an individual probabilistic diagnostic inference based on Hidden Markov Models that capture the propagating nature of a failure. The validation results of the proposed diagnostic approach are detailed for the system's response in simulation (highlighting the main variables that affect the performance of the system) and compared to the system applied to a pilot assembly cell. The simulation model and the performance metrics considered are detailed and discussed along with the main implementation details. "}},{"citationKey":"Theorin2012799","entryType":"article","entryTags":{"title":"Service-oriented Process Control with Grafchart and the Devices Profile for Web Services ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"45","number":"6","pages":"799 - 804","year":"2012","note":"14th \\{IFAC\\} Symposium on Information Control Problems in Manufacturing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20120523-3-RO-2023.00131","url":"http://www.sciencedirect.com/science/article/pii/S1474667016332475","author":"Alfred Theorin and Lisa Ollinger and Charlotta Johnsson","keywords":["Manufacturing control","Process models","Flexible manufacturing systems","Production control","Agile manufacturing","Control systems "],"abstract":"Abstract To fulfill increasing requirements within the manufacturing sector, highly flexible and adaptable automation systems are needed. It is desirable to have one integrated approach that stretches from the process planning phase, through the implementation phase and all the way to the phase for execution of the process control logics. One promising approach is to use the concepts of service-oriented architectures within automation, here referred to as SOA-AT. As service technology, \\{DPWS\\} has proved to be the most suitable for realizing service based communication on device level. The paper shows how Grafchart, a graphical language aimed for sequential control applications, can support the development of \\{DPWS\\} applications, and how Grafchart can be used for process modeling and execution in the planning and execution phase. This constitutes a unique framework for the development and execution of \\{SOA\\} applications in accordance with the requirements for automatic control tasks. The paper also presents an industry-related experimental setup in which the SOA-AT concepts are demonstrated through the use of Grafchart. "}},{"citationKey":"DominguezMayo20121265","entryType":"article","entryTags":{"title":"Quality evaluation for Model-Driven Web Engineering methodologies ","journal":"Information and Software Technology ","volume":"54","number":"11","pages":"1265 - 1282","year":"2012","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2012.06.007","url":"http://www.sciencedirect.com/science/article/pii/S0950584912001103","author":"F.J. Dominguez-Mayo and M.J. Escalona and M. Mejias and M. Ross and G. Staples","keywords":["Software engineering","Standards","Metrics/measurement","Methodologies","Quality analysis and evaluation","Software quality/SQA "],"abstract":"Context There are lots of approaches or methodologies in the Model-Driven Web Engineering (MDWE) context to develop Web Applications without reaching a consensus on the use of standards and scarcity of both, practical experience and tool support. Objective Model-Driven Web Engineering (MDWE) methodologies are constantly evolving. Moreover, Quality is a very important factor to identify within a methodology as it defines processes, techniques and artifacts to develop Web Applications. For this reason, when analyzing a methodology, it is not only necessary to evaluate quality, but also to find out how to improve it. The main goal of this paper is to develop a set of Quality Characteristics and Sub-Characteristics for \\{MDWE\\} approaches based on ISO/IEC standards. Method From the software products context, some widely standards proposed, such as ISO/IEC 9126 or ISO/IEC 25000, suggest a Quality Model for software products, although up to now, there are no standard methods to assess quality on \\{MDWE\\} methodologies. Such methodologies can be organized into Properties, thus, a methodology has artifacts, processes and techniques. Then, each item is evaluated through a set of appropriate Quality Characteristics, depending on its nature. This paper proposes to evaluate a methodology as a product itself. Results This paper recommends a set of Quality Characteristics and Sub-Characteristics based on these standards in order to evaluate \\{MDWE\\} methodologies quality. Additionally, it defines an agile way to relate these Quality Sub-Characteristics to Properties with the sole purpose of not only analyzing, but also assessing and improving \\{MDWE\\} methodologies. Conclusions The application of these Quality Characteristics and Sub-Characteristics could promote efficiency in methodologies since this kind of assessment enhances both the understanding of strengths and weaknesses of approaches. "}},{"citationKey":"Feitelson2012859","entryType":"article","entryTags":{"title":"Perpetual development: A model of the Linux kernel life cycle ","journal":"Journal of Systems and Software ","volume":"85","number":"4","pages":"859 - 875","year":"2012","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2011.10.050","url":"http://www.sciencedirect.com/science/article/pii/S0164121211002822","author":"Dror G. Feitelson","keywords":["Software evolution","Software release","Maintenance","Linux kernel "],"abstract":"Software evolution is widely recognized as an important and common phenomenon, whereby the system follows an ever-extending development trajectory with intermittent releases. Nevertheless there have been only few lifecycle models that attempt to portray such evolution. We use the evolution of the Linux kernel as the basis for the formulation of such a model, integrating the progress in time with growth of the codebase, and differentiating between development of new functionality and maintenance of production versions. A unique element of the model is the sequence of activities involved in releasing new production versions, and how this has changed with the growth of Linux. In particular, the release follow-up phase before the forking of a new development version, which was prominent in early releases of production versions, has been eliminated in favor of a concurrent merge window in the release of 2.6.x versions. We also show that a piecewise linear model with increasing slopes provides the best description of the growth of Linux. The perpetual development model is used as a framework in which commonly recognized benefits of incremental and evolutionary development may be demonstrated, and to comment on issues such as architecture, conservation of familiarity, and failed projects. We suggest that this model and variants thereof may apply to many other projects in addition to Linux. "}},{"citationKey":"Hosseini2012427","entryType":"incollection","entryTags":{"title":"Integration in Process Industries via Unified Processing Core (UPC) in operational and logistic planning levels ","editor":"Ian David Lockhart Bogle and Michael Fairweather","booktitle":"22nd European Symposium on Computer Aided Process Engineering","publisher":"Elsevier","year":"2012","volume":"30","pages":"427 - 431","series":"Computer Aided Chemical Engineering ","issn":"1570-7946","doi":"http://dx.doi.org/10.1016/B978-0-444-59519-5.50086-1","url":"http://www.sciencedirect.com/science/article/pii/B9780444595195500861","author":"Reza Hosseini and Petri Helo","keywords":["Integration","Unified Processing Core (UPC)","Process Industries "],"abstract":"Abstract Highly automated production facilities are one of the most important characteristics of process industries. To rely on mentioned feature and adhere networked, fully automated, agile, integrated production of different companies, using identical computational algorithms, throughout different automation layers of an enterprise, could have fundamental impact in creation of Unified Processing Core (UPC), integration and system dynamic consequently. In this paper the effect of application of shared computational models in integration of business and operational levels operators and influence of it in degree of responsiveness of networked production against market demands with exploiting of reduction in mathematical computational, data interaction processes have been modeled holistically. "}},{"citationKey":"Cattaneo201255","entryType":"article","entryTags":{"title":"Characterization of a tagged beam line at the Beam Test Facility ","journal":"Nuclear Instruments and Methods in Physics Research Section A: Accelerators, Spectrometers, Detectors and Associated Equipment ","volume":"674","number":"","pages":"55 - 66","year":"2012","note":"","issn":"0168-9002","doi":"http://dx.doi.org/10.1016/j.nima.2012.01.049","url":"http://www.sciencedirect.com/science/article/pii/S0168900212000897","author":"P.W. Cattaneo and A. Argan and F. Boffelli and A. Bulgarelli and B. Buonomo and A.W. Chen and F. D'Ammando and L. Foggetta and T. Froysland and F. Fuschino and M. Galli and F. Gianotti and A. Giuliani and F. Longo and M. Marisaldi and G. Mazzitelli and A. Pellizzoni and M. Prest and G. Pucella and L. Quintieri and A. Rappoldi and M. Tavani and M. Trifoglio and A. Trois and P. Valente and E. Vallazza and S. Vercellone and A. Zambra and G. Barbiellini and P. Caraveo and V. Cocco and E. Costa and G. De Paris and E. Del Monte and G. Di Cocco and I. Donnarumma and Y. Evangelista and M. Feroci and A. Ferrari and M. Fiorini and C. Labanti and I. Lapshov and F. Lazzarotto and P. Lipari and M. Mastropietro and S. Mereghetti and E. Morelli and E. Moretti and A. Morselli and L. Pacciani and F. Perotti and G. Piano and P. Picozza and M. Pilia and G. Porrovecchio and M. Rapisarda and A. Rubini and S. Sabatini and P. Soffitta and E. Striani and V. Vittorini and D. Zanello and S. Colafrancesco and P. Giommi and C. Pittori and P. Santolamazza and F. Verrecchia and L. Salotti","keywords":["Electron and positron beam","Photon beam","Position-sensitive detectors","Bremsstrahlung "],"abstract":"At the core of the \\{AGILE\\} scientific instrument, designed to operate on a satellite, there is the Gamma Ray Imaging Detector (GRID) consisting of a Silicon Tracker (ST), a Cesium Iodide Mini-Calorimeter and an Anti-Coincidence system of plastic scintillator bars. The \\{ST\\} needs an on-ground calibration with a g - ray beam to validate the simulation used to calculate the energy response function and the effective area versus the energy and the direction of the g rays. A tagged g - ray beam line was designed at the Beam Test Facility (BTF) of the \\{INFN\\} Laboratori Nazionali of Frascati (LNF), based on an electron beam generating g - rays through bremsstrahlung in a position-sensitive target. The g - ray energy is deduced by difference with the post-bremsstrahlung electron energy [1,2]. The electron energy is measured by a spectrometer consisting of a dipole magnet and an array of position sensitive silicon strip detectors, the Photon Tagging System (PTS). The use of the combined BTF-PTS system as tagged photon beam requires understanding the efficiency of g - ray tagging, the probability of fake tagging, the energy resolution and the relation of the \\{PTS\\} hit position versus the g - ray energy. This paper describes this study comparing data taken during the \\{AGILE\\} calibration occurred in 2005 with simulation. "}},{"citationKey":"Costa2012292","entryType":"article","entryTags":{"title":"Assessment of a Product Range Model concept to support design reuse using rule based systems and case based reasoning ","journal":"Advanced Engineering Informatics ","volume":"26","number":"2","pages":"292 - 305","year":"2012","note":"Knowledge based engineering to support complex product design ","issn":"1474-0346","doi":"http://dx.doi.org/10.1016/j.aei.2011.11.001","url":"http://www.sciencedirect.com/science/article/pii/S1474034611000954","author":"Carlos Alberto Costa and Marcos Alexandre Luciano and Celson Pantoja Lima and Robert I.M. Young","keywords":["Extended information models","Rule based systems","Case based reasoning","Design reuse","Product Range Model "],"abstract":"Knowledge reuse is recognised as a key element to support agile and effective decision-making processes during product development. The provision of information and knowledge for reuse relies on defined information structures and requires computational techniques that enable the reuse process within an integrated environment. Although, representing, saving, and sharing information is relatively well known for product modelling, it is accepted that effective and agile product development also requires knowledge sharing. For this reason, extensions of the Product Model structure are required to support specific product development process phases. This work argues that a product information model combined with extended knowledge models can provide decision support throughout the product development phases. This paper presents the results of an investigation into a specific extended knowledge model concept, named a Product Range Model (PRM), which combines both rule based systems and case based reasoning to provide product design decision support. Two product development scenarios, injection moulding and friction materials, have been selected in order to evaluate the ideas presented. For both applications the relevance of the models to support the capture and reuse of information and knowledge is stressed. "}},{"citationKey":"Noran2012327","entryType":"article","entryTags":{"title":"Achieving a sustainable interoperability of standards ","journal":"Annual Reviews in Control ","volume":"36","number":"2","pages":"327 - 337","year":"2012","note":"","issn":"1367-5788","doi":"http://dx.doi.org/10.1016/j.arcontrol.2012.09.014","url":"http://www.sciencedirect.com/science/article/pii/S1367578812000491","author":"Ovidiu Noran","keywords":["Interoperability","Standard","Framework","Expert system "],"abstract":"Agile enterprises and networks are required to continuously evolve so as to adequately respond to a dynamic, global and very competitive business environment. Unfortunately, this continuous change requirement affects the capacity of the enterprise to effectively interoperate internally and externally. Adding to this problem, the standards typically used as pillars for enterprise and network management and (inter)operation are themselves subject to continuous change and often bring their own interoperability, inconsistency and overlap problems. It is essential that such concerns are identified and addressed in a sustainable manner, i.e. taking into account the life cycles of all entities involved as their interoperability capabilities and requirements change along their lives. This paper focuses on interoperability issues specific to standards and proposes a novel and original way forward based on principles tested in previous case studies combining elements from the Enterprise Interoperability, Architecture and Integration, Collaborative Networks and Artificial Intelligence bodies of knowledge. "}},{"citationKey":"Antonello20121863","entryType":"article","entryTags":{"title":"Deep packet inspection tools and techniques in commodity platforms: Challenges and trends ","journal":"Journal of Network and Computer Applications ","volume":"35","number":"6","pages":"1863 - 1878","year":"2012","note":"","issn":"1084-8045","doi":"http://dx.doi.org/10.1016/j.jnca.2012.07.010","url":"http://www.sciencedirect.com/science/article/pii/S1084804512001622","author":"Rafael Antonello and Stenio Fernandes and Carlos Kamienski and Djamel Sadok and Judith Kelner and Istvan Godor and Geza Szabo and Tord Westholm","keywords":["Deep packet inspection","Traffic Identification","Internet profiling "],"abstract":"Deep packet inspection (DPI) helps Internet service providers in efforts to profile networked applications. By relying on \\{DPI\\} systems, Internet service providers may apply different charging policies, traffic shaping, or offer quality of service (QoS) guarantees to selected users or applications. As critical network services rely on the precise characterization of network flows, building agile and efficient \\{DPI\\} systems has recently become an important research topic. In this paper, we present a comprehensive literature review on the tools and techniques necessary to develop modern \\{DPI\\} systems. We provide the essential technical background material and examine the current body of research in \\{DPI\\} engines' optimization for commodity platforms. Then we discuss current research challenges and present guidelines for building high performance \\{DPI\\} systems. "}},{"citationKey":"Noran20121272","entryType":"article","entryTags":{"title":"Towards A Sustainable Interoperability of Standards ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"45","number":"6","pages":"1272 - 1277","year":"2012","note":"14th \\{IFAC\\} Symposium on Information Control Problems in Manufacturing ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20120523-3-RO-2023.00123","url":"http://www.sciencedirect.com/science/article/pii/S1474667016333262","author":"Ovidiu Noran","keywords":["Interoperability","Standard","Framework","Expert System "],"abstract":"Abstract Agile enterprises and networks are required to continuously evolve so as to adequately respond to a dynamic global and very competitive business environment. Unfortunately, this continuous change requirement affects the capacity of the enterprise to effectively interoperate internally and externally. Adding to this problem, the standards typically used as pillars for enterprise and network management and (inter)operation are themselves subject to continuous change and often have their own interoperability, inconsistency and overlap problems. It is essential that these concerns are identified and addressed in a sustainable manner, i.e. taking into account the life cycles of all entities involved as their interoperability capabilities and requirements change along their lives. This paper focuses on the issues specific to the standards and proposes a way forward based on principles tested in previous case studies combining elements from the Enterprise Interoperability, Architecture and Integration, Collaborative Networks and Artificial Intelligence bodies of knowledge. "}},{"citationKey":"Roberts2012579","entryType":"article","entryTags":{"title":"Investigating firm's customer agility and firm performance: The importance of aligning sense and respond capabilities ","journal":"Journal of Business Research ","volume":"65","number":"5","pages":"579 - 585","year":"2012","note":"","issn":"0148-2963","doi":"http://dx.doi.org/10.1016/j.jbusres.2011.02.009","url":"http://www.sciencedirect.com/science/article/pii/S0148296311000427","author":"Nicholas Roberts and Varun Grover","keywords":["Customer agility","Sense and respond","Dynamic capabilities","Alignment "],"abstract":"In today's hypercompetitive environment, firms that are agile tend to be more successful. However, despite the widely accepted importance of agility, there is limited research on this construct. In this study we aim to conceptually define and operationalize firm's customer agility. We propose that agility comprises two distinct capabilities, sensing and responding, and we address the issue of alignment between these capabilities and its impact on performance. Using a dynamic capabilities framework, we formulate both matching and mediating perspectives on customer agility. Based on data collected from marketing managers, we tested hypotheses pertaining to the two methods of alignment. The results indicate significant support for the role of both forms of alignment on performance. Implications for research and practice are discussed. "}},{"citationKey":"Draghici2012527","entryType":"article","entryTags":{"title":"\\{ICT\\} Infrastructure Created to Support CertiBPM Project and Training Program ","journal":"Procedia Technology ","volume":"5","number":"","pages":"527 - 536","year":"2012","note":"4th Conference of \\{ENTERprise\\} Information Systems - aligning technology, organizations and people (CENTERIS 2012) ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2012.09.058","url":"http://www.sciencedirect.com/science/article/pii/S2212017312004896","author":"Anca Draghici and George Draghici and Cristian Olariu and Alexandru Canda","keywords":["Business Process Management (BPM)","Training and Certification","Virtual Office","e-Learning platform "],"abstract":"\\{BPM\\} implementation and effects are strongly connected with continuous improvement processes strategies, successful recipes followed by modern organizations to gain those capabilities that are needed to innovate, reenergize performances and deliver the value in accordance with the market demands. In addition; \\{BPM\\} makes organization agile course corrections, embeds Six Sigma quality and reduce cumulative costs across the value chain. It is recognized that \\{BPM\\} in practice is most challenged in the Implementing Level focus on the role of information technology and human resources play in developing the soft assets required to execute the business process. \\{BPM\\} performance is related to employees' knowledge in \\{BPM\\} (basic and advanced) that could be developed through training programs. The main ideas debates in the paper are: a brief description of the CertiBPM training program developed as an innovative product on the market; description of the \\{ICT\\} collaborative environment created for the CertiBPM project. "}},{"citationKey":"Hamdani2012223","entryType":"article","entryTags":{"title":"Open Innovation Implementation to Sustain Indonesian \\{SMEs\\} ","journal":"Procedia Economics and Finance ","volume":"4","number":"","pages":"223 - 233","year":"2012","note":"International Conference on Small and Medium Enterprises Development with a Theme ?Innovation and Sustainability in \\{SME\\} Development? (ICSMED 2012) ","issn":"2212-5671","doi":"http://dx.doi.org/10.1016/S2212-5671(12)00337-1","url":"http://www.sciencedirect.com/science/article/pii/S2212567112003371","author":"Jahja Hamdani and Christina Wirawan","keywords":["open innovation","SME","sustanability "],"abstract":"Small and Medium Enterprise (SME) in Indonesia plays an important role in social and economic growth, due to great number of industry, \\{GDP\\} contribution, and total employment. SMEs' characteristic more agile and adaptable that capable to survive and raise their performance during economical crisis than larger firm. But the increasing of business competition, in particular against large and modern competitor, put \\{SMEs\\} in a vulnerable position. The development of sustainable \\{SMEs\\} becomes important step to strengthen and sustain Indonesian economy. According to previous studies, factors affecting success among Indonesian \\{SMEs\\} are marketing, technology, capital access and human resources quality. Unfortunately, all of these factors still becoming problem in Indonesian SMEs. Open innovation is a proposed methodology to overcome Indonesian SMEs' problem, because several Indonesian SMEs' characteristics match with open innovation implementation. The innovation value chain framework is used to explain how open innovation could help to succeed and sustain Indonesian SMEs. "}},{"citationKey":"Okatan201259","entryType":"article","entryTags":{"title":"Managing Knowledge for Innovation and Intra Networking: A Case Study ","journal":"Procedia - Social and Behavioral Sciences ","volume":"62","number":"","pages":"59 - 63","year":"2012","note":"World Conference on Business, Economics and Management (BEM-2012), May 4-6 2012, Antalya, Turkey ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2012.09.012","url":"http://www.sciencedirect.com/science/article/pii/S1877042812034532","author":"Kagan Okatan","keywords":["Innovation","Knowledge management","Information services","Information technologies "],"abstract":"Recently, innovation has become a very important issue, as it provides a strategic advantage for organizations to outperform competition and remain agile in the market. Additionally, knowledge management is considered to be a strong support for innovation. Managing knowledge for innovation is a difficult issue for organizations, because innovative knowledge is implicit and hard to capture from minds. To make this knowledge explicit, we must use supportive technologies. In this article, we focus o n intra networking - a type of social networking as a tool for managing knowledge for innovation in organizations. Intra networking is known as intranet in business and technological society. We define intranet as an internal or private network of an organi zation based on Internet technology (such as hypertext and TCP/IP protocols) and accessed over the Internet. An intranet is meant fo r the exclusive use of the organization and its associates (customers, employees, members, suppliers, etc.) and is protected from unauthorized access with security systems such as firewalls. It creates a meeting point for sharing knowledge for its users. We use a case study of a communication company to show intra networking as an effective supportive technology for knowledge management. "}},{"citationKey":"Wikgren201295","entryType":"article","entryTags":{"title":"Selective breeding for endurance running capacity affects cognitive but not motor learning in rats ","journal":"Physiology & Behavior ","volume":"106","number":"2","pages":"95 - 100","year":"2012","note":"","issn":"0031-9384","doi":"http://dx.doi.org/10.1016/j.physbeh.2012.01.011","url":"http://www.sciencedirect.com/science/article/pii/S0031938412000236","author":"Jan Wikgren and Georgios G. Mertikas and Pekka Raussi and Riina Tirkkonen and Laura Ayravainen and Markku Pelto-Huikko and Lauren G. Koch and Steven L. Britton and Heikki Kainulainen","keywords":["Aerobic capacity","Classical conditioning","T-maze "],"abstract":"The ability to utilize oxygen has been shown to affect a wide variety of physiological factors often considered beneficial for survival. As the ability to learn can be seen as one of the core factors of survival in mammals, we studied whether selective breeding for endurance running, an indication of aerobic capacity, also has an effect on learning. Rats selectively bred over 23 generations for their ability to perform forced treadmill running were trained in an appetitively motivated discrimination-reversal classical conditioning task, an alternating T-maze task followed by a rule change (from a shift-win to stay-win rule) and motor learning task. In the discrimination-reversal and T-maze tasks, the high-capacity runner (HCR) rats outperformed the low-capacity runner (LCR) rats, most notably in the phases requiring flexible cognition. In the Rotarod (motor-learning) task, the \\{HCR\\} animals were overall more agile but learned at a similar rate with the \\{LCR\\} group as a function of training. We conclude that the intrinsic ability to utilize oxygen is associated especially with tasks requiring plasticity of the brain structures implicated in flexible cognition. "}},{"citationKey":"Urikova2012128","entryType":"article","entryTags":{"title":"Managing Complex Business Services in Heterogeneous eBusiness Ecosystems - Aspect-based Research Assessment ","journal":"Procedia Computer Science ","volume":"10","number":"","pages":"128 - 135","year":"2012","note":"\\{ANT\\} 2012 and MobiWIS 2012 ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2012.06.020","url":"http://www.sciencedirect.com/science/article/pii/S1877050912003778","author":"O. Urikova and I. Ivanochko and N. Kryvinska and P. Zinterhof and C. Strauss","keywords":["Heterogeneous eBusiness","Service Level Agreements","Service Level Management","SOA","Web Services Distributed Management "],"abstract":"The distinctive feature of eBusiness applications is their complexity due to the large number of factors that have to be taken into consideration and aligned with regard to the products and services offered. Besides, the rapid adoption of eBusiness has resulted in an ever-increasing set of complex applications and \\{IT\\} infrastructure components to be managed. Thus, in this paper, we address the substances specific for the complex service management and identify some possible problem areas arising from contractual agreements between involved parties as well as from the directions of where service management is heading nowadays. Initially we examine what may be perceived as heterogeneous and agile eBusiness. We perform an aspect-based analysis of researched scientific literature: a detailed assessment of various definitions, requirements and other facets specific to the dynamic nature of service management in heterogeneous e-Business environment. Furthermore, we evaluate business-driven against conventional approaches to design SLAs; finally we examine various service management models giving priority to on \\{SOA\\} architecture. "}},{"citationKey":"Lee20124908","entryType":"article","entryTags":{"title":"Context-prediction performance by a dynamic Bayesian network: Emphasis on location prediction in ubiquitous decision support environment ","journal":"Expert Systems with Applications ","volume":"39","number":"5","pages":"4908 - 4914","year":"2012","note":"","issn":"0957-4174","doi":"http://dx.doi.org/10.1016/j.eswa.2011.10.026","url":"http://www.sciencedirect.com/science/article/pii/S0957417411015119","author":"Sunyoung Lee and Kun Chang Lee","keywords":["Dynamic Bayesian networks","Context prediction","Ubiquitous computing","Ubiquitous decision support system","Bayesian network","Naive Bayesian network","Tree augmented naive Bayesian network "],"abstract":"Ubiquitous decision support systems require more intelligent mechanism in which more timely and accurate decision support is available. However, conventional context-aware systems, which have been popular in the ubiquitous decision support systems field, cannot provide such agile and proactive decision support. To fill this research void, this paper proposes a new concept of context prediction mechanism by which the ubiquitous decision support devices are able to predict users' future contexts in advance, and provide more timely and proactive decision support that users would be satisfied much more. Especially, location prediction is useful because ubiquitous decision support systems could dynamically adapt their decision support contents for a user based on a user's future location. In this sense, as an alternative for the inference engine mechanism to be used in the ubiquitous decision support systems capable of context-prediction, we propose an inductive approach to recognizing a user's location by learning a dynamic Bayesian network model. The dynamic Bayesian network model has been evaluated with a set of contextual data from undergraduate students. The evaluation result suggests that a dynamic Bayesian network model offers significant predictive power in the location prediction. Besides, we found that the dynamic Bayesian network model has a great potential for the future types of ubiquitous decision support systems. "}},{"citationKey":"Germani2012793","entryType":"article","entryTags":{"title":"An approach to assessing virtual environments for synchronous and remote collaborative design ","journal":"Advanced Engineering Informatics ","volume":"26","number":"4","pages":"793 - 813","year":"2012","note":"EG-ICE 2011 + SI: Modern Concurrent Engineering ","issn":"1474-0346","doi":"http://dx.doi.org/10.1016/j.aei.2012.06.003","url":"http://www.sciencedirect.com/science/article/pii/S1474034612000560","author":"Michele Germani and Maura Mengoni and Margherita Peruzzini","keywords":["Collaborative design","Virtual environments","Metrics","Design review","Benchmarking method "],"abstract":"This paper considers applying novel Virtual Environments (VEs) in collaborative product design, focusing on reviewing activities. Companies are usually anchored to commercial \\{ICT\\} tools, which are mature and reliable. However, two main problems emerge: the difficulty in selecting the most suitable tools for specific purposes and the complexity in evaluating the impact that using technology has on design collaboration. The present work aims to face both aspects by proposing a structured benchmarking method based on expert judgements and defining a set of benchmarking weights based on experimental tests. The method considers both human-human interaction and teamwork-related aspects. A subsequent evaluation protocol considering both process efficiency and human-human interaction allows a closed-loop verification process. Pilot projects evaluate different technologies, and the benchmarking weights are verified and adjusted for more reliable system assessment. This paper focuses on synchronous and remote design review activities: three different tools have been compared according to expert judgements. The two best performing tools have been implemented as pilot projects within real industrial chains. Design collaboration has been assessed by considering both process performance and human-human interaction quality, as well as benchmarking results validated by indicating some corrective actions. The final benchmarking weights can thus be further adopted for an agile system benchmark in synchronous and remote design. The main findings suggest defining both an innovative process to verify the expert benchmark reliability and a trusty benchmarking method to evaluate tools for synchronous and remote design without experimental testing. Furthermore, the proposed method has a general validity and can be properly set for different collaborative dimensions. "}},{"citationKey":"Ashurst2012326","entryType":"article","entryTags":{"title":"Exploring IT-enabled innovation: A new paradigm? ","journal":"International Journal of Information Management ","volume":"32","number":"4","pages":"326 - 336","year":"2012","note":"","issn":"0268-4012","doi":"http://dx.doi.org/10.1016/j.ijinfomgt.2012.05.006","url":"http://www.sciencedirect.com/science/article/pii/S0268401212000692","author":"Colin Ashurst and Alison Freer and Jessica Ekdahl and Chris Gibbons","keywords":["Innovation","Practices","Benefits management","Innovation capability","Paradigm "],"abstract":"Innovation is a major strategic issue for many organizations. This paper reports on findings from 10 case studies of successful IT-enabled innovation covering a wide range of organizations and projects. They were carried out as an exploratory study to identify practices that contribute to innovation and specifically consider the implications of a focus on innovation for earlier work on benefits-led approaches to IT. The research identifies a number of practices from benefits-led approaches to \\{IT\\} that contribute to IT-enabled innovation. There is also evidence of organizations developing a new practice of ideation drawing on 'crowd sourcing' and exploiting social media technologies. Existing principles and practices for benefits realization can contribute to innovation, but the practices have to be applied in different ways according to the context. The overall conclusion emerging from the detailed analysis is that a focus on IT-enabled business innovation represents a new paradigm in terms of the mindset and approach involved. It amounts to a third \\{IT\\} paradigm, different from previous paradigms of technology implementation and a planned approach to benefits realization. Further work is required to explore this paradigm and how organizations can make the 'paradigm shift' required. "}},{"citationKey":"MossMorris2012415","entryType":"article","entryTags":{"title":"A pilot randomised controlled trial of an Internet-based cognitive behavioural therapy self-management programme (MS Invigor8) for multiple sclerosis fatigue ","journal":"Behaviour Research and Therapy ","volume":"50","number":"6","pages":"415 - 421","year":"2012","note":"","issn":"0005-7967","doi":"http://dx.doi.org/10.1016/j.brat.2012.03.001","url":"http://www.sciencedirect.com/science/article/pii/S0005796712000514","author":"Rona Moss-Morris and Paul McCrone and Lucy Yardley and Kirsten van Kessel and Gary Wills and Laura Dennison","keywords":["Multiple sclerosis","Fatigue","Cognitive behavioural therapy (CBT)","Internet-based","Self-management "],"abstract":"The majority of people affected by Multiple Sclerosis (paMS) experience severe and disabling fatigue. A recent randomised controlled trial (RCT) showed that cognitive behaviour therapy with a clinical psychologist was an effective treatment for \\{MS\\} fatigue. An Internet-based version of this intervention, \\{MS\\} Invigor8, was developed for the current study using agile design and input from paMS. \\{MS\\} Invigor8 includes eight tailored, interactive sessions. The aim was to test the feasibility and potential efficacy and cost-effectiveness of the programme in a pilot RCT. 40 patients were randomised to \\{MS\\} Invigor8 (n = 23) or standard care (n = 17). The \\{MS\\} Invigor8 group accessed sessions over 8-10 weeks and received up to three 30-60 min telephone support sessions. Participants completed online standardised questionnaires assessing fatigue, mood, quality of life and service use at baseline and 10 weeks follow-up. Large between group treatment effects were found for the primary outcomes of fatigue severity (d = 1.19) and impact (d = 1.02). The \\{MS\\} Invigor8 group also reported significantly greater improvements in anxiety, depression and quality-adjusted life years. These data suggest that Internet-based \\{CBT\\} may be a clinically and cost-effective treatment for \\{MS\\} fatigue. A larger \\{RCT\\} with longer term follow-up is warranted. "}},{"citationKey":"Li2012439","entryType":"article","entryTags":{"title":"Training-dependent cognitive advantage is suppressed at high altitude ","journal":"Physiology & Behavior ","volume":"106","number":"4","pages":"439 - 445","year":"2012","note":"","issn":"0031-9384","doi":"http://dx.doi.org/10.1016/j.physbeh.2012.03.002","url":"http://www.sciencedirect.com/science/article/pii/S0031938412000959","author":"Peng Li and Gang Zhang and Hai-yan You and Ran Zheng and Yu-qi Gao","keywords":["High altitude","Cognitive function","Cognitive training","Neural plasticity","Hypoxia "],"abstract":"Ascent to high altitude is associated with decreases in cognitive function and work performance as a result of hypoxia. Some workers with special jobs typically undergo intensive mental training because they are expected to be agile, stable and error-free in their job performance. The purpose of this study was to determine the risk to cognitive function acquired from training following hypoxic exposure. The results of \\{WHO\\} neurobehavioral core tests battery (WHO-NCTB) and Raven's standard progressive matrices (RSPM) tests of a group of 54 highly trained military operators were compared with those of 51 non-trained ordinary people and were investigated at sea level and on the fifth day after arrival at high altitudes (3900 m). Meanwhile, the plasma levels of brain-derived neurotrophic factor (BDNF), interleukin 1v (IL-1v) and vascular endothelial growth factor (VEGF) were examined. The result showed that at sea level, the trained group exhibited significantly better performance on neurobehavioral and \\{RSPM\\} tests. At high altitude, both groups had decreased accuracy in most cognitive tests and took longer to finish them. More importantly, the highly trained subjects showed more substantial declines than the non-trained subjects in visual reaction accuracy, auditory reaction speed, digit symbol scores, ability to report correct dots in a pursuit aiming test and total \\{RSPM\\} scores. This means that the training-dependent cognitive advantages in these areas were suppressed at high altitudes. The above phenomenon maybe associated with decreased \\{BDNF\\} and elevated inflammatory factor during hypoxia, and other mechanisms could not be excluded. "}},{"citationKey":"Gong2012S61","entryType":"article","entryTags":{"title":"From policy implementation to business process management: Principles for creating flexibility and agility ","journal":"Government Information Quarterly ","volume":"29, Supplement 1","number":"","pages":"S61 - S71","year":"2012","note":"Government Information Networks ","issn":"0740-624X","doi":"http://dx.doi.org/10.1016/j.giq.2011.08.004","url":"http://www.sciencedirect.com/science/article/pii/S0740624X11000700","author":"Yiwei Gong and Marijn Janssen","keywords":["Flexibility","Agility","Business process management","Business services","Service orientation","Policy-making","Compliance "],"abstract":"Organizations are required to comply with changes in legislation and policy. Yet the implementation of new legislation is often expensive, can have long lead times and is prone to failure. The existing situation significantly constrains policy-making. To improve this, policy makers and policy executors are searching for ways to achieve higher levels of flexibility and agility in their business process management systems. Flexibility is the ability to react to changes and agility is the speed in responding to variety and change. Both flexibility and agility are multi-dimensional concepts. This paper presents principles for creating flexibility and agility when implementing new or revised policies into business processes. These principles include: 1) defining and using business services, 2) integrating and orchestrating business services through the use of events, 3) separating process, knowledge and resources and 4) implementing policy in an integrated manner. Business services are components encapsulating business functions and having clear responsibilities and accountabilities. The case study shows that these forms of flexibility and agility can help to implement policies more quickly and cost effectively. An organization's resources and level of flexibility and agility determines what laws can be implemented within a certain time. The improvement of flexibility and agility requires innovations on all levels: infrastructure, business process and organization. The level of flexibility and agility should always be measured by a combination of measures. We make plea for instruments assessing the impact of policies on organizations prior to implementation. "}},{"citationKey":"Casalino2012176","entryType":"article","entryTags":{"title":"A Task Priority and Dynamic Programming Based Approach to Agile Underwater Floating Manipulation ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"45","number":"27","pages":"176 - 181","year":"2012","note":"9th \\{IFAC\\} Conference on Manoeuvring and Control of Marine Craft ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20120919-3-IT-2046.00030","url":"http://www.sciencedirect.com/science/article/pii/S1474667016312241","author":"G. Casalino and E. Zereik and E. Simetti and S. Torelli and A. Sperinde and A. Turetta","keywords":["Floating manipulation","Underwater robotics","Coordination strategy","Dynamic programming","Priority subsystems and tasks "],"abstract":"Abstract The present paper deals with a specific part of the activities performed within the currently on going EU-FP7 funded project \\{TRIDENT\\} (http://www.irs.uji.es/trident), whose objectives include the development of a multipurpose Intervention Autonomous Underwater Vehicle (I-AUV) exhibiting smart manipulation capabilities within unstructured underwater environments. The considered activities are those developed within \\{WP\\} 5 of the project, aiming to design the functional and algorithmic real-time control architecture (and the relative real-time control software) in charge of coordinating both vehicle and arm motions in a concurrent way; this is done to improve the overall performances via the system agility obtained by reducing at most the need for separate sequential motions, while also guaranteeing the fulfilment of all the enabling and safety system conditions. "}},{"citationKey":"Minguez2012319","entryType":"article","entryTags":{"title":"A reference architecture for agile product-service systems ","journal":"\\{CIRP\\} Journal of Manufacturing Science and Technology ","volume":"5","number":"4","pages":"319 - 327","year":"2012","note":"Special issue from 44th \\{CIRP\\} Conference on Manufacturing Systems ","issn":"1755-5817","doi":"http://dx.doi.org/10.1016/j.cirpj.2012.09.007","url":"http://www.sciencedirect.com/science/article/pii/S1755581712000600","author":"J. Minguez and D. Baureis and D. Neumann","keywords":["Service","Integration","Service-oriented architecture (SOA)","Product-service system (PSS)","Industrial product-service systems (IPS2)","Agility "],"abstract":"In times of globalization and saturated markets, manufacturing companies are forced to find new possibilities of differentiation against competitors. Product-service systems (PSS) are a strategic approach that offers this possibility by integrating goods and services. The implementation of a \\{PSS\\} entails challenges for the resulting supply chain structure and the \\{IT\\} infrastructure supporting coordinated service offerings, such as conflicting goals and coordination in the integrated business processes. The service-oriented architecture (SOA) paradigm, based on loosely coupled components, provides rapid reconfiguration of business processes, rapid integration of services and goal definition through service level agreements. This paper presents a reference architecture based on \\{SOA\\} to support coordination and definition of goals in heterogeneous supply chains. "}}]