[{"citationKey":"Fontana2014140","entryType":"article","entryTags":{"title":"Processes versus people: How should agile software development maturity be defined? ","journal":"Journal of Systems and Software ","volume":"97","number":"","pages":"140 - 155","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2014.07.030","url":"http://www.sciencedirect.com/science/article/pii/S0164121214001587","author":"Rafaela Mantovani Fontana and Isabela Mantovani Fontana and Paula Andrea da Rosa Garbuio and Sheila Reinehr and Andreia Malucelli","keywords":["Maturity","Agile software development","Software process improvement "],"abstract":"Abstract Maturity in software development is currently defined by models such as CMMI-DEV and ISO/IEC 15504, which emphasize the need to manage, establish, measure and optimize processes. Teams that develop software using these models are guided by defined, detailed processes. However, an increasing number of teams have been implementing agile software development methods that focus on people rather than processes. What, then, is maturity for these agile teams that focus less on detailed, defined processes? This is the question we sought to answer in this study. To this end, we asked agile practitioners about their perception of the maturity level of a number of practices and how they defined maturity in agile software development. We used cluster analysis to analyze quantitative data and triangulated the results with content analysis of the qualitative data. We then proposed a new definition for agile software development maturity. The findings show that practitioners do not see maturity in agile software development as process definition or quantitative management capabilities. Rather, agile maturity means fostering more subjective capabilities, such as collaboration, communication, commitment, care, sharing and self-organization. "}},{"citationKey":"Yu2014911","entryType":"article","entryTags":{"title":"Understanding agile software development practices using shared mental models theory ","journal":"Information and Software Technology ","volume":"56","number":"8","pages":"911 - 921","year":"2014","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2014.02.010","url":"http://www.sciencedirect.com/science/article/pii/S0950584914000524","author":"Xiaodan Yu and Stacie Petter","keywords":["Agile software development","Agile practices","Shared mental models theory","Extreme programming","Scrum "],"abstract":"AbstractContext Agile software development is an alternative software development methodology that originated from practice to encourage collaboration between developers and users, to leverage rapid development cycles, and to respond to changes in a dynamic environment. Although agile practices are widely used in organizations, academics call for more theoretical research to understand the value of agile software development methodologies. Objective This study uses shared mental models theory as a lens to examine practices from agile software methodologies to understand how agile practices enable software development teams to work together to complete tasks and work together effectively as a team. Method A conceptual analysis of specific agile practices was conducted using the lens of shared mental models theory. Three agile practices from Xtreme Programming and Scrum are examined in detail, system metaphor, stand-up meeting, and on-site customer, using shared mental models theory. Results Examining agile practices using shared mental models theory elucidates how agile practices improve collaboration during the software development process. The results explain how agile practices contribute toward a shared understanding and enhanced collaboration within the software development team. Conclusions This conceptual analysis demonstrates the value of agile practices in developing shared mental models (i.e. shared understanding) among developers and customers in software development teams. Some agile practices are useful in developing a shared understanding about the tasks to be completed, while other agile practices create shared mental models about team processes and team interactions. To elicit the desired outcomes of agile software development methods, software development teams should consider whether or not agile practices are used in a manner that enhances the team's shared understanding. Using three specific agile practices as examples, this research demonstrates how theory, such as shared mental models theory, can enhance our understanding regarding how agile practices are useful in enhancing collaboration in the workplace. "}},{"citationKey":"Tessem2014873","entryType":"article","entryTags":{"title":"Individual empowerment of agile and non-agile software developers in small teams ","journal":"Information and Software Technology ","volume":"56","number":"8","pages":"873 - 889","year":"2014","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2014.02.005","url":"http://www.sciencedirect.com/science/article/pii/S0950584914000470","author":"Bjornar Tessem","keywords":["Software development","Agile methods","Empowerment "],"abstract":"AbstractContext Empowerment of employees at work has been known to have a positive impact on job motivation and satisfaction. Software development is a field of knowledge work wherein one should also expect to see these effects, and the idea of empowerment has become particularly visible in agile methodologies, in which proponents emphasise team empowerment and individual control of the work activities as a central concern. Objective This research aims to get a better understanding of how empowerment is enabled in software development teams, both agile and non-agile, to identify differences in empowering practices and levels of individual empowerment. Method Twenty-five interviews with agile and non-agile developers from Norway and Canada on decision making and empowerment are analysed. The analysis is conducted using a conceptual model with categories for involvement, structural empowerment and psychological empowerment. Results Both kinds of development organisations are highly empowered and they are similar in most aspects relating to empowerment. However, there is a distinction in the sense that agile developers have more possibilities to select work tasks and influence the priorities in a development project due to team empowerment. Agile developers seem to put a higher emphasis on the value of information in decision making, and have more prescribed activities to enable low-cost information flow. More power is obtained through the achievement of managing roles for the non-agile developers who show interest and are rich in initiatives. Conclusion Agile developers have a higher sense of being able to impact the organisation than non-agile developers and have information channels that is significantly differently from non-agile developers. For non-agile teams, higher empowerment can be obtained by systematically applying low-cost participative decision making practices in the manager-developer relation and among peer developers. For agile teams, it is essential to more rigorously follow the empowering practices already established. "}},{"citationKey":"Chuang201484","entryType":"article","entryTags":{"title":"Assessment of institutions, scholars, and contributions on agile software development (2001-2012) ","journal":"Journal of Systems and Software ","volume":"93","number":"","pages":"84 - 101","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2014.03.006","url":"http://www.sciencedirect.com/science/article/pii/S0164121214000697","author":"Sun-Wen Chuang and Tainyi Luor and Hsi-Peng Lu","keywords":["Agile software development","Research productivity","Literature assessment "],"abstract":"Abstract The number of scholarly publications on agile software development has grown significantly in recent years. Several researchers reviewed and attempted to synthesize studies on agile software development. However, no work has ranked the contributions of scholars and institutions to publications using a thorough process. This study presents findings on top publications, institutions, and scholars in the agile software development field from 2001 to 2012 based on the publication of such works in Science Citation Index journals. This paper highlights the key outlets for agile research and summarizes the most influential researchers and institutions as well as the most studied research areas. This study concludes by providing directions for future research. "}},{"citationKey":"Korkala2014122","entryType":"article","entryTags":{"title":"Waste identification as the means for improving communication in globally distributed agile software development ","journal":"Journal of Systems and Software ","volume":"95","number":"","pages":"122 - 140","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2014.03.080","url":"http://www.sciencedirect.com/science/article/pii/S0164121214001009","author":"Mikko Korkala and Frank Maurer","keywords":["Distributed agile software development","Lean software development","Communication "],"abstract":"Abstract Agile approaches highly values communication between team members to improve software development processes, even though, communication in globally distributed agile teams can be difficult. Literature proposes solutions for mitigating the challenges encountered in these environments. These solutions range from general-level recommendations and practices to the use of communication tools. However, an approach covering the whole development process for identifying challenges, and improving communication in globally distributed agile development projects, is missing. In order to address this, we conducted a case study within a globally distributed agile software development project focused on using the concept of waste as a lens for identifying non-value producing communication elements. In order to achieve this, we constructed a waste identification approach through which we identified five communication wastes, and solutions to mitigate them. These wastes can help companies identify communication issues that are present in their development efforts, while the presented waste identification technique gives them a mechanism for waste identification and mitigation. This work contributes to the scientific community by increasing the knowledge about communication in globally distributed agile development efforts. "}},{"citationKey":"Paasivaara20141556","entryType":"article","entryTags":{"title":"Communities of practice in a large distributed agile software development organization - Case Ericsson ","journal":"Information and Software Technology ","volume":"56","number":"12","pages":"1556 - 1577","year":"2014","note":"Special issue: Human Factors in Software Development ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2014.06.008","url":"http://www.sciencedirect.com/science/article/pii/S0950584914001475","author":"Maria Paasivaara and Casper Lassenius","keywords":["Communities of practice","Large-scale agile software development","Scaling agile "],"abstract":"AbstractContext Communities of practice--groups of experts who share a common interest or topic and collectively want to deepen their knowledge--can be an important part of a successful lean and agile adoption in particular in large organizations. Objective In this paper, we present a study on how a large organization within Ericsson with 400 persons in 40 Scrum teams at three sites adopted the use of Communities of Practice (CoP) as part of their transformation from a traditional plan-driven organization to lean and agile. Methods We collected data by 52 semi-structured interviews on two sites, and longitudinal non-participant observation of the transformation during over 20 site visits over a period of two years. Results The organization had over 20 CoPs, gathering weekly, bi-weekly or on a need basis. CoPs had several purposes including knowledge sharing and learning, coordination, technical work, and organizational development. Examples of CoPs include Feature Coordination CoPs to coordinate between teams working on the same feature, a Coaching CoP to discuss agile implementation challenges and successes and to help lead the organizational continuous improvement, an end-to-end CoP to remove bottlenecks from the flow, and Developers CoPs to share good development practices. Success factors of well-functioning CoPs include having a good topic, passionate leader, proper agenda, decision making authority, open community, supporting tools, suitable rhythm, and cross-site participation when needed. Organizational support include creating a supportive atmosphere and providing a suitable infrastructure for CoPs. Conclusions In the case organization, CoPs were initially used to support the agile transformation, and as part of the distributed Scrum implementation. As the transformation progressed, the CoPs also took on the role of supporting continuous organizational improvements. CoPs became a central mechanism behind the success of the large-scale agile implementation in the case organization that helped mitigate some of the most pressing problems of the agile transformation. "}},{"citationKey":"MitreHernandezHugo2014403","entryType":"article","entryTags":{"title":"Estimacion y control de costos en metodos agiles para desarrollo de software: un caso de estudio ","journal":"Ingenieria, Investigacion y Tecnologia ","volume":"15","number":"3","pages":"403 - 418","year":"2014","note":"","issn":"1405-7743","doi":"http://dx.doi.org/10.1016/S1405-7743(14)70350-6","url":"http://www.sciencedirect.com/science/article/pii/S1405774314703506","author":"A. Mitre-Hernandez Hugo and Ortega-Martinez Edgar and Lemus-Olalde Cuauhtemoc","keywords":["gestion del software","gestion de costos","metodos agiles","desarrollo de software agil","SaaS","software management","cost management","agile methods","agile software development","SaaS "],"abstract":"Resumen El desarrollo de software utilizando metodos agiles esta en crecimiento debido a la productividad asociada a estas metodologias, ademas de la flexibilidad demostrada para equipos pequenos. Sin embargo, estas metodologias cuentan con debilidades claras de estimacion y gestion de costos de desarrollo, al igual que los administradores de proyectos no cuentan con las suficientes evidencias para la comprobacion del gasto del presupuesto en un proyecto debido a la poca documentacion generada y por la falta de seguimiento en el gasto de los recursos. Se presenta una propuesta de estimacion y control de costos en metodos agiles para resolver estas carencias. En este sentido, se realizo un caso de estudio en una empresa de desarrollo de software agil utilizando la propuesta en proyectos de software de servicio (SaaS) y aplicaciones Web. En los resultados se encontro que la propuesta genera un alto grado de evidencias para los administradores de proyectos, pero presenta carencias en la administracion de las evidencias para el control y toma de decisiones, lo cual dio origen a una definicion de un proceso de toma de decisiones para ser aunado a la propuesta de medicion. "}},{"citationKey":"Bermejo2014718","entryType":"article","entryTags":{"title":"Agile Principles and Achievement of Success in Software Development: A Quantitative Study in Brazilian Organizations ","journal":"Procedia Technology ","volume":"16","number":"","pages":"718 - 727","year":"2014","note":"\\{CENTERIS\\} 2014 - Conference on \\{ENTERprise\\} Information Systems / ProjMAN 2014 - International Conference on Project \\{MANagement\\} / \\{HCIST\\} 2014 - International Conference on Health and Social Care Information Systems and Technologies ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2014.10.021","url":"http://www.sciencedirect.com/science/article/pii/S2212017314002485","author":"Paulo Henrique de Souza Bermejo and Andre Luiz Zambalde and Adriano Olimpio Tonelli and Samara Alyne Souza and Larissa Avelino Zuppo and Priscila Luiz Rosa","keywords":["Agile methodologies","Agile principles","Success in software","Software development","Information systems management. "],"abstract":"Abstract The principles of agile development emerge as potential solutions to numerous design problems of software development. In this context, this paper aims to identify and analyze the profile of Brazilian software producers regarding the use of agile principles and their potential to achieve success in producing software. This is a quantitative study made with professionals from the software industry. Data were collected through structured questionnaires and analyzed using technical descriptive analysis, factor analysis and cluster analysis. Based on the categorization of factors, three software organizations profiles have been obtained regarding the use of agile principles and the scope of success in producing software. The implications of this study are that organizations with the highest success rates in software are the same as those that have higher rates for capacity in terms of team, culture, communication with the client, environmental configuration and relationships with external partners. Organizations that used agile software development principles achieved success in software development, but it cannot be said that the use of agile principles alone can guarantee the achievement of such success in software development. Additionally, relationships with external partners, although not contemplated in the related studies investigated, was shown to be a critical factor for success in software development and, therefore, relevant to the agile software development field. In conclusion, this study is relevant because it helps to improve our understanding of the use of agile principles in the development of software and whether these principles are associated with obtaining success in software production; therefore, it explores a new factor that has not been observed previously. "}},{"citationKey":"daSilva2014189","entryType":"article","entryTags":{"title":"Software product line scoping and requirements engineering in a small and medium-sized enterprise: An industrial case study ","journal":"Journal of Systems and Software ","volume":"88","number":"","pages":"189 - 206","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2013.10.040","url":"http://www.sciencedirect.com/science/article/pii/S0164121213002598","author":"Ivonei Freitas da Silva and Paulo Anselmo da Mota Silveira Neto and Padraig O'Leary and Eduardo Santana de Almeida and Silvio Romero de Lemos Meira","keywords":["Requirements engineering","Agile methods","Software product line scoping "],"abstract":"Abstract Software product line (SPL) engineering has been applied in several domains, especially in large-scale software development. Given the benefits experienced and reported, \\{SPL\\} engineering has increasingly garnered interest from small to medium-sized companies. It is possible to find a wide range of studies reporting on the challenges of running a \\{SPL\\} project in large companies. However, very little reports exist that consider the situation for small to medium-sized enterprises and these studies try develop universal truths for \\{SPL\\} without lessons learned from empirical evidence need to be contextualized. This study is a step towards bridging this gap in contextual evidence by characterizing the weaknesses discovered in the scoping (SC) and requirements (RE) disciplines of SPL. Moreover, in this study we conducted a case study in a small to medium sized enterprises (SMEs) to justify the use of agile methods when introducing the \\{SPL\\} \\{SC\\} and \\{RE\\} disciplines through the characterization of their bottlenecks. The results of the characterization indicated that ineffective communication and collaboration, long iteration cycles, and the absence of adaptability and flexibility can increase the effort and reduce motivation during project development. These issues can be mitigated by agile methods. "}},{"citationKey":"Domann2014928","entryType":"article","entryTags":{"title":"An Agile Method for Multiagent Software Engineering ","journal":"Procedia Computer Science ","volume":"32","number":"","pages":"928 - 934","year":"2014","note":"The 5th International Conference on Ambient Systems, Networks and Technologies (ANT-2014), the 4th International Conference on Sustainable Energy Information Technology (SEIT-2014) ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.05.513","url":"http://www.sciencedirect.com/science/article/pii/S1877050914007133","author":"Jaschar Domann and Sindy Hartmann and Michael Burkhardt and Alexander Barge and Sahin Albayrak","keywords":["Organization","AOSE","Multi projects","Multiagent systems","agile","software engineering methodologies "],"abstract":"Abstract The benefit of using software development methods should be a gain in regularity and clarity in software projects. Classical approaches are designed for medium to big team size with a distinctly separated and static role description combined with a top down development process. Agile methods mainly focus on small teams with low budget project size, and a fixed deadline with a bottom up development process. In this paper we present a combined approach for projects with multiple small teams growing together to a medium size project with a hard deadline and low budget - called Agile Methodology for Intelligent Agents Componentware (aMIAC). The approach will be introduced and applied within a case study. "}},{"citationKey":"Day2014332","entryType":"article","entryTags":{"title":"n-Tiered Test Automation Architecture for Agile Software Systems ","journal":"Procedia Computer Science ","volume":"28","number":"","pages":"332 - 339","year":"2014","note":"2014 Conference on Systems Engineering Research ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.03.041","url":"http://www.sciencedirect.com/science/article/pii/S1877050914001045","author":"Patrick Day","keywords":["Software Engineering","Testing","Test Automation","Architecture","Agile Systems "],"abstract":"Abstract This paper introduces a multi-tiered test automation architecture to optimize test automation in an Agile software development environment while increasing both the test coverage and depth of each tier. Test Automation is the act of converting manual test cases into automated scripts that can be executed autonomously. In general, testing accounts for roughly 60% of the overall development budget and approximately 50% of that is attributed to regression testing. In recent years software organizations have begun migrating to Agile software development practices and automated testing in hopes of reducing the cost, lengthy regression cycles, and time to market. Traditionally, test automation is conducted on stable, non-changing applications. In an Agile environment where the code constantly changes, automated test cases become obsolete and must constantly be refactored in order to provide meaningful feedback about the system's quality. In most instances the cost of maintenance of automated test code completely overshadows the entire automation effort and negates any possible Return on Investment (RoI). An n-Tiered Test Automation Architecture seeks to retain the RoI by abstracting the automation project into separate distinct tiers; Presentation, Business, Data, and Services. These abstractions allow automated testing to continue providing feedback despite the constant revision of the system. A case study was conducted using this method and the observations showed that the automation architecture was resilient to change while increasing the test coverage, the depth of testing, and the overall quality of the application under test. "}},{"citationKey":"Firdaus2014546","entryType":"article","entryTags":{"title":"Secure Feature Driven Development (SFDD) Model for Secure Software Development ","journal":"Procedia - Social and Behavioral Sciences ","volume":"129","number":"","pages":"546 - 553","year":"2014","note":"2nd International Conference on Innovation, Management and Technology Research ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.03.712","url":"http://www.sciencedirect.com/science/article/pii/S1877042814028948","author":"Adila Firdaus and Imran Ghani and Seung Ryul Jeong","keywords":["Agile Methodology","Security","Software Engineering","Feature Driven Development "],"abstract":"Abstract This paper introduces an enhanced Feature Driven Development (FDD) model for secure software development. In fact, the enhanced model is based on our previous study and its findings which concluded that existing \\{FDD\\} poses limitations to develop secure software. Thus, an enhanced \\{FDD\\} that supports secure software development is proposed. We have implemented this new \\{FDD\\} model and conducted a case study to compare the level of security in the undergraduate and postgraduate level students. The paper illustrates that agility of \\{FDD\\} is not affected significantly, even after adding new phases. "}},{"citationKey":"Boschetti2014116","entryType":"article","entryTags":{"title":"A Lagrangian heuristic for sprint planning in agile software development ","journal":"Computers & Operations Research ","volume":"43","number":"","pages":"116 - 128","year":"2014","note":"","issn":"0305-0548","doi":"http://dx.doi.org/10.1016/j.cor.2013.09.007","url":"http://www.sciencedirect.com/science/article/pii/S0305054813002657","author":"Marco A. Boschetti and Matteo Golfarelli and Stefano Rizzi and Elisa Turricchia","keywords":["Mixed integer linear programming","Software engineering","Agile methods","Optimization models","Matheuristics","Lagrangian heuristics "],"abstract":"Abstract Agile methods for software development promote iterative design and implementation. Most of them divide a project into functionalities, called user stories; at each iteration, often called a sprint, a subset of user stories are developed. The sprint planning phase is critical to ensure the project success, but it is also a difficult problem because several factors impact on the optimality of a sprint plan, e.g., the estimated complexity, business value, and affinity of the user stories to be included in each sprint. In this paper we present an approach for sprint planning based on an integer linear programming model. Given the estimates made by the project team and a set of development constraints, the optimal solution of the model is a sprint plan that maximizes the business value perceived by users. Solving to optimality the model by a general-purpose \\{MIP\\} solver, such as \\{IBM\\} Ilog Cplex, takes time and for some instances even finding a feasible solution requires too large computing times for an operational use. For this reason we propose an effective Lagrangian heuristic based on a relaxation of the proposed model and some greedy and exchange algorithms. Computational results on both real and synthetic projects show the effectiveness of the proposed approach. "}},{"citationKey":"Stahl201448","entryType":"article","entryTags":{"title":"Modeling continuous integration practice differences in industry software development ","journal":"Journal of Systems and Software ","volume":"87","number":"","pages":"48 - 59","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2013.08.032","url":"http://www.sciencedirect.com/science/article/pii/S0164121213002276","author":"Daniel Stahl and Jan Bosch","keywords":["Continuous integration","Agile software development "],"abstract":"Abstract Continuous integration is a software practice where developers integrate frequently, at least daily. While this is an ostensibly simple concept, it does leave ample room for interpretation: what is it the developers integrate with, what happens when they do, and what happens before they do? These are all open questions with regards to the details of how one implements the practice of continuous integration, and it is conceivable that not all such implementations in the industry are alike. In this paper we show through a literature review that there are differences in how the practice of continuous integration is interpreted and implemented from case to case. Based on these findings we propose a descriptive model for documenting and thereby better understanding implementations of the continuous integration practice and their differences. The application of the model to an industry software development project is then described in an illustrative case study. "}},{"citationKey":"Lehtinen2014408","entryType":"article","entryTags":{"title":"A tool supporting root cause analysis for synchronous retrospectives in distributed software teams ","journal":"Information and Software Technology ","volume":"56","number":"4","pages":"408 - 437","year":"2014","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2014.01.004","url":"http://www.sciencedirect.com/science/article/pii/S0950584914000159","author":"Timo O.A. Lehtinen and Risto Virtanen and Juha O. Viljanen and Mika V. Mantyla and Casper Lassenius","keywords":["ARCA-tool","Root cause analysis","Distributed retrospective","Global software engineering "],"abstract":"AbstractContext Root cause analysis (RCA) is a useful practice for software project retrospectives, and is typically carried out in synchronous collocated face-to-face meetings. Conducting \\{RCA\\} with distributed teams is challenging, as face-to-face meetings are infeasible. Lack of adequate real-time tool support exacerbates this problem. Furthermore, there are no empirical studies on using \\{RCA\\} in synchronous retrospectives of geographically distributed teams. Objective This paper presents a real-time cloud-based software tool (ARCA-tool) we developed to support \\{RCA\\} in distributed teams and its initial empirical evaluation. The feasibility of using \\{RCA\\} with distributed teams is also evaluated. Method We compared our tool with 35 existing \\{RCA\\} software tools. We conducted field studies of four distributed agile software teams at two international software product companies. The teams conducted \\{RCA\\} collaboratively in synchronous retrospective meetings by using the tool we developed. We collected the data using observations, interviews and questionnaires. Results Comparison revealed that none of the existing 35 tools matched all the features of our ARCA-tool. The team members found ARCA-tool to be an essential part of their distributed retrospectives. They considered the software as efficient and very easy to learn and use. Additionally, the team members perceived \\{RCA\\} to be a vital part of the retrospectives. In contrast to the prior retrospective practices of the teams, the introduced \\{RCA\\} method was evaluated as efficient and easy to use. Conclusion \\{RCA\\} is a useful practice in synchronous distributed retrospectives. However, it requires software tool support for enabling real-time view and co-creation of a cause-effect diagram. ARCA-tool supports synchronous RCA, and includes support for logging problems and causes, problem prioritization, cause-effect diagramming, and logging of process improvement proposals. It enables conducting \\{RCA\\} in distributed retrospectives. "}},{"citationKey":"Jalali2014172","entryType":"article","entryTags":{"title":"Investigating the applicability of Agility assessment surveys: A case study ","journal":"Journal of Systems and Software ","volume":"98","number":"","pages":"172 - 190","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2014.08.067","url":"http://www.sciencedirect.com/science/article/pii/S0164121214001927","author":"Samireh Jalali and Claes Wohlin and Lefteris Angelis","keywords":["Agile","Assessment","Survey "],"abstract":"AbstractContext Agile software development has become popular in the past decade without being sufficiently defined. The Agile principles can be instantiated differently which creates different perceptions of Agility. This has resulted in several frameworks being presented in the research literature to evaluate the level of Agility. However, the evidence of their actual use in practice is limited. Objective The objective is to identify online surveys that assess/profile Agility in practice, and to evaluate the surveys in an industrial setting. Method The Agility assessment surveys were identified through searching the web. Then, they were explored and two surveys were identified as most promising for our objective. The selected surveys were evaluated in a case study with three Agile teams in a software consultancy company. Results Each team and its customer separately judged the team's Agility. This outcome was compared with the two survey results in focus-group meetings, and finally one of the surveys was agreed to provide a more holistic assessment of Agility. Conclusions Different surveys may judge Agility differently, which supports the viewpoint that Agile is not well defined. Therefore, practitioners must decide what Agile means to them and select the assessment survey that matches their definition. "}},{"citationKey":"Scott201456","entryType":"article","entryTags":{"title":"Are learning styles useful indicators to discover how students use Scrum for the first time? ","journal":"Computers in Human Behavior ","volume":"36","number":"","pages":"56 - 64","year":"2014","note":"","issn":"0747-5632","doi":"http://dx.doi.org/10.1016/j.chb.2014.03.027","url":"http://www.sciencedirect.com/science/article/pii/S0747563214001496","author":"Ezequiel Scott and Guillermo Rodriguez and Alvaro Soria and Marcelo Campo","keywords":["Software Engineering","Agile software development","Software Engineering education","Learning styles "],"abstract":"Abstract Teaching agile practices is in the cutting-edge of Software Engineering education since agile methodologies are widely used in the industry. An effective strategy to teach agile practices is the use of a capstone project, in which students develop requirements following an agile methodology. To improve students' learning experience, professors have to keep track and analyze the information generated by the students during the capstone project development. The problem here arises from the large amount of information generated in the learning process, which hinders professors to meet each student's learning profile. Particularly, to know the students skills and preferences are key aspects on a learner-centered approach of education in order to personalize the teaching. In this work, we aim to discover the relationships between students' performance along a Scrum-based capstone project and their learning style according to the Felder-Silverman model, towards a first step to build the profiles. To address this issue, we mined association rules from the interaction of 33 Software Engineering students with Virtual Scrum, a tool that supports the development of the capstone project in the course. In the present work we describe promising results in experiments with a case-study. "}},{"citationKey":"DruryGrogan2014506","entryType":"article","entryTags":{"title":"Performance on agile teams: Relating iteration objectives and critical decisions to project management success factors ","journal":"Information and Software Technology ","volume":"56","number":"5","pages":"506 - 515","year":"2014","note":"Performance in Software Development ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2013.11.003","url":"http://www.sciencedirect.com/science/article/pii/S0950584913002176","author":"Meghann L. Drury-Grogan","keywords":["Team performance","Project management success factors","Iteration objectives","Team objectives","Agile software development "],"abstract":"AbstractContext While project management success factors have long been established via the golden triangle, little is known about how project iteration objectives and critical decisions relate to these success factors. It seems logical that teams' iteration objectives would reflect project management success factors, but this may not always be the case. If not, how are teams' objectives for iterations differing from the golden triangle of project management success factors? Objective This study identifies iteration objectives and the critical decisions that relate to the golden triangle of project management success factors in agile software development teams working in two-week iterations. Method The author conducted semi-structured interviews with members across three different agile software development teams using a hybrid of \\{XP\\} and Scrum agile methodologies. Iteration Planning and Retrospective meetings were also observed. Interview data was transcribed, coded and reviewed by the researcher and two independently trained research assistants. Data analysis involved organizing the data to identify iteration objectives and critical decisions to identify whether they relate to project management success factors. Results Agile teams discussed four categories of iteration objectives: Functionality, Schedule, Quality and Team Satisfaction. Two of these objectives map directly to two aspects of the golden triangle: schedule and quality. The agile teams' critical decisions were also examined to understand the types of decisions the teams would have made differently to ensure success, which resulted in four categories of such decisions: Quality, Dividing Work, Iteration Amendments and Team Satisfaction. Conclusion This research has contributed to the software development and project management literature by examining iteration objectives on agile teams and how they relate to the golden triangle of project management success factors to see whether these teams incorporate the golden triangle factors in their objectives and whether they include additional objectives in their iterations. What's more, this research identified four critical decisions related to the golden triangle. These findings provide important insight to the continuing effort to better assess project management success, particularly for agile teams. "}},{"citationKey":"Tarhan2014477","entryType":"article","entryTags":{"title":"Systematic analyses and comparison of development performance and product quality of Incremental Process and Agile Process ","journal":"Information and Software Technology ","volume":"56","number":"5","pages":"477 - 494","year":"2014","note":"Performance in Software Development ","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2013.12.002","url":"http://www.sciencedirect.com/science/article/pii/S0950584913002310","author":"Ayca Tarhan and Seda Gunes Yilmaz","keywords":["Empirical method","Quantitative analysis","Qualitative analysis","Software measurement","Process performance","Agile development "],"abstract":"AbstractContext Although Agile software development models have been widely used as a base for the software project life-cycle since 1990s, the number of studies that follow a sound empirical method and quantitatively reveal the effect of using these models over Traditional models is scarce. Objective This article explains the empirical method of and the results from systematic analyses and comparison of development performance and product quality of Incremental Process and Agile Process adapted in two projects of a middle-size, telecommunication software development company. The Incremental Process is an adaption of the Waterfall Model whereas the newly introduced Agile Process is a combination of the Unified Software Development Process, Extreme Programming, and Scrum. Method The method followed to perform the analyses and comparison is benefited from the combined use of qualitative and quantitative methods. It utilizes; \\{GQM\\} Approach to set measurement objectives, \\{CMMI\\} as the reference model to map the activities of the software development processes, and a pre-defined assessment approach to verify consistency of process executions and evaluate measure characteristics prior to quantitative analysis. Results The results of the comparison showed that the Agile Process had performed better than the Incremental Process in terms of productivity (79%), defect density (57%), defect resolution effort ratio (26%), Test Execution V&amp;V Effectiveness (21%), and effort prediction capability (4%). These results indicate that development performance and product quality achieved by following the Agile Process was superior to those achieved by following the Incremental Process in the projects compared. Conclusion The acts of measurement, analysis, and comparison enabled comprehensive review of the two development processes, and resulted in understanding their strengths and weaknesses. The comparison results constituted objective evidence for organization-wide deployment of the Agile Process in the company. "}},{"citationKey":"Stavru201487","entryType":"article","entryTags":{"title":"A critical examination of recent industrial surveys on agile method usage ","journal":"Journal of Systems and Software ","volume":"94","number":"","pages":"87 - 97","year":"2014","note":"","issn":"0164-1212","doi":"http://dx.doi.org/10.1016/j.jss.2014.03.041","url":"http://www.sciencedirect.com/science/article/pii/S0164121214000764","author":"Stavros Stavru","keywords":["Agile software development","Survey research","Research synthesis "],"abstract":"AbstractContext Practitioners and researchers often claim that agile methods have moved into the mainstream for the last few years. To support this claim they refer to recent industrial surveys which tend to report high rates of agile method usage. However many of these industrial surveys are conducted by agile consultants, tool vendors, professional societies and independent technology and market research organizations. This raises some important concerns about the possible conflict of interest and the overall trustworthiness of these studies. Objective In response to the above concerns, a secondary study was carried out. Its objective was to examine industrial surveys published in 2011 and 2012, determine the extent to which we could trust their reported high rates of agile method usage and provide recommendations on how quality of research could be improved in the future. Method Following a rigorous search procedure, nine industrial surveys on agile method usage published in 2011 and 2012 were extracted from both academia and industry. Their thoroughness in reporting and trustworthiness were evaluated using a newly proposed assessment framework based on Guba's four attributes of trustworthiness (truth value, applicability, consistency and neutrality) and a number of methods for assessing survey research in related fields as information, communication and management studies. Results The careful examination of the reviewed surveys shows that most of the studies have insufficient thoroughness in reporting and (subsequently) low trustworthiness. Only one (out of nine) study is considered as a scientific contribution in determining the current 2011/2012 rate of agile method usage. Conclusions The obtained results support our initial considerations about the trustworthiness of recent industrial surveys on agile method usage and suggest a number of recommendations for increasing the quality and value of future survey research in this regard. "}},{"citationKey":"Ernst2014100","entryType":"article","entryTags":{"title":"Agile requirements engineering via paraconsistent reasoning ","journal":"Information Systems ","volume":"43","number":"","pages":"100 - 116","year":"2014","note":"","issn":"0306-4379","doi":"http://dx.doi.org/10.1016/j.is.2013.05.008","url":"http://www.sciencedirect.com/science/article/pii/S030643791300077X","author":"Neil A. Ernst and Alexander Borgida and Ivan J. Jureta and John Mylopoulos","keywords":["Paraconsistency","Agile methods","Software requirements","Requirements evolution "],"abstract":"Abstract Innovative companies need an agile approach towards product and service requirements, to rapidly respond to and exploit changing conditions. The agile approach to requirements must nonetheless be systematic, especially with respect to accommodating legal and non-functional requirements. This paper examines how to support lightweight, agile requirements processes which can still be systematically modeled, analyzed and changed. We propose a framework, RE-KOMBINE, which is based on a propositional language for requirements modeling called Techne. We define operations on Techne models which tolerate the presence of inconsistencies. This paraconsistent reasoning is vital for supporting delayed commitment to particular design solutions. We evaluate these operations with an industry case study using two well-known formal analysis tools. Our evaluations show that the proposed framework scales to industry-sized requirements model, while still retaining (via propositional logic) the informality that is so useful during early requirements analysis. "}},{"citationKey":"Sverrisdottir2014257","entryType":"article","entryTags":{"title":"The Role of the Product Owner in Scrum-comparison between Theory and Practices ","journal":"Procedia - Social and Behavioral Sciences ","volume":"119","number":"","pages":"257 - 267","year":"2014","note":"Selected papers from the 27th \\{IPMA\\} (International Project Management Association), World Congress, Dubrovnik, Croatia, 2013 ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.03.030","url":"http://www.sciencedirect.com/science/article/pii/S1877042814021211","author":"Hrafnhildur Sif Sverrisdottir and Helgi Thor Ingason and Haukur Ingi Jonasson","keywords":["Project Management","Responsibility","The role of the product owner (PO) ;Scrum","Agile","Technical knowledge","Software Development "],"abstract":"Abstract New methods have emerged in last* decades for managing projects and develop software. The agile ideology was generally defined with the agile manifesto in 2001 and is widely used for software project management. Scrum is the most common method within agile and has become one of the most popular tools in software development in Iceland. The objective of this research was to shed light on how Scrum is applied. The role of the product owner is studied; the knowledge and skills he is required to have, according to the Scrum method. This is compared to the perception of a number of actual project owners of their role. Information was gathered by semi structured interviews with a limited number of product owners that have had that role for at least 1 year. The results show that the majority of the participants in the survey are using different project management methods. They apply the methods that best fit their own operations. The understanding of the role and responsibility of the product owner is quite different between organizations but seldom in perfect conformance with the official Scrum method. Cases were reported where there are two product owners for the same product. One is then responsible for business aspect but the other is responsible for technical aspects of the product. Scrum has a strong position in software development with its defined roles, collaboration emphasis, understanding, visibility, effective process and fast development. "}},{"citationKey":"Virani2014363","entryType":"article","entryTags":{"title":"A Hybrid System Engineering Approach for Engineered Resilient Systems: Combining Traditional and Agile Techniques to Support Future System Growth ","journal":"Procedia Computer Science ","volume":"28","number":"","pages":"363 - 369","year":"2014","note":"2014 Conference on Systems Engineering Research ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.03.045","url":"http://www.sciencedirect.com/science/article/pii/S1877050914001082","author":"Shamsnaz Virani and Lauren Stolzar","keywords":["Agile Systems Engineering","Lessons Learned","Case Study","Hybrid Approaches","Engineering Resilent Systems","Software Systems Engineering "],"abstract":"Abstract Accommodating new requirements and user driven features is the major challenge of engineered resilient systems. An enterprise- centric system-engineering paradigm provides a holistic framework for guiding future growth of systems. This paradigm requires new processes to support such growth. Traditional system engineering approaches, while helpful in developing system structure and framework, are not adaptive to future growth. New user desired features or requirements can be added to legacy systems, but typically entail unfortunate tradeoffs. To meet new requirements, engineered resilient systems have adopted a hybrid approach of using traditional and agile system engineering. Traditional system engineering approaches handle original concept development and design requirements, while the specific implementation is agile. The hybrid approach presents some application issues such as abstraction (how much of the systems should be designed before agile implementation). Others include how to facilitate user features requiring major design changes; and what are acceptable tradeoffs. These issues are particularly problematic during verification and validation phases when a system fails to meet a particular requirement, which necessitates a design change. In this paper, we present a real world case study of a large-scale data processing and analysis system. Design and implementation of this system took place over two years using a mix of traditional and agile system engineering approaches. This paper presents the current best practices, customization, and the issues of abstraction, design agility, user accommodation, and tradeoffs while using hybrid system engineering approaches. We include lessons learned from the case study and suggest future guidelines. "}},{"citationKey":"Roelich2014662","entryType":"article","entryTags":{"title":"Improving the policy application of footprint indicators to support Europe's transition to a one planet economy: The development of the \\{EUREAPA\\} tool ","journal":"Science of The Total Environment ","volume":"481","number":"","pages":"662 - 667","year":"2014","note":"","issn":"0048-9697","doi":"http://dx.doi.org/10.1016/j.scitotenv.2013.10.084","url":"http://www.sciencedirect.com/science/article/pii/S004896971301228X","author":"Katy Roelich and Anne Owen and David Thompson and Elena Dawkins and Chris West","keywords":["Carbon footprint","Water footprint","Ecological footprint","Input-Output analysis","Agile software development","Policy analysis "],"abstract":"Abstract Environmentally extended multi-regional input-output (EE-MRIO) models provide us with a wealth of data relating to consumption-based environmental impacts at a national level. The results can identify the categories of consumption and sectors of production that contribute most to environmental impact allowing policy makers to prioritise intervention into particular areas. However, these data are not readily accessible to policy makers and civil society, making it difficult to extract and communicate the important messages it contains. The web-based tool -- \\{EUREAPA\\} -- was created as a usable, task-oriented interface to improve access to environmental and economic data held within a complex EE-MRIO model and make it more relevant to policy makers and civil society. The project team of scientists and \\{IT\\} specialists used an iterative, agile and participatory approach to engage potential end-users in the specification and testing of the tool. The engagement process identified two principal functions that were essential for the \\{EUREAPA\\} tool: viewing data and creating scenarios. The viewing data function allows users to analyse the wealth of data held within the model and present results from a range of perspectives. This helps to understand the causes of environmental pressure and identify priorities for policy intervention. The scenario function helps to communicate how changes in consumption and production might affect the future environmental impact of citizens of the EU, and facilitates long-term planning. Through this dialogue process the project has been able to ensure \\{EUREAPA\\} is relevant, user-friendly and fit-for-purpose. It is intended that \\{EUREAPA\\} will be adopted by policy makers and civil society as an important policy planning and assessment aid in the complex field of sustainable consumption and production. "}},{"citationKey":"Rivero2014670","entryType":"article","entryTags":{"title":"Mockup-Driven Development: Providing agile support for Model-Driven Web Engineering ","journal":"Information and Software Technology ","volume":"56","number":"6","pages":"670 - 687","year":"2014","note":"","issn":"0950-5849","doi":"http://dx.doi.org/10.1016/j.infsof.2014.01.011","url":"http://www.sciencedirect.com/science/article/pii/S0950584914000226","author":"Jose Matias Rivero and Julian Grigera and Gustavo Rossi and Esteban Robles Luna and Francisco Montero and Martin Gaedke","keywords":["Mockups","User-Interface","Agile","Web Engineering","MDD "],"abstract":"AbstractContext Agile software development approaches are currently becoming the industry standard for Web Application development. On the other hand, Model-Driven Web Engineering (MDWE) methodologies are known to improve productivity when building this kind of applications. However, current \\{MDWE\\} methodologies tend to ignore important aspects of Web Applications development supported by agile processes, such as constant customer feedback or early design of user interfaces. Objective In this paper we analyze the difficulties of supporting agile features in \\{MDWE\\} methodologies. Then, we propose an approach that eases the incorporation of well-known agile practices to MDWE. Method We propose using User Interface prototypes (usually known as mockups) as a way to start the modeling process in the context of a mixed agile-MDWE process. To assist this process, we defined a lightweight metamodel that allows modeling features over mockups, interacting with end-users and generating \\{MDWE\\} models. Then, we conducted a statistical evaluation of both approaches (traditional vs. mockup-based modeling). Results First we comment on how agile features can be added to \\{MDWE\\} processes using mockups. Then, we show by means of a quantitative study that the proposed approach is faster, less error-prone and still as complete as traditional \\{MDWE\\} processes. Conclusion The use of mockups to guide the \\{MDWE\\} process helps in the reduction of the development cycle as well as in the incorporation of agile practices in the model-driven workflow. Complete \\{MDWE\\} models can be built and generated by using lightweight modeling over User Interface mockups, and this process suggests being more efficient, in terms of errors and effort, than traditional modeling in MDWE. "}},{"citationKey":"Chakravorty2014536","entryType":"article","entryTags":{"title":"Analysis of Agile Testing Attributes for Faster Time to Market: Context of Manufacturing Sector Related \\{IT\\} Projects ","journal":"Procedia Economics and Finance ","volume":"11","number":"","pages":"536 - 552","year":"2014","note":"Shaping the Future of Business and SocietySymbiosis Institute of Management Studies (SIMS) ","issn":"2212-5671","doi":"http://dx.doi.org/10.1016/S2212-5671(14)00219-6","url":"http://www.sciencedirect.com/science/article/pii/S2212567114002196","author":"Tulika Chakravorty and Samyadip Chakraborty and Nasina Jigeesh","keywords":["Agile methodology","Testing strategy","SDLC","IT projects","Manufacturing. "],"abstract":"Abstract Agile methodologies are helpful to develop and implement systems to meet the market demands in a faster way, by helping various organizations to evaluate projects.Agile testing strategy is one of the methodologies that is suitable for implementation of \\{IT\\} projects. This paper focuses on \\{IT\\} projects related to manufacturing sector by deriving the significance of various agile project testing attributes across every phase of information systems development life cycle (SDLC) for faster time to market the products. The attributes include prioritization of features according to customer requirement, early customer involvement, incremental and iterative sprints, flexible development environment with less documentation and complexity management. The results highlight the varying significance of these attributes and identifying the key attributes in each project phase; thereby helping software professionals and project managers by providing a handy framework for focusing on phase-wise core attributes that might be essential for tacklingrelated project issues and fullfilling the managerial priorities. "}},{"citationKey":"Antlova2014929","entryType":"article","entryTags":{"title":"Agile Approach in the Project Management of the Czech Companies ","journal":"Procedia Technology ","volume":"16","number":"","pages":"929 - 933","year":"2014","note":"\\{CENTERIS\\} 2014 - Conference on \\{ENTERprise\\} Information Systems / ProjMAN 2014 - International Conference on Project \\{MANagement\\} / \\{HCIST\\} 2014 - International Conference on Health and Social Care Information Systems and Technologies ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2014.10.045","url":"http://www.sciencedirect.com/science/article/pii/S2212017314002722","author":"Klara Antlova","keywords":["agile approach","project management","key success factors","information systems "],"abstract":"Abstract The aim of the article is to find the ways how to solve these failures. Article also explains reasons of the most important factors of failures in project management. One of the possibilities how to avoid of this failures is to use agile approach. Therefore there are mentioned the basic principles of these methods. Article also brings the results of survey which has been realized in forty Czech companies during 2013. The results of survey demonstrate that software and internet companies are using agile approaches more often than other companies from manufacturing area and services. "}},{"citationKey":"Binder2014182","entryType":"article","entryTags":{"title":"The Project Management Cocktail Model: An Approach for Balancing Agile and \\{ISO\\} 21500 ","journal":"Procedia - Social and Behavioral Sciences ","volume":"119","number":"","pages":"182 - 191","year":"2014","note":"Selected papers from the 27th \\{IPMA\\} (International Project Management Association), World Congress, Dubrovnik, Croatia, 2013 ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.03.022","url":"http://www.sciencedirect.com/science/article/pii/S1877042814021132","author":"Jean Binder and Leon IV Aillaud and Lionel Schilli","keywords":["Agile","Hybrid","Waterfall","ISO","Model","Project Management","Standard "],"abstract":"Abstract Modern \\{PM\\} methodologies emerged in the late 1950s and were formalized in 2012 in an International Organization for Standization (ISO) standard: ISO/FDIS 21500:2012, Guidance on Project Management. This \\{ISO\\} standard follows traditional waterfall approach whereby high-level project definition is used to develop a detailed plan guiding the execution of all deliverables. Agile principles (AP) emerged in the late 1950s and were formalized in the 2001 Agile Manifesto (Larman and Basili, 2003). These principles are not reflected in the \\{ISO\\} standard because agile and waterfall approaches were formerly considered as 'competing bipolar choices' (Batra et al., 2010, p.380). Recent research contends that both approaches can be valid, dependent on project complexities and risks (Boehm and Turner, 2003), and that a combined (cocktail) approach could prove optimal (Kahkonen, 2004; Batra et al., 2010; Barlow et al., 2010). This paper investigates combining the \\{AP\\} with a waterfall \\{PM\\} model and compares the new \\{ISO\\} standard to the Agile Manifesto and previous literature on hybrid \\{PM\\} models. We present a novel cocktail model that balances the structure of waterfall-based models with the flexibility of AP. This model has the benefit of meeting the financial, legal and procurement standards of large companies through its use of the \\{ISO\\} standard elements, while introducing the agility required to adapt to changing priorities and environments. "}},{"citationKey":"Spundak2014939","entryType":"article","entryTags":{"title":"Mixed Agile/Traditional Project Management Methodology - Reality or Illusion? ","journal":"Procedia - Social and Behavioral Sciences ","volume":"119","number":"","pages":"939 - 948","year":"2014","note":"Selected papers from the 27th \\{IPMA\\} (International Project Management Association), World Congress, Dubrovnik, Croatia, 2013 ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.03.105","url":"http://www.sciencedirect.com/science/article/pii/S187704281402196X","author":"Mario Spundak","keywords":["Agile project management","traditional project management","methodology","methodology elements "],"abstract":"Abstract Project management methodology is usually defined as a set of methods, techniques, procedures, rules, templates, and best practices used on a project. It is commonly based on a specific project management approach, that defines a set of principles and guidelines which define the way a project is managed. With the growing trend of usage of agile project management on different projects, it is clear that two opposite sides exist - traditional and agile project management approach, and that there exists a need to combine both approaches. So, the question is if it is and how it is possible to combine both approaches in a single project management methodology? The paper covers thorough literature review and starts with the definition of the project management approach and of the project management methodology. It provides overview of different project management approaches and defines project management methodologies. The literature review shows what is considered as part of project management methodology in a wider or narrower sense, and what the main characteristics of a methodology are. The need for combining project management approaches is shown on the case of software development project. The paper provides basis for further research on application of different project management approaches and methodologies. Further research could build on an idea of creating unique methodology for project, based on different project management approaches. In that way it is possible to create project management methodologies that have high possibility of customization to projects and to project environments. "}},{"citationKey":"Oliveira2014342","entryType":"article","entryTags":{"title":"Development of an Agricultural Management Information System based on Open-source Solutions ","journal":"Procedia Technology ","volume":"16","number":"","pages":"342 - 354","year":"2014","note":"\\{CENTERIS\\} 2014 - Conference on \\{ENTERprise\\} Information Systems / ProjMAN 2014 - International Conference on Project \\{MANagement\\} / \\{HCIST\\} 2014 - International Conference on Health and Social Care Information Systems and Technologies ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2014.10.100","url":"http://www.sciencedirect.com/science/article/pii/S2212017314003272","author":"Tiago H. Moreira de Oliveira and Marco Painho and Vitor Santos and Otavio Sian and Andre Barriguinha","keywords":["Geographic Information Systems","Agricultural information systems","Module View Controller","Agile","SCRUM","Evolutionary Prototyping "],"abstract":"Abstract A common problem associated with ready-made software is that businesses are forced to alter some of their processes in order to fully utilize the product. On the other hand, custom-made applications are specifically designed to accommodate the needs of the client's activities, so the final product will be based on their input during the software development process, and will be fine-tuned to fit the way your business operates. With this approach, an information system designed towards the management of agricultural properties, the Agrifootprint system, was developed. The main goal of the Agrifootprint system was to develop and implement a Web-based Geographic Information System, based on Open-Source technology, with a custom-made, comprehensive and user-friendly geospatial system, in order to integrate and manage data from several small agriculture enterprises. The development process was based in Agile methodologies: \\{SCRUM\\} and Evolutionary Prototyping. This option for agile development process brought the establishment of a relationship of complicity between the customer and the development team due to more real understanding of the requirements raised and the system that will be produced from these. "}},{"citationKey":"Palmer201444","entryType":"article","entryTags":{"title":"The Essential Nature of Product Traceability and its Relation to Agile Approaches ","journal":"Procedia Computer Science ","volume":"28","number":"","pages":"44 - 53","year":"2014","note":"2014 Conference on Systems Engineering Research ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.03.007","url":"http://www.sciencedirect.com/science/article/pii/S1877050914000702","author":"Kent D. Palmer","keywords":["Traceability","Agile","Requirements","Architecture","Test","Coherence","Soundness "],"abstract":"Abstract This is a discussion of the essential features of product development traceability maps in relation to requirements, architecture, functional models, components, and tests as a set of order type hierarchies and their cross-links. This paper lays out the structure of these ideal traceability relationships that define the essence of the product under development. The importance of the trace relationships to the product is clarified and then the abandonment of traceability in the Agile approach is discussed. Following that, a way to transform between synthetic canonical narrative (story) representations that appear in the product backlog and the traditionally separate hierarchical form of the trace structure of the product will be examined. The fact that it is possible to transform back and forth between the canonic narrative and traditional hierarchical representations of trace structures, and the fact that trace structures can be produced in a 'just in time' fashion that evolves during product development demonstrate that these trace structures can be used in both an Agile and Lean fashion within the development process. Also, we can show that when the trace structure is produced outside the narrative representation it can have the additional benefit of helping to determine the precedent order of development so that rework can be avoided. The lack of the extrinsic external trace structure of the product that gives access to its intelligibility is, in fact, a form of technical debt. Thus, traditional trace structures using this model can be seen as an essential tool for product owners to produce sound and coherent development narratives and for structuring and prioritizing the backlog in the Agile and Lean approaches to software and systems development. "}},{"citationKey":"Vinodh20141052","entryType":"article","entryTags":{"title":"Application of fuzzy compromise solution method for fit concept selection ","journal":"Applied Mathematical Modelling ","volume":"38","number":"3","pages":"1052 - 1063","year":"2014","note":"","issn":"0307-904X","doi":"http://dx.doi.org/10.1016/j.apm.2013.07.027","url":"http://www.sciencedirect.com/science/article/pii/S0307904X1300471X","author":"S. Vinodh and S. Sarangan and S. Chandra Vinoth","keywords":["Fit manufacturing","Lean manufacturing","Agile manufacturing","Multi Criteria Decision Making","Vlsekriterijumska Optimizacija I Kompromisno Resenje (VIKOR) "],"abstract":"Abstract The modern manufacturing environment is highly turbulent so as to satisfy the dynamic needs of customers'. To enable the achievement of competitiveness in this complex business environment, newer manufacturing strategies have been introduced for enabling waste elimination and enhancing flexibility and responsiveness of systems. Fit manufacturing is a competitive manufacturing paradigm which includes lean and agile systems coupled with sustainable benefits. This article presents a study in which the concept selection in fit environment was formulated as Multi Criteria Decision Making (MCDM) problem and solved using fuzzy based compromise solution method, Vlsekriterijumska Optimizacija I Kompromisno Resenje (VIKOR). The selected concept design of automotive component was subjected to implementation in the case organisation. "}},{"citationKey":"Li201436","entryType":"article","entryTags":{"title":"Resource block Filtered-OFDM for future spectrally agile and power efficient systems ","journal":"Physical Communication ","volume":"11","number":"","pages":"36 - 55","year":"2014","note":"Radio Access Beyond OFDM(A) ","issn":"1874-4907","doi":"http://dx.doi.org/10.1016/j.phycom.2013.10.003","url":"http://www.sciencedirect.com/science/article/pii/S187449071300061X","author":"Jialing Li and Erdem Bala and Rui Yang","keywords":["Multicarrier modulation","OFDM","Filtered-OFDM","Filter bank multicarrier modulation","Spectrally agile systems","Cognitive radio "],"abstract":"Abstract Spectrum sharing is a common paradigm in future communication systems and a spectrally agile baseband waveform with minimal out-of-band emissions is a critical component. In this paper, we propose a new multicarrier modulation technique, called resource block Filtered-OFDM (RB-F-OFDM) and present the transceiver design. This waveform can be used over channels with non-contiguous spectrum fragments and exhibits very low adjacent channel interference, which is required for cognitive radio systems with multi channel carrier aggregation capabilities. As such, regulatory based very stringent adjacent channel leakage ratio (ACLR) and adjacent channel selectivity (ACS) requirements can be met. We show that the transceiver complexity may be reduced by utilizing an efficient polyphase implementation that is commonly used in the filter bank multicarrier (FBMC) modulation. In addition, some efficient peak-to-average power ratio (PAPR) reduction techniques can be naturally applied. The new design is backwards compatible with legacy \\{OFDM\\} based systems. Simulation results to evaluate the performance, including measured bit error rate (BER) in multipath channels, are provided. "}},{"citationKey":"Morlock2014154","entryType":"article","entryTags":{"title":"Performance Measurement for Robust and Agile Scheduling and Control of Industrial Product-Service Systems ","journal":"Procedia \\{CIRP\\} ","volume":"19","number":"","pages":"154 - 159","year":"2014","note":"2nd \\{CIRP\\} Robust Manufacturing Conference (RoMac 2014) ","issn":"2212-8271","doi":"http://dx.doi.org/10.1016/j.procir.2014.05.006","url":"http://www.sciencedirect.com/science/article/pii/S2212827114006349","author":"Friedrich Morlock and Thomas Dorka and Horst Meier","keywords":["Industrial Product-Service Systems","Performance Measurement","Agile Scheduling and Control","Organization "],"abstract":"Abstract In the manufacturing industry competitors are continuously struggling to differentiate from other companies in the market. Industrial Product- Service Systems (IPS2) offer this differentiation by representing a paradigm shift from traditional product selling and service offering to providing customer value. To support the \\{IPS2\\} provider during the delivery and use phase of \\{IPS2\\} an IPS2-Execution System (IPS2-ES) has been developed. The system is needed for planning, scheduling and organization of the required delivery processes and the partner network. In addition to that, a performance measurement method for \\{IPS2\\} (IPS2-PMM) supports the \\{IPS2\\} provider with an evaluation of the \\{IPS2\\} delivery through key performance indicators (KPI). For the holistic agile scheduling and control for \\{IPS2\\} delivery, an \\{IPS2\\} control model has been developed. However, to add robustness for the \\{IPS2\\} delivery, the IPS2-PMM has to be integrated into this model. In this paper, the \\{IPS2\\} control model is extended to allow for an integration of the IPS2-PMM. Thus, the cascaded control loops are enriched by the generation of \\{KPI\\} for the evaluation of the \\{IPS2\\} delivery. "}},{"citationKey":"Davies201488","entryType":"article","entryTags":{"title":"Model-driven engineering of information systems: 10 years and 1000 versions ","journal":"Science of Computer Programming ","volume":"89, Part B","number":"","pages":"88 - 104","year":"2014","note":"Special issue on Success Stories in Model Driven Engineering ","issn":"0167-6423","doi":"http://dx.doi.org/10.1016/j.scico.2013.02.002","url":"http://www.sciencedirect.com/science/article/pii/S0167642313000270","author":"Jim Davies and Jeremy Gibbons and James Welch and Edward Crichton","keywords":["Model-driven","Evolution","Data migration","Formal methods","Agile","Databases "],"abstract":"This paper reports upon ten years of experience in the development and application of model-driven technology. The technology in question was inspired by work on formal methods: in particular, by the B toolkit. It was used in the development of a number of information systems, all of which were successfully deployed in real world situations. The paper reports upon three systems: one that informed the design of the technology, one that was used by an internal customer, and one that is currently in use outside the development organisation. It records a number of lessons regarding the application of model-driven techniques. "}},{"citationKey":"Madureira201497","entryType":"article","entryTags":{"title":"Negotiation mechanism for self-organized scheduling system with collective intelligence ","journal":"Neurocomputing ","volume":"132","number":"","pages":"97 - 110","year":"2014","note":"Innovations in Nature Inspired Optimization and Learning MethodsMachines learning for Non-Linear ProcessingSelected papers from the Third World Congress on Nature and Biologically Inspired Computing (NaBIC2011)Selected papers from the 2011 International Conference on Non-Linear Speech Processing (NoLISP 2011) ","issn":"0925-2312","doi":"http://dx.doi.org/10.1016/j.neucom.2013.10.032","url":"http://www.sciencedirect.com/science/article/pii/S0925231213010928","author":"A. Madureira and I. Pereira and P. Pereira and A. Abraham","keywords":["Negotiation in MAS","Self-organization","Swarm intelligence","Dynamic scheduling","Agile manufacturing "],"abstract":"Abstract Current Manufacturing Systems challenges due to international economic crisis, market globalization and e-business trends, incites the development of intelligent systems to support decision making, which allows managers to concentrate on high-level tasks management while improving decision response and effectiveness towards manufacturing agility. This paper presents a novel negotiation mechanism for dynamic scheduling based on social and collective intelligence. Under the proposed negotiation mechanism, agents must interact and collaborate in order to improve the global schedule. Swarm Intelligence (SI) is considered a general aggregation term for several computational techniques, which use ideas and inspiration from the social behaviors of insects and other biological systems. This work is primarily concerned with negotiation, where multiple self-interested agents can reach agreement over the exchange of operations on competitive resources. Experimental analysis was performed in order to validate the influence of negotiation mechanism in the system performance and the \\{SI\\} technique. Empirical results and statistical evidence illustrate that the negotiation mechanism influence significantly the overall system performance and the effectiveness of Artificial Bee Colony for makespan minimization and on the machine occupation maximization. "}},{"citationKey":"Shrivastava2014417","entryType":"article","entryTags":{"title":"Risks in Distributed Agile Development: A Review ","journal":"Procedia - Social and Behavioral Sciences ","volume":"133","number":"","pages":"417 - 424","year":"2014","note":"International Conference on Trade, Markets and Sustainability (ICTMS-2013) ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.04.208","url":"http://www.sciencedirect.com/science/article/pii/S1877042814031188","author":"Suprika Vasudeva Shrivastava and Urvashi Rathod","keywords":["Distributed Software Development (DSD)","Distributed Scrum","Distributed Extreme Programming","Global Software Development (GSD)","Risks "],"abstract":"Abstract There has been is a growing trend in software development through distributed agile approach and so, the study of risks in such environments becomes imperative. A number of studies have discussed about the problems faced by distributed agile teams. This study attempts to consolidate the existing studies on risks in distributed agile development. It helps in uncovering the areas of risk management in distributed agile, in which extensive work has been done and also presents the type of work that needs further consideration. "}},{"citationKey":"GarciaCoria20141189","entryType":"article","entryTags":{"title":"Intelligent business processes composition based on multi-agent systems ","journal":"Expert Systems with Applications ","volume":"41","number":"4, Part 1","pages":"1189 - 1205","year":"2014","note":"","issn":"0957-4174","doi":"http://dx.doi.org/10.1016/j.eswa.2013.08.003","url":"http://www.sciencedirect.com/science/article/pii/S0957417413006143","author":"Jose A. Garcia Coria and Jose A. Castellanos-Garzon and Juan M. Corchado","keywords":["Multi-agent system","Web service","Cloud computing","Software component reuse","Software engineering","Business process composition","Machine learning "],"abstract":"Abstract This paper proposes a novel model for automatic construction of business processes called \\{IPCASCI\\} (Intelligent business Processes Composition based on multi-Agent systems, Semantics and Cloud Integration). The software development industry requires agile construction of new products able to adapt to the emerging needs of a changing market. In this context, we present a method of software component reuse as a model (or methodology), which facilitates the semi-automatic reuse of web services on a cloud computing environment, leading to business process composition. The proposal is based on web service technology, including: (i) Automatic discovery of web services; (ii) Semantics description of web services; (iii) Automatic composition of existing web services to generate new ones; (iv) Automatic invocation of web services. As a result of this proposal, we have presented its implementation (as a tool) on a real case study. The evaluation of the case study and its results are proof of the reliability of IPCASCI. "}},{"citationKey":"Yu2014282","entryType":"article","entryTags":{"title":"Spectrum engineering in flexible grid data center optical networks ","journal":"Optical Switching and Networking ","volume":"14, Part 3","number":"","pages":"282 - 288","year":"2014","note":"SI: Optimization and Application in Converged Optical and Data Center Networks ","issn":"1573-4277","doi":"http://dx.doi.org/10.1016/j.osn.2014.05.016","url":"http://www.sciencedirect.com/science/article/pii/S1573427714000605","author":"Xiaosong Yu and Yongli Zhao and Jiawei Zhang and Xinbo Wang and Jianping Wang and Jie Zhang","keywords":["Flexible grid","Spectrum engineering","Defragmentation","Software defined networking","Data center networks "],"abstract":"Abstract Data centers provide a volume of computation and storage resources for cloud-based services, and generate very huge traffic in data center networks. Usually, data centers are connected by ultra-long-haul \\{WDM\\} optical transport networks due to its advantages, such as high bandwidth, low latency, and low energy consumption. However, since the rigid bandwidth and coarse granularity, it shows inefficient spectrum utilization and inflexible accommodation of various types of traffic. Based on OFDM, a novel architecture named flexible grid optical network has been proposed, and becomes a promising technology in data center interconnections. In flexible grid optical networks, the assignment and management of spectrum resources are more flexible, and agile spectrum control and management strategies are needed. In this paper, we introduce the concept of Spectrum Engineering, which could be used to maximize spectral efficiency in flexible grid optical networks. Spectrum Defragmentation, as one of the most important aspect in Spectrum Engineering, is demonstrated by OpenFlow in flexible grid optical networks. Experimental results are reported and verify the feasibility of Spectrum Engineering. "}},{"citationKey":"Cuni2014278","entryType":"article","entryTags":{"title":"Scientific Outputs: Integration and Unification of Catalan \\{CRIS\\} Information Systems ","journal":"Procedia Computer Science ","volume":"33","number":"","pages":"278 - 283","year":"2014","note":"12th International Conference on Current Research Information Systems, \\{CRIS\\} 2014Managing data intensive science - The role of Research Information Systems in realising the digital agenda ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.06.044","url":"http://www.sciencedirect.com/science/article/pii/S1877050914008345","author":"Nuria Cuni","keywords":["Research design and methodologies","Research policy-National and/or institutional","Scientific Production","Scientific Output","Interoperability","International Repositories","Software tools","Synergy","Projects","CBUC","CESCA","CSUC. "],"abstract":"Abstract Society increasingly demands quickly, easily and a homogeneous access to the information. Access to Internet, mobile devices, social networks as Facebook or ResearchGate, which create links between people to share data reaching anywhere in the world within seconds or the increase commitment for the cloud, where access from any device and place allowing the access to the own documents, videos, photos, music, etc. keeping the own customized environment or applications to share documents as Google Drive or Dropbox, which allows to agile data access are examples of agility in the flow of information and is something that nowadays is needed and is no longer questioned. This paradigm transferred in the scope of research, knowing that universities, their affiliated research centers and researchers have the aim on spending time doing research, getting funds for their research or teaching and the moment to feel the need to transfer or enter the results into an information system that do not report short-term progress or improvement in their day to day of research never arrives. Faced with this situation takes more relevance offer systems that provide the flexibility and immediacy of access to scientific publications generated. In this regard already exists commercial databases as Web Of Science, PubMed, Dialnet, Scopus, Google Scholar, etc. that provides it. On the other hand, \\{SIGMA\\} Gestion Universitaria, which is a not-for-profit consortium established in 1996 by a group of 8 top level Spanish Public Universities to provide technological solutions to their needs for managing academic, learning, research and organization processes aligning its \\{ARGOS\\} Research Project Solution with the \\{ERA\\} requirements. \\{SIGMA\\} and their universities have made great efforts to promote competitiveness, mobility, create synergies and improve the research quality in-house, regionally, nationally and internationally. This has allowed great progress in all areas, researcher's mobility, creating synergies with shared resource centers between different institutions and improving the research visibility generated. "}},{"citationKey":"Stare2014295","entryType":"article","entryTags":{"title":"Agile Project Management in Product Development Projects ","journal":"Procedia - Social and Behavioral Sciences ","volume":"119","number":"","pages":"295 - 304","year":"2014","note":"Selected papers from the 27th \\{IPMA\\} (International Project Management Association), World Congress, Dubrovnik, Croatia, 2013 ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.03.034","url":"http://www.sciencedirect.com/science/article/pii/S1877042814021259","author":"Aljaz Stare","keywords":["project","management","agility","product development "],"abstract":"Abstract Despite the growing popularity of agile project management in the field of \\{IT\\} projects, it has not yet been established in other types of projects (engineering, research &amp; development, organisation of events), presumably because of many reasons: the frequent changes are too expensive, the partial deliverables may not be marketed or used, individuals participate in several projects at the same time, etc. We could argue that the approach will never be widely used. However, we cannot say that certain agile practices cannot be utilized for projects that are still carried out in the traditional way. Therefore, we analysed the product development projects in five manufacturing companies. We wanted first to determine whether they already use any of the agile techniques, and further on - using regression analysis - we determined the actual contribution of individual agile techniques to the project's success. The aim of this paper is to demonstrate the applicability of agile project management in the context of product development. We would also like to stimulate professional discussion and researches of agile management of other types of projects, and to encourage the introduction of agile techniques wherever proven to contribute to the success of the projects. "}},{"citationKey":"Schutzbank201414","entryType":"article","entryTags":{"title":"Doubling down: Lessons learned from building a new electronic health record as part of primary care practice redesign ","journal":"Healthcare ","volume":"2","number":"1","pages":"14 - 18","year":"2014","note":"","issn":"2213-0764","doi":"http://dx.doi.org/10.1016/j.hjdsi.2013.12.007","url":"http://www.sciencedirect.com/science/article/pii/S2213076414000049","author":"Andrew Schutzbank and Rushika Fernandopulle","keywords":["Primary care","EHR","Innovation","IT","Practice redesign","Reform "],"abstract":"Abstract Iora Health is a primary care delivery company creating de novo primary care practices with the mission of restoring humanity to health care. To support our very different and evolving model of team-based primary care we realized we needed to build our own electronic health record (EHR). This perspective shares four key lessons from the software development process: the tight relationship between delivery innovation and software development, the benefits of Agile development, the value of having the clinicians at all levels as part of the software development team, and different ways to think about clinical information. "}},{"citationKey":"Tsachouridis2014226","entryType":"article","entryTags":{"title":"Agile numerical modelling of real electric power plants ","journal":"International Journal of Electrical Power & Energy Systems ","volume":"58","number":"","pages":"226 - 241","year":"2014","note":"","issn":"0142-0615","doi":"http://dx.doi.org/10.1016/j.ijepes.2014.01.037","url":"http://www.sciencedirect.com/science/article/pii/S0142061514000507","author":"Vassilios A. Tsachouridis","keywords":["Electric power plants","Numerical modelling","Filter algorithms "],"abstract":"Abstract Novel research results subject to the generation of agile numerical models for a real electric power plant are presented in this paper. Using only instrument measurements of various variables located in different parts of the power station, filtering algorithms are programmed for the computation of numerical models that describe system operation and are agile to adapt between different operational regimes. The contents of the paper constitute original industrial research conducted to a real electric power generation facility. The presented results were validated on site by the power plant's chief engineers. "}},{"citationKey":"Ollinger20142622","entryType":"article","entryTags":{"title":"SOA-PLC - Dynamic Generation and Deployment of Web Services on a Programmable Logic Controller ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"47","number":"3","pages":"2622 - 2627","year":"2014","note":"19th \\{IFAC\\} World Congress ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20140824-6-ZA-1003.02189","url":"http://www.sciencedirect.com/science/article/pii/S1474667016420057","author":"Lisa Ollinger and Alexander Abdo and Detlef Zuhlke and Henning Heutger","keywords":["Manufacturing control","Control engineering","Distributed control","Process models","Flexible manufacturing systems "],"abstract":"Abstract The static and inflexible design of control software with current Programmable Logic Controllers (PLCs) and its integration in other automation systems do not meet the demands of agile and dynamic manufacturing systems with their rising complexity. Service-oriented Architecture (SOA) is a promising approach to overcome this shortcoming. Thus, a concept of a SOA-PLC is presented in this paper. The suggested concept allows a fully automated generation and deployment of field device functions as services implemented with the Devices Profile for Web Services (DPWS). Moreover, the concept is demonstrated in a case study using a conventional Phoenix Contact \\{PLC\\} and the \\{DPWS\\} orchestration tool JGrafchart. "}},{"citationKey":"Agostinho20142400","entryType":"article","entryTags":{"title":"Dynamic Adaptors to Support Model-Driven Interoperability and Enhance Sensing Enterprise Networks ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"47","number":"3","pages":"2400 - 2407","year":"2014","note":"19th \\{IFAC\\} World Congress ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20140824-6-ZA-1003.02601","url":"http://www.sciencedirect.com/science/article/pii/S1474667016419701","author":"Carlos Agostinho and Pedro Pinto and Ricardo Jardim-Goncalves","keywords":["Self-Sustainable Interoperability","Sensing Enterprise","Dynamic Networks","Model Transformations","ATL","Model-Driven Interoperability "],"abstract":"Abstract In an increasingly complex environment, the enterprises of the future should become Sensing Enterprises, evidencing intelligent, dynamic and self-organizing capabilities for understanding and responding to the shifts that impact the networks they belong to. Reconfiguration and reprioritization of industrial processes, information models, and even terminology is now seen as a requirement for survivability, which means that software systems need to become more agile. Hence, software adaptor technologies such as the \\{ATLAS\\} Transformation Language (ATL) are gaining momentum due to the potential to define and regulate peer-to-peer communication among networks of enterprise systems. At present, \\{ATL\\} is the de facto standard for transformations within the framework of model-driven interoperability (MDI), nonetheless it lacks the dynamism required to streamline complex systems, which demand adaptors to be frequently redesigned whenever information models change. This paper presents a novel solution, which aims to reduce the setbacks that arise from this lack of dynamism. "}},{"citationKey":"Qrunfleh2014340","entryType":"article","entryTags":{"title":"Supply chain information systems strategy: Impacts on supply chain performance and firm performance ","journal":"International Journal of Production Economics ","volume":"147, Part B","number":"","pages":"340 - 350","year":"2014","note":"Building Supply Chain System Capabilities in the Age of Global Complexity: Emerging Theories and Practices ","issn":"0925-5273","doi":"http://dx.doi.org/10.1016/j.ijpe.2012.09.018","url":"http://www.sciencedirect.com/science/article/pii/S0925527312004148","author":"Sufian Qrunfleh and Monideepa Tarafdar","keywords":["Supply chain strategy","Information systems strategy","Supply chain performance","Information processing theory","Survey research "],"abstract":"This paper examines the relationship between supply chain (SC) strategy and supply chain information systems (IS) strategy, and its impact on supply chain performance and firm performance. Theorizing from the supply chain and \\{IS\\} literatures within an overarching framework of the information processing theory (IPT), we develop hypotheses proposing a positive moderating effect of two supply chain \\{IS\\} strategies - \\{IS\\} for Efficiency and \\{IS\\} for Flexibility - on the respective relationships between two \\{SC\\} strategies - Lean and Agile, and supply chain performance. Based on confirmatory analysis and structural equation modeling of survey data from members of senior and executive management in the purchase/materials management/logistics/supply chain functions, from 205 firms, we validate these hypotheses and show that the \\{IS\\} for Efficiency (IS for Flexibility) \\{IS\\} strategy enhances the relationship between Lean (Agile) \\{SC\\} strategy and supply chain performance. We also show a positive association between supply chain performance and firm performance, and a full (partial) mediation effect of supply chain performance on the relation between Agile (Lean) \\{SC\\} strategy and firm performance. The paper contributes to the supply chain literature by providing theoretical understanding and empirical support of how \\{SC\\} strategies and \\{IS\\} strategies can work together to boost supply chain performance. In doing so, it identifies particular types of supply chain \\{IS\\} application portfolios that can enhance the benefits from specific \\{SC\\} strategies. The paper also develops and validates instruments for measuring two types of \\{SC\\} strategies and supply chain \\{IS\\} strategies. For practice, the paper offers guidance in making investment decisions for adopting and deploying \\{IS\\} appropriate to particular \\{SC\\} strategies and analyzing possible lack of alignment between applications that the firm deploys in its supply chain, and the information processing needs of its \\{SC\\} strategy. "}},{"citationKey":"Costa2014895","entryType":"incollection","entryTags":{"title":"Decision Support Tool for Strategic Planning in Supply Chains ","editor":"Jiri Jaromir Klemes, Petar Sabev Varbanov and Peng Yen Liew","booktitle":"24th European Symposium on Computer Aided Process Engineering","publisher":"Elsevier","year":"2014","volume":"33","pages":"895 - 900","series":"Computer Aided Chemical Engineering ","issn":"1570-7946","doi":"http://dx.doi.org/10.1016/B978-0-444-63456-6.50150-2","url":"http://www.sciencedirect.com/science/article/pii/B9780444634566501502","author":"Pedro Costa and Maria Isabel Gomes and Ana Carvalho and Ana Barbosa-Povoa","keywords":["Decision Support Tool","Supply Chains","Network Design "],"abstract":"Abstract This paper proposes a systematic methodology for supply chain planning optimization and assessment of different scenarios. This methodology will help companies throughout the difficult process of strategic decision-making in what concerns the design of an efficient supply chain structure. The proposed methodology allows the analysis of complex systems as it integrates a decision support tool developed to agile the process of scenario comparison, when designing network structures. This tool allows practitioners to take advantage of the optimization models without the need of learning modelling languages. An example based on a real case study is presented, showing the methodology/tool applicability. "}},{"citationKey":"Amira20143309","entryType":"article","entryTags":{"title":"Methodology for Aligning Factory Information and Control Systems in a Complex and Dynamic Environment: Case of Semiconductor Manufacturing ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"47","number":"3","pages":"3309 - 3314","year":"2014","note":"19th \\{IFAC\\} World Congress ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20140824-6-ZA-1003.01503","url":"http://www.sciencedirect.com/science/article/pii/S1474667016421166","author":"Ahmed Ben Amira and Stephane Dauzere-Peres and Philippe Vialletelle and Guillaume Lepelletier and Philippe Lalevee","keywords":["Business / \\{IT\\} Alignment","Factory Information and Control Systems","Enterprise Architecture","Semiconductor Manufacturing "],"abstract":"Abstract Business and information system alignment is key to improve business performance. Yet, little studies show practically how to achieve an efficient fit between business and IT. This paper proposes a methodology for accompanying the evolution of factory information and control systems for complex enterprises in an agile environment, from a functional standpoint. The methodology relies on capturing user requirements in a Reference Model and finding acceptable compromises of \\{IT\\} development, to reach the alignment incrementally. The methodology has been designed at 300mm unit of \\{STMicroelectronics\\} in Crolles. It is currently under deployment. "}},{"citationKey":"Pinheiro2014347","entryType":"article","entryTags":{"title":"Development of a mechanical maintenance training simulator in OpenSimulator for F-16 aircraft engines ","journal":"Entertainment Computing ","volume":"5","number":"4","pages":"347 - 355","year":"2014","note":"","issn":"1875-9521","doi":"http://dx.doi.org/10.1016/j.entcom.2014.06.002","url":"http://www.sciencedirect.com/science/article/pii/S1875952114000184","author":"Andre Pinheiro and Paulo Fernandes and Ana Maia and Goncalo Cruz and Daniela Pedrosa and Benjamim Fonseca and Hugo Paredes and Paulo Martins and Leonel Morgado and Jorge Rafael","keywords":["Virtual worlds","OpenSimulator","Virtual learning","Cooperation","Task coordination","Aircraft engine maintenance "],"abstract":"Abstract Mechanical maintenance of F-16 engines is carried out as a team effort involving 3-4 skilled engine technicians, but the details of its procedures and requisites change constantly, to improve safety, optimize resources, and respond to knowledge learned from field outcomes. This provides a challenge for development of training simulators, since simulated actions risk becoming obsolete rapidly and require costly reimplementation. This paper presents the development of a 3D mechanical maintenance training simulator for this context, using a low-cost simulation platform and a software architecture that separates simulation control from simulation visualization, in view of enabling more agile adaptation of simulators. This specific simulator aims to enable technician training to be enhanced with cooperation and context prior to the training phase with actual physical engines. We provide data in support of the feasibility of this approach, describing the requirements that were identified with the Portuguese Air Force, the overall software architecture of the system, the current stage of the prototype, and the outcomes of the first field tests with users. "}},{"citationKey":"Minor2014142","entryType":"article","entryTags":{"title":"Case-based adaptation of workflows ","journal":"Information Systems ","volume":"40","number":"","pages":"142 - 152","year":"2014","note":"","issn":"0306-4379","doi":"http://dx.doi.org/10.1016/j.is.2012.11.011","url":"http://www.sciencedirect.com/science/article/pii/S0306437912001536","author":"Mirjam Minor and Ralph Bergmann and Sebastian Gorg","keywords":["Workflow management","Adaptation","Case-based reasoning "],"abstract":"This paper presents on a Case-based Reasoning approach for automated workflow adaptation by reuse of experience. Agile workflow technology allows structural adaptations of workflow instances at build time or at run time. The approach supports the expert in performing such adaptations by an automated method. The method employs workflow adaptation cases that record adaptation episodes from the past. The recorded changes can be automatically transferred to a new workflow that is in a similar situation of change. First, the notion of workflow adaptation cases is introduced. The sample workflow modeling language \\{CFCN\\} is presented, which has been developed by the University of Trier as a part of the agile workflow management system Cake. Then, the retrieval of adaptation cases is briefly discussed. The case-based adaptation method is explained including the so-called anchor mapping algorithm which identifies the parts of the target workflow where to apply the changes. A formative evaluation in two application domains compares different variants of the anchor mapping algorithm by means of experts assessing the results of the automated adaptation. "}},{"citationKey":"BartheDelanoe2014171","entryType":"article","entryTags":{"title":"Event-driven agility of interoperability during the Run-time of collaborative processes ","journal":"Decision Support Systems ","volume":"59","number":"","pages":"171 - 179","year":"2014","note":"","issn":"0167-9236","doi":"http://dx.doi.org/10.1016/j.dss.2013.11.005","url":"http://www.sciencedirect.com/science/article/pii/S0167923613002868","author":"Anne-Marie Barthe-Delanoe and Sebastien Truptil and Frederick Benaben and Herve Pingaud","keywords":["Complex event processing","Agility","Adaptation","Decision making","Dynamic change","Interoperability "],"abstract":"Abstract The modern business environment tends to involve a large network of heterogeneous people, devices and organizations that engage in collaborative processes among themselves. Given the nature of this type of collaboration and the high degree of interoperability between partner Information Systems, these processes need to be agile in order to respond to changes in context, which may occur at any time during the collaborative situation. The objective is to build a Mediation Information System (MIS), in support of collaborative situations, whose architecture must be (i) built to be relevant to the collaborative situation under consideration, (ii) more easily integrated into the existing systems, and (iii) sufficiently agile, through its awareness of the environment and of process events, and through the way it reacts to events detected as being relevant. To apply agility mechanisms, it is crucial to detect the significant events that will lead to a subsequent evolution of the situation (detection step). Event-Driven Architecture (EDA) is used to design the structure of the part of the system that is in charge of \\{MIS\\} agility. This architecture takes the events into account, manages them and, if needed, uses them to trigger the adaptation of the MIS. We have defined a means to monitor the evolution of the situation. If relevant changes are detected, and if the situation does not evolve in the expected way, an adaptation is proposed. It is concluded that the principles of detection and adaptation, combined with the responsiveness of the system (provided by the automation of transitions), and based on Event Driven Architecture principles, together provide the agility required for collaborative processes. "}},{"citationKey":"Smiti2014250","entryType":"article","entryTags":{"title":"Integrative Control Approach for Agile Spacecraft Maneuvers ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"47","number":"1","pages":"250 - 254","year":"2014","note":"3rd International Conference on Advances in Control and Optimization of Dynamical Systems (2014) ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20140313-3-IN-3024.00237","url":"http://www.sciencedirect.com/science/article/pii/S1474667016326647","author":"M. Smiti and Payal Agarwal and K. Ashok and MP Rijesh and Singh K Jasvinder and P Natarajan","keywords":["Rest-to-Rest","Rate-to-Rate Maneuvers","Reaction wheels","Simulations "],"abstract":"Abstract Earth observation satellites require rapid attitude maneuvering and high pointing accuracy for imaging payloads. This paper presents the integrative control approach for maneuvering of Indian agile spacecrafts. The maneuver considered is a spot to spot, where the spacecraft has an initial non-zero angular rate and complete the maneuver with final imaging rate. Maneuver Iterative algorithm is used for computing the maneuver time between various imaging targets. The control algorithm is a state feedback form and can be incorporated for initial and final angular rates. The maneuver &amp; control algorithms are integrated together and have been demonstrated for typical rest to rest and rate to rate maneuvers. The Reaction Wheels are used as control actuator and feasibility of the algorithm for on-board implementation is demonstrated by digital simulations. "}},{"citationKey":"BachDabrowska20141577","entryType":"article","entryTags":{"title":"Optimization Model of Agile Team's Cohesion ","journal":"Procedia Computer Science ","volume":"35","number":"","pages":"1577 - 1585","year":"2014","note":"Knowledge-Based and Intelligent Information &amp; Engineering Systems 18th Annual Conference, KES-2014 Gdynia, Poland, September 2014 Proceedings ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.08.241","url":"http://www.sciencedirect.com/science/article/pii/S187705091401206X","author":"Irena Bach-Dabrowska and Pawel Pawlewski","keywords":["team's cohesion","team selection process","fuzzy logic","optimization; "],"abstract":"Abstract Team's cohesion is one of the most important factors of \\{IT\\} project execution effectiveness. Optimization of team's cohesion gives the possibility of reducing the risk of project failure. It also allows to increase the teamwork efficiency and thus optimize time of tasks execution, increase the guarantee of maintaining the scope of the project and the chance of achieving a given level of products quality. This article presents determination model of team's cohesion, in particular for teams working in Agile frameworks. Presented model is based on so called 'role patterns' and paradigm of fuzzy logic. It also presents optimization model of team members selection based on decision making in the so-called fuzzy environment. "}},{"citationKey":"Shen2014576","entryType":"article","entryTags":{"title":"E-science infrastructures for molecular modeling and parametrization ","journal":"Journal of Computational Science ","volume":"5","number":"4","pages":"576 - 589","year":"2014","note":"","issn":"1877-7503","doi":"http://dx.doi.org/10.1016/j.jocs.2014.01.005","url":"http://www.sciencedirect.com/science/article/pii/S1877750314000064","author":"Ning Shen and Ye Fan and Sudhakar Pamidighantam","keywords":["Science gateways","Cyberinfrastructure","E-science","GridChem","Virtual organizations","XSEDE","Scientific workflows","Science and engineering simulation and design","Computational chemistry","Molecular modeling "],"abstract":"Abstract E-science infrastructures are becoming the essential tools for computational scientific research. In this paper, we describe two e-science infrastructures: Science and Engineering Applications Grid (SEAGrid) and molecular modeling and parametrization (ParamChem). The \\{SEAGrid\\} is a virtual organization with a diverse set of hardware and software resources and provides services to access such resources in a routine and transparent manner. These essential services include allocations of computational resources, client-side application interfaces, computational job and data management tools, and consulting activities. ParamChem is another e-science project dedicated for molecular force-field parametrization based on both ab-initio and molecular mechanics calculations on high performance computers (HPCs) driven by scientific workflow middleware services. Both the projects share a similar three-tier computational infrastructure that consists of a front-end client, a middleware web services layer, and a remote \\{HPC\\} computational layer. The client is a Java Swing desktop application with components for pre- and post-data processing, communications with middleware server and local data management. The middleware service is based on Axis2 web service and MySQL relational database, which provides functionalities for user authentication and session control, \\{HPC\\} resource information collections, discovery and matching, job information logging and notification. It can also be integrated with scientific workflow to manage computations on \\{HPC\\} resources. The grid credentials for accessing \\{HPCs\\} are delegated through MyProxy infrastructure. Currently \\{SEAGrid\\} has integrated several popular application software suites such as Gaussian for quantum chemistry, \\{NAMD\\} for molecular dynamics and engineering software such as Abacus for mechanical engineering. ParamChem has integrated \\{CGenFF\\} (CHARMM General Force-Field) for molecular force-field parametrization of drug-like molecules. Long-term storage of user data is handled by tertiary data archival mechanisms. \\{SEAGrid\\} science gateway serves more than 500 users while more than 1000 users use ParamChem services such as atom typing and initial force-field parameter guess at present. "}},{"citationKey":"Unterholzner201470","entryType":"article","entryTags":{"title":"Improving refactoring tools in Smalltalk using static type inference ","journal":"Science of Computer Programming ","volume":"96, Part 1","number":"","pages":"70 - 83","year":"2014","note":"Special issue on Advances in Smalltalk based Systems ","issn":"0167-6423","doi":"http://dx.doi.org/10.1016/j.scico.2013.11.032","url":"http://www.sciencedirect.com/science/article/pii/S0167642313003250","author":"Martin Unterholzner","keywords":["Smalltalk","Type inference","Static type inference","Refactoring "],"abstract":"Abstract Refactoring is a crucial activity in agile software development. As a consequence, automated tools are expected to support refactoring, both for reducing the developer's effort as well as for avoiding errors due to manual changes. In this context, the chosen programming language has a major impact on the level of support that an automated refactoring tool can offer. One important aspect of a programming language concerning the automation of refactoring is the type system. While a static type system, present in languages such as Java, provides information about dependencies in the program, the dynamic type system of the Smalltalk programming language offers little information that can be used by automated refactoring tools. This paper focuses on the challenges in the context of refactoring raised by the dynamic type system of Smalltalk. It highlights the problems caused by the absence of static type information and proposes the use of static code analysis for performing type inference to gather information about the dependencies in the program's source code. It explains the mechanism of the static code analysis using sample code and presents a prototype of an enhanced refactoring tool, which uses the structural information extracted through static code analysis. Empirical samples build the base for evaluating the effectiveness of the approach. "}},{"citationKey":"Duke2014170","entryType":"article","entryTags":{"title":"Regenstrief Institute's Medical Gopher: A next-generation homegrown electronic medical record system ","journal":"International Journal of Medical Informatics ","volume":"83","number":"3","pages":"170 - 179","year":"2014","note":"","issn":"1386-5056","doi":"http://dx.doi.org/10.1016/j.ijmedinf.2013.11.004","url":"http://www.sciencedirect.com/science/article/pii/S1386505613002451","author":"Jon D. Duke and Justin Morea and Burke Mamlin and Douglas K. Martin and Linas Simonaitis and Blaine Y. Takesue and Brian E. Dixon and Paul R. Dexter","keywords":["Health information technology","Computerized physician order entry system","Electronic health record","Clinical decision support systems "],"abstract":"AbstractObjective Regenstrief Institute developed one of the seminal computerized order entry systems, the Medical Gopher, for implementation at Wishard Hospital nearly three decades ago. Wishard Hospital and Regenstrief remain committed to homegrown software development, and over the past 4 years we have fully rebuilt Gopher with an emphasis on usability, safety, leveraging open source technologies, and the advancement of biomedical informatics research. Our objective in this paper is to summarize the functionality of this new system and highlight its novel features. Materials and methods Applying a user-centered design process, the new Gopher was built upon a rich-internet application framework using an agile development process. The system incorporates order entry, clinical documentation, result viewing, decision support, and clinical workflow. We have customized its use for the outpatient, inpatient, and emergency department settings. Results The new Gopher is now in use by over 1100 users a day, including an average of 433 physicians caring for over 3600 patients daily. The system includes a wizard-like clinical workflow, dynamic multimedia alerts, and a familiar 'e-commerce'-based interface for order entry. Clinical documentation is enhanced by real-time natural language processing and data review is supported by a rapid chart search feature. Discussion As one of the few remaining academically developed order entry systems, the Gopher has been designed both to improve patient care and to support next-generation informatics research. It has achieved rapid adoption within our health system and suggests continued viability for homegrown systems in settings of close collaboration between developers and providers. "}},{"citationKey":"Johnstone201480","entryType":"article","entryTags":{"title":"Habitat loss, fragmentation and degradation effects on small mammals: Analysis with conditional inference tree statistical modelling ","journal":"Biological Conservation ","volume":"176","number":"","pages":"80 - 98","year":"2014","note":"","issn":"0006-3207","doi":"http://dx.doi.org/10.1016/j.biocon.2014.04.025","url":"http://www.sciencedirect.com/science/article/pii/S0006320714001761","author":"Christopher P. Johnstone and Alan Lill and Richard D. Reina","keywords":["Antechinus","Agilis","Swainsonii","Fuscipes","Habitat loss","Relative abundance","Performance indices","Conditional inference tree","Random forests "],"abstract":"Abstract Anthropogenic habitat loss, fragmentation and degradation often co-occur in a landscape and their relative influence on a native animals' health and survival can be difficult to determine. We examined the influence of these environmental variables on the estimated relative abundance of some small mammal species in a large area ([?]2500 km2) of southeastern Australia. Using the agile antechinus (Antechinus agilis) as a model, we also examined the association between these variables and three population performance indices, mass-size residuals (MSR; indexing fat reserves), the neutrophil/lymphocyte ratio (N:L; indexing physiological stress) and red blood cell counts (RBC; indexing regenerative anaemia). Study sites were in either highly disturbed and fragmented, or relatively undisturbed, continuous Eucalyptus forest. We generated conditional inference tree statistical models to identify the relative importance of up to 49 ecological variables in explaining variation in small mammal abundance and performance indices. Habitat loss was important in explaining small mammal abundance, as were the abundances of the same species in neighbouring study sites. The models also suggested that the habitat area required to support a 'healthy' population was greater in the larger species examined. Autocovariates of neighbouring site same-species abundances and habitat fragmentation were the next most important influences on small mammal relative abundance, implying that metapopulations may be important for population persistence, especially in bush rats (Rattus fuscipes). Habitat degradation, reflected in structural and floristic features, was less important, but explained some variance in relative abundances. For agile antechinus populations, time of year, degree of forest fragmentation and extent of native tree cover were important in explaining performance indices. Results indicated that habitat reduction per se was a significant threatening process for small mammals. Habitat loss requires at least the same research attention as that currently devoted to anthropogenic habitat fragmentation and degradation. "}},{"citationKey":"Esteban2014234","entryType":"article","entryTags":{"title":"Study of the \\{TRanspyrenean\\} Corridor in Comparison with Other Corridors in the Iberian Peninsula Using \\{GIS\\} Tools ","journal":"Procedia - Social and Behavioral Sciences ","volume":"160","number":"","pages":"234 - 243","year":"2014","note":"\\{XI\\} Congreso de Ingenieria del Transporte (CIT 2014) ","issn":"1877-0428","doi":"http://dx.doi.org/10.1016/j.sbspro.2014.12.135","url":"http://www.sciencedirect.com/science/article/pii/S1877042814062363","author":"Blanca Esteban and Susana Val and Fernando Roldan","keywords":["Rail","Transport of goods","TRANSPYRENEAN corridor","Hinterland","GIS "],"abstract":"Abstract This work is part of the collaboration agreement that Zaragoza Logistics Center maintains with Fundacion Transpirenaica to promote, encourage and boost the role of rail in the Peninsula and Europe As a result of the need to plan new routes for the transport of goods, in a more agile and flexible way to Europe, and given the current competition between peninsular logistics nodes, this paper aims to demonstrate the possibility of the coexistence of several corridors in the same territory, and its complementarity regarding certain studied parameters. The main objective of this study is to implement a spatial analysis of the hinterland of the Transpyrenean corridor using \\{GIS\\} (Geographic Information Systems) tools over other alternative corridors within the Iberian Peninsula for the transport of goods. For this analysis, we have used a number of variables, such as \\{GDP\\} (Gross Domestic Product) per capita, population density and proximity to the most important logistics nodes, which let us establish the comparison between corridors. The paper is structured as follows: First, it specifies the scope and objectives. Next, it describes the \\{GIS\\} tool used for the analysis and the necessary elements to set the scenario, such as cartography and attributes as well as other resources necessary to develop the maps. Third, it explains how to build and order information layers to represent spatial data after setting the coordinate system. Finally, it reflects the results and details the information that each one contains, and the main conclusions derived from them. "}},{"citationKey":"Michailidis2014456","entryType":"article","entryTags":{"title":"Influence of galvanization on the corrosion fatigue performance of high-strength steel ","journal":"Surface and Coatings Technology ","volume":"259, Part C","number":"","pages":"456 - 464","year":"2014","note":"","issn":"0257-8972","doi":"http://dx.doi.org/10.1016/j.surfcoat.2014.10.049","url":"http://www.sciencedirect.com/science/article/pii/S0257897214009670","author":"N. Michailidis and F. Stergioudi and G. Maliaris and A. Tsouknidas","keywords":["Corrosion fatigue","High-strength steel","Galvanization","Finite Element Modelling","Fracture "],"abstract":"Abstract This paper introduces a systematic methodology providing insights to the corrosion fatigue behaviour of high-strength steel C-ring specimens, through the development of an appropriate, fully automated, corrosion fatigue device. The apparatus is capable of adjusting the cyclic load and frequency applied on the specimens, whilst being submerged in a corrosive solution. A 3.5% NaCl solution was used as the corrosive medium for the purpose of this investigation, for both galvanized and uncoated specimens, as to quantify the effect of the coating on their fatigue response. The experimental process was simulated through Finite Element Modelling (FEM) to determine in-situ stress fields and elucidate crack propagation. The applied galvanizing process facilitated a prolongation of the corrosion fatigue endurance of the tested high-strength steel, allowing it to withstand a fourfold increased number of cycles to failure, when compared to the uncoated samples under identical conditions. The fractured surfaces of the specimens indicate a different failure mechanism for galvanized and uncoated high-strength steel. "}},{"citationKey":"Chang201448","entryType":"article","entryTags":{"title":"Review of life cycle assessment towards sustainable product development ","journal":"Journal of Cleaner Production ","volume":"83","number":"","pages":"48 - 60","year":"2014","note":"","issn":"0959-6526","doi":"http://dx.doi.org/10.1016/j.jclepro.2014.07.050","url":"http://www.sciencedirect.com/science/article/pii/S0959652614007690","author":"Danni Chang and C.K.M. Lee and Chun-Hsien Chen","keywords":["Life cycle assessment","Sustainable product development","Environmental issue","LCA tool "],"abstract":"Abstract Nowadays, environmental problems have aroused public awareness about the trade-off between economic growth and environmental conservation. In this regard, sustainable development plays a crucial role in striking a balance between the demands of social productivity and the reserves of natural resources. In the realm of sustainable development, life cycle assessment (LCA) is an important tool to assist in ensuring proper sustainability through assessing the environmental impacts of product designs. Unlike previous reviews, which mainly focus on \\{LCA\\} methodology, this paper presents \\{LCA\\} related studies from the perspective of product development applications. In this article, the approach on how \\{LCA\\} can be used in product development is introduced step by step, from concept design, part design, and process design to decision making. The applications of \\{LCA\\} come in different forms such as impact assessment, selection, classification and decision support. The issues or challenges with respect to the four steps of \\{LCA\\} (i.e. goal and scope definition, life cycle inventory, life cycle impact analysis, and interpretation) have been examined and investigated. Corresponding models and theories for coping with these challenges are reviewed. In particular, widespread and popular analytical tools are identified and highlighted. Considering the vague measurement of environmental impact in an agile manufacturing system, it is suggested that the development of \\{LCA\\} should keep pace with the advancing complex product development system. Overall, this article sheds light on the trend of \\{LCA\\} applications in sustainable product development and provides the prospect of promising research directions for \\{LCA\\} researchers and practitioners. "}},{"citationKey":"Eberle2014255","entryType":"article","entryTags":{"title":"Improving lead time of pharmaceutical production processes using Monte Carlo simulation ","journal":"Computers & Chemical Engineering ","volume":"68","number":"","pages":"255 - 263","year":"2014","note":"","issn":"0098-1354","doi":"http://dx.doi.org/10.1016/j.compchemeng.2014.05.017","url":"http://www.sciencedirect.com/science/article/pii/S0098135414001677","author":"Lukas Gallus Eberle and Hirokazu Sugiyama and Rainer Schmidt","keywords":["Monte Carlo simulation","Sensitivity analysis","Supply chain","Pharmaceutical production","Decision-making","Industrial application "],"abstract":"Abstract Reliable product supply is one of the most critical missions of the pharmaceutical industry. The lead time, i.e. the duration between start and end of an activity, needs to be well managed in any production facility in order to make scheduling predictable, agile and flexible. We present a method for measuring and improving production lead time of pharmaceutical processes with a primary focus on Parenterals (i.e. injectables) production processes. Monte Carlo simulation is applied for quantifying the total lead time (TLT) of batch production as a probability distribution and sensitivity analysis reveals the ranking of sub-processes by impact on TLT. Based on these results, what-if analyses are performed to evaluate effects of investments, resource allocations and process improvements on TLT. An industrial case study was performed at a production site for Parenterals of F. Hoffmann-La Roche in Kaiseraugst, Switzerland, where the presented method supported analysis and decision-making of production enhancements. "}},{"citationKey":"Noran20141032","entryType":"article","entryTags":{"title":"Collaborative disaster management: An interdisciplinary approach ","journal":"Computers in Industry ","volume":"65","number":"6","pages":"1032 - 1040","year":"2014","note":"","issn":"0166-3615","doi":"http://dx.doi.org/10.1016/j.compind.2014.04.003","url":"http://www.sciencedirect.com/science/article/pii/S0166361514000815","author":"Ovidiu Noran","keywords":["Interoperability","Enterprise architecture","Collaborative networks","Disaster management "],"abstract":"Abstract Large scale natural and man-made catastrophic events, triggered or augmented by regional conflicts, climate change and new disease strains appear to be steadily increasing in intensity and frequency. Proper preparation, response and recovery are required in order to cope with and survive large-scale disasters; unfortunately however, the institutions responsible for delivering emergency response services form a heterogeneous set that often under-performs due to lack of proper interoperation and collaboration. New innovative, holistic and integrated models, representing all essential aspects of the disaster events and response team participants are necessary to successfully meet these new challenges. Based on previous research and applications, this paper argues that the necessary artefacts can be built using an interdisciplinary, industry-based paradigm enabled by advances in the Interoperability, Collaborative Networks and Enterprise Architecture disciplines. This combined approach aims to provide a sound platform for efficient disaster response delivered by agile and synergic task force teams. "}},{"citationKey":"Guetat2014780","entryType":"article","entryTags":{"title":"Linking the Problem and the Solution Spaces in the Case of Urbanized Information Systems: A Framework for Organizational Processes Architecture ","journal":"Procedia Technology ","volume":"16","number":"","pages":"780 - 792","year":"2014","note":"\\{CENTERIS\\} 2014 - Conference on \\{ENTERprise\\} Information Systems / ProjMAN 2014 - International Conference on Project \\{MANagement\\} / \\{HCIST\\} 2014 - International Conference on Health and Social Care Information Systems and Technologies ","issn":"2212-0173","doi":"http://dx.doi.org/10.1016/j.protcy.2014.10.028","url":"http://www.sciencedirect.com/science/article/pii/S2212017314002552","author":"Sana Bent Aboulkacem Guetat and Salem Ben Dhaou Dakhli","keywords":["organizational process","organizational process architecture","information system urbanization","problem space","solution space","use case","service "],"abstract":"Abstract Modern organizations are facing many hard problems resulting from external and internal constraints related to global business competition, fast-changing business requirements, accelerated innovation, increasing cost pressures, and regulatory compliance challenges. Thus, to grow or even survive, they have to develop solutions to these problems. The effectiveness of such solutions is related on the one hand, to the quality of both the organizational solutions developed in the problem space and the computer solutions built in the solution space and on the other hand, to the effectiveness of the alignment between business and information technology. As noted by many authors, information systems urbanization facilitates building agile information systems and high quality computer solutions. In other words, urbanization is the main device for defining consistent information system architecture in the solution space. In this paper, we propose a framework for organizational processes architecture which provides instruments for building high quality organizational solutions in the problem space, and contributes to the alignment between business and urbanized information systems through linking the problem and the solution spaces. "}},{"citationKey":"Delgado201480","entryType":"article","entryTags":{"title":"Develop an Executable Architecture for a System of Systems: A Teaching Management Model ","journal":"Procedia Computer Science ","volume":"36","number":"","pages":"80 - 86","year":"2014","note":"Complex Adaptive Systems Philadelphia, \\{PA\\} November 3-5, 2014 ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.09.041","url":"http://www.sciencedirect.com/science/article/pii/S1877050914012903","author":"Dario J. Delgado and Rodrigo Torres-Saez and Ricardo Llamosa-Villalba","keywords":["Executable architecture","Petri nets","System of Systems","Teaching management model "],"abstract":"Abstract The architectural frameworks are increasingly being used to design and document many kinds of complex systems. This paper focuses at \\{DODAF\\} 2.0 to aid in the development of an executable architecture from a teaching management model (TMM) represented by a System of Systems (SoS). The principal goal is the using of a standard set of DoDAF artifacts (the Operational Activity Model OV-5, the Operational Rules and Operational State OV-6a and OV-6b, Logical Data Model OV-7) and the associated data to generate an executable model based on Petri Nets. With the \\{TMM\\} executable architecture develop from a particular teaching model that we call Agile School (AS) designed to function as a SoS. It seeks to demonstrate through simulation the correct logic of \\{AS\\} and the feasibility of the application of this model. And also, demonstrate how an architectural framework like DoDAF, could be used as a benchmark in the modeling and simulation of a SoS and the study of their feasibility. "}},{"citationKey":"Jackson2014245","entryType":"article","entryTags":{"title":"A channel-access protocol to utilize multiple heterogeneous channels for ad hoc networks ","journal":"Ad Hoc Networks ","volume":"13, Part B","number":"","pages":"245 - 255","year":"2014","note":"","issn":"1570-8705","doi":"http://dx.doi.org/10.1016/j.adhoc.2013.07.005","url":"http://www.sciencedirect.com/science/article/pii/S1570870513001637","author":"Crystal A. Jackson and Harlan B. Russell","keywords":["Distributed protocol","Ad hoc network","Multichannel MAC","Heterogeneous channels "],"abstract":"Abstract We introduce a new approach to channel access for ad hoc networks that utilize multiple heterogeneous channels. The radios of the ad hoc networks we investigate are frequency-agile allowing them the ability to change their carrier frequency and transmission rate over a wide range of possibilities. Our approach to channel access takes advantage of the multiple frequency bands available to the network to increase network-layer performance. We have previously found that in some network scenarios, the best network-layer performance is achieved if the channel-access protocol always selects the channel with the fastest data rate that is immediately available. However, in other network scenarios it is preferable to always wait for a channel with a faster data rate that is temporarily unavailable to become available rather than select a channel with a slower data rate that is immediately available. We show that our new channel-access protocol is able to adapt the strategy for selecting channels so that high network-layer performance is maintained in all scenarios compared to channel-access protocols that utilize either fixed strategy. "}},{"citationKey":"Mourtzis2014160","entryType":"article","entryTags":{"title":"Knowledge Enriched Short-term Scheduling for Engineer-to-order Products ","journal":"Procedia \\{CIRP\\} ","volume":"19","number":"","pages":"160 - 167","year":"2014","note":"2nd \\{CIRP\\} Robust Manufacturing Conference (RoMac 2014) ","issn":"2212-8271","doi":"http://dx.doi.org/10.1016/j.procir.2014.05.012","url":"http://www.sciencedirect.com/science/article/pii/S2212827114006404","author":"D. Mourtzis and M. Doukas and K. Vlachou and K. Fragou and C. Vandera","keywords":["Manufacturing Systems","Scheduling","Mobile Applications ; "],"abstract":"Abstract Contemporary shop-floors are highly affected by the ever-increasing complexity that is caused by the fluctuating customer demands. Therefore, a high degree of flexibility is needed and the scheduling of manufacturing tasks must be agile to changes. For addressing this challenge, this research work proposes a knowledge enriched short-term job-shop scheduling engine. More precisely, it focuses on the short-term scheduling of the resources of the machine shop, through an artificial intelligence algorithm that generates and evaluates alternative assignments of resources to tasks. Based on the requirements of a new order, a similarity mechanism retrieves successfully executed past orders together with a dataset that includes the processing times, the job and task sequence and the suitable resources. Afterwards it adapts these parameters to the requirements of the new order so as to evaluate the alternative schedules and identify a good alternative in a timely manner. The deriving schedule can be presented on mobile devices and it can be manipulated by the planner on-the-fly respecting tasks precedence constraints and machine availability. A case study from the mold making industry is used for validating the proposed framework. "}},{"citationKey":"Kaya2014275","entryType":"article","entryTags":{"title":"Exploring the Possibilities of Using Image Recognition Technology to Create a Hybrid Lean System for Pulse Methodology ","journal":"Procedia Computer Science ","volume":"28","number":"","pages":"275 - 284","year":"2014","note":"2014 Conference on Systems Engineering Research ","issn":"1877-0509","doi":"http://dx.doi.org/10.1016/j.procs.2014.03.035","url":"http://www.sciencedirect.com/science/article/pii/S1877050914000982","author":"Onur Kaya and Amer Catic and Dag Bergsjo","keywords":["Visual management","deviation management","hybrid systems","distributed teams "],"abstract":"Abstract Processes in product development are becoming more and more complex. A multitude of engineering disciplines are involved in the development of new products. New lean and agile methods arise. Pulse methodology is a lean deviation management methodology introduced by Scania in 2003, and since then many Swedish companies adapted it. It is based on synchronizing the company by frequently having short meetings (aka. pulse meetings) and visualizing the deviations using traffic coded magnets on whiteboards (aka. pulse boards). Even though the whiteboards lack providing efficient communication between distributed teams, still the users appreciate the simplicity of them. In this research, we presented a new methodology called hybrid pulse methodology, which solves the communication issues exist in the baseline methodology. We tested the methodology at the workshops we held in the companies, in simulated global meeting settings, using the demonstrator we developed for the methodology. This research contributes to the lean literature with a new methodology that ensures the synchronization of global organizations by providing efficient communication between distributed teams without damaging the baseline methodology. "}},{"citationKey":"Bannister2014119","entryType":"article","entryTags":{"title":"ICT, public values and transformative government: A framework and programme for research ","journal":"Government Information Quarterly ","volume":"31","number":"1","pages":"119 - 128","year":"2014","note":"","issn":"0740-624X","doi":"http://dx.doi.org/10.1016/j.giq.2013.06.002","url":"http://www.sciencedirect.com/science/article/pii/S0740624X13001184","author":"Frank Bannister and Regina Connolly","keywords":["eGovernance","eGovernment","Sustainability","Complexity","Literature review "],"abstract":"Abstract Many adjectives are used in the context of transforming government including making it more open, transparent, participative, agile, responsive and so forth. Most, if not all, of these adjectives are either in themselves public values or reflect one or more underlying public values. This paper examines the relationship between information and communications technology (ICT), transformative government and such public values and proposes a framework for further research. A study of the literature on public values is used to develop a typology of public sector values likely to be affected by ICT. This impact is examined for a number of these values. For others hypotheses about the impact of \\{ICT\\} on other values are then posited. It is argued that \\{ICTs\\} can and do have transformational impacts on public values, though not always for the better, concludes that values are a potential powerful lens for considering such impacts and sets out a programme of research into these relationships. "}},{"citationKey":"Kodagoda20147272","entryType":"article","entryTags":{"title":"Simultaneous people tracking and motion pattern learning ","journal":"Expert Systems with Applications ","volume":"41","number":"16","pages":"7272 - 7280","year":"2014","note":"","issn":"0957-4174","doi":"http://dx.doi.org/10.1016/j.eswa.2014.05.019","url":"http://www.sciencedirect.com/science/article/pii/S0957417414002991","author":"Sarath Kodagoda and Stephan Sehestedt","keywords":["People tracking","Motion pattern learning","Human Robot Interaction "],"abstract":"Abstract The field of Human Robot Interaction (HRI) encompasses many difficult challenges as robots need a better understanding of human actions. Human detection and tracking play a major role in such scenarios. One of the main challenges is to track them with long term occlusions due to agile nature of human navigation. However, in general humans do not make random movements. They tend to follow common motion patterns depending on their intentions and environmental/physical constraints. Therefore, knowledge of such common motion patterns could allow a robotic device to robustly track people even with long term occlusions. On the other hand, once a robust tracking is achieved, they can be used to enhance common motion pattern models allowing robots to adapt to new motion patterns that could appear in the environment. Therefore, this paper proposes to learn human motion patterns based on Sampled Hidden Markov Model (SHMM) and simultaneously track people using a particle filter tracker. The proposed simultaneous people tracking and human motion pattern learning has not only improved the tracking robustness compared to more conservative approaches, it has also proven robustness to prolonged occlusions and maintaining identity. Furthermore, the integration of people tracking and on-line \\{SHMM\\} learning have led to improved learning performance. These claims are supported by real world experiments carried out on a robot with suite of sensors including a laser range finder. "}},{"citationKey":"Niv20141616","entryType":"article","entryTags":{"title":"Sequential capsule endoscopy of the small bowel for follow-up of patients with known Crohn's disease ","journal":"Journal of Crohn's and Colitis ","volume":"8","number":"12","pages":"1616 - 1623","year":"2014","note":"","issn":"1873-9946","doi":"http://dx.doi.org/10.1016/j.crohns.2014.03.003","url":"http://www.sciencedirect.com/science/article/pii/S1873994614000981","author":"Eva Niv and Sigal Fishman and Helena Kachman and Ruth Arnon and Iris Dotan","keywords":["Capsule endoscopy","Crohn's disease","Sequential capsule studies","Mucosal healing","Video capsule "],"abstract":"AbstractBackground and Aims The aim of this study was to perform sequential small bowel (SB) capsule endoscopy (CE) studies in patients with known active Crohn's disease (CD) during different treatments, to characterize the changes in the \\{SB\\} mucosa over time, and to correlate the \\{CE\\} findings with clinical and laboratory parameters of inflammation. Methods Consecutive patients with known moderately active \\{CD\\} were prospectively recruited. After proven patency with Agile capsule, \\{CE\\} studies were performed at baseline and after 4, 12 and 24 weeks. \\{CE\\} parameters and a Lewis score were calculated. Clinical and laboratory parameters were correlated. A control group of 178 non-CD patients was used for comparisons. Results Thirty-one \\{CD\\} patients were recruited and 19 met the inclusion criteria. A total of 43 \\{CE\\} studies were performed over the time. There was no capsule retention despite a high rate of previous \\{SB\\} surgery. The mean baseline CDAI, \\{IBDQ\\} and Lewis scores were 306 +- 56, 135 +- 26.6 and 1730 +- 1780, respectively. There was no correlation at the baseline between clinical and laboratory parameters (CDAI, CRP, IBDQ) and mucosal disease (Lewis scores). \\{CDAI\\} and \\{IBDQ\\} changes over a period of 4 and 12 weeks did not correlate with the Lewis score. The cecum arrival rate of the \\{CD\\} patients was significantly lower (p = 0.0047) and the \\{SB\\} transit time was significantly longer (p = 0.005) compared to those of the controls. Conclusions Sequential \\{CE\\} studies are feasible and safe in \\{CD\\} patients. In patients with complete \\{CE\\} studies, they provide reliable information on mucosal changes in \\{CD\\} and should be considered as an independent and objective follow-up tool in known \\{CD\\} patients. "}},{"citationKey":"Heinla201466","entryType":"article","entryTags":{"title":"Enrichment and individual housing reinforce the differences in aggressiveness and amphetamine response in 129S6/SvEv and C57BL/6 strains ","journal":"Behavioural Brain Research ","volume":"267","number":"","pages":"66 - 73","year":"2014","note":"","issn":"0166-4328","doi":"http://dx.doi.org/10.1016/j.bbr.2014.03.024","url":"http://www.sciencedirect.com/science/article/pii/S0166432814001788","author":"Indrek Heinla and Este Leidmaa and Tanel Visnapuu and Mari-Anne Philips and Eero Vasar","keywords":["Mouse strains","Enrichment","BDNF","Amphetamine","Hippocampus","Aggressiveness "],"abstract":"Abstract As different kinds of enrichment equipment are applied to standard rodent laboratory housing conditions in Europe (Directive 2010/63/EU) and worldwide, it is essential to understand how it may influence the brain and behaviour of animals. We observed common inbred mouse strains 129S6/SvEv/Tac (129) and C57BL/6 Bkl (B6) reared in 3 different environments: standard housing (SH), individual housing (IH) and enriched environment (EE). We measured common behavioural parameters, social behaviour and \\{BDNF\\} mRNA expression in hippocampus and frontal cortex. Our results demonstrate that the robust behavioural differences between \\{B6\\} and 129 mouse strains which are well studied in the literature persist in varied housing conditions, but the response to these conditions has different directionality in studied strains. \\{EE\\} appears to reinforce the existing coping strategies in both strains: \\{B6\\} became more agile, sensitive and venturous in behavioural models, whereas 129 became even more inhibited than they are in standard conditions. The stimulating effect of amphetamine is decreased in 129 animals that have been reared in EE. This may indicate desensitisation or inhibition of their dopamine system by EE. A frequently used biomarker in enrichment studies, BDNF, is a likely mediator for the long-term phenotype effects of EE. In this paper we demonstrate the differences of \\{BDNF\\} expression pattern in 129 and \\{B6\\} mice. "}},{"citationKey":"Muppala20142351","entryType":"article","entryTags":{"title":"Multi-tier service differentiation by coordinated learning-based resource provisioning and admission control ","journal":"Journal of Parallel and Distributed Computing ","volume":"74","number":"5","pages":"2351 - 2364","year":"2014","note":"","issn":"0743-7315","doi":"http://dx.doi.org/10.1016/j.jpdc.2014.01.004","url":"http://www.sciencedirect.com/science/article/pii/S0743731514000069","author":"Sireesha Muppala and Guihai Chen and Xiaobo Zhou","keywords":["Scalable Internet services","Performance differentiation","Virtualized servers","Reinforcement learning","Cascade neural networks "],"abstract":"Abstract Multiple Internet applications are often hosted in one datacenter, sharing underlying virtualized server resources. It is important to provide differentiated treatment to co-hosted applications and to improve overall system performance by efficient use of shared resources. Challenges arise due to multi-tier service architecture, virtualized server infrastructure, and highly dynamic and bursty workloads. We propose a coordinated admission control and adaptive resource provisioning approach for multi-tier service differentiation and performance improvement in a shared virtualized platform. We develop new model-independent reinforcement learning based techniques for virtual machine (VM) auto-configuration and session based admission control. Adaptive \\{VM\\} auto-configuration provides proportional service differentiation between co-located applications and improves application response time simultaneously. Admission control improves session throughput of the applications and minimizes resource wastage due to aborted sessions. A shared reward actualizes coordination between the two learning modules. For system agility and scalability, we integrate the reinforcement learning approach with cascade neural networks. We have implemented the integrated approach in a virtualized blade server system hosting \\{RUBiS\\} benchmark applications. Experimental results demonstrate that the new approach meets differentiation targets accurately and achieves performance improvement of applications at the same time. It reacts to dynamic and bursty workloads in an agile and scalable manner. "}},{"citationKey":"Monostori20144246","entryType":"article","entryTags":{"title":"Cooperative Control in Production and Logistics ","journal":"\\{IFAC\\} Proceedings Volumes ","volume":"47","number":"3","pages":"4246 - 4265","year":"2014","note":"19th \\{IFAC\\} World Congress ","issn":"1474-6670","doi":"http://dx.doi.org/10.3182/20140824-6-ZA-1003.01026","url":"http://www.sciencedirect.com/science/article/pii/S1474667016422688","author":"Laszlo Monostori and Paul Valckenaers and Alexandre Dolgui and Herve Panetto and Mietek Brdys and Balazs Csanad Csaji","keywords":["intelligent manufacturing systems","complex systems","agents","production control","distributed control","predictive control","adaptive control","machine learning","optimization "],"abstract":"Abstract This is a milestone paper of the Coordinating Committee on Manufacturing and Logistics Systems (CC5) of the International Federation of Automatic Control (IFAC). Classical applications of control engineering and information and communication technology (ICT) in production and logistics are often done in a rigid, centralized and hierarchical way. These inflexible approaches are typically not able to cope with the complexities of the manufacturing environment, such as the instabilities, uncertainties and abrupt changes caused by internal and external disturbances, or a large number and variety of interacting, interdependent elements. A paradigm shift, e.g., novel organizing principles and methods, is needed for supporting the interoperability of dynamic alliances of agile and networked systems. Several solution proposals argue that the future of manufacturing and logistics lies in network-like, dynamic, open and reconfigurable systems of cooperative autonomous entities. The paper overviews various distributed approaches and technologies of control engineering and \\{ICT\\} that can support the realization of cooperative structures from the resource level to the level of networked enterprises. Standard results as well as recent advances from control theory, through cooperative game theory, distributed machine learning to holonic systems, cooperative enterprise modelling, system integration, and autonomous logistics processes are surveyed. A special emphasis is put on the theoretical developments and industrial applications of Robustly Feasible Model Predictive Control (RFMPC). Two case studies are also discussed: i) a holonic, PROSA-based approach to generate short-term forecasts for an additive manufacturing system by means of a delegate multi-agent system (D-MAS); and ii) an application of distributed \\{RFMPC\\} to a drinking water distribution system. "}},{"citationKey":"BaronMaldonado201440","entryType":"article","entryTags":{"title":"Como una microempresa logro un desarrollo de productos agil y generador de valor empleando Lean ","journal":"Estudios Gerenciales ","volume":"30","number":"130","pages":"40 - 47","year":"2014","note":"","issn":"0123-5923","doi":"http://dx.doi.org/10.1016/j.estger.2014.02.007","url":"http://www.sciencedirect.com/science/article/pii/S0123592314000473","author":"Diana Isabel Baron Maldonado and Leonardo Rivera Cadavid","keywords":["Sector confeccion","Desarrollo de producto Lean","Ingeniero jefe","Apparel sector","Lean Product Development","Chief engineer-chave","Sector confeccao","Desenvolvimento de produto Lean","Engenheiro chefe "],"abstract":"Resumen El proposito del presente articulo es mostrar un ejemplo de como una microempresa puede hacer que su desarrollo de productos sea mas agil, flexible y generador de valor empleando Lean. Se tomaron como referentes el proceso generico de desarrollo de productos, el proceso de desarrollo tradicional en el sector de confecciones, el sistema Toyota de desarrollo de productos y el antiguo sistema de desarrollo de la empresa. Se destacan el rol del lugar de reunion virtual y el papel del ingeniero jefe en el nuevo sistema de desarrollo de productos. Como resultado se obtuvo un sistema mas enfocado en el cliente, con mejor velocidad de respuesta y produccion Justo a Tiempo. Abstract This paper presents an example of a small company transforming its product development system to make it more agile, flexible, and value-generating using Lean. We used the generic product development system, the traditional product development system employed in the apparel sector, the Toyota product development system, and the previous development system used in the company, as reference to configure the new one. Two main elements in the new product development system are the virtual meeting place and the role of the chief engineer. As a result, the new system is more client-oriented, has faster response time and has Just in Time production. "}},{"citationKey":"Xing201420","entryType":"article","entryTags":{"title":"Hybrid motion graph for character motion synthesis ","journal":"Journal of Visual Languages & Computing ","volume":"25","number":"1","pages":"20 - 32","year":"2014","note":"Special Issue on Multimedia Information Processing ","issn":"1045-926X","doi":"http://dx.doi.org/10.1016/j.jvlc.2013.10.001","url":"http://www.sciencedirect.com/science/article/pii/S1045926X13000554","author":"Weiwei Xing and Xiang Wei and Jian Zhang and Cheng Ren and Wei Lu","keywords":["Motion synthesis","Motion graph","Motion fields","Motion template","Motion transition "],"abstract":"AbstractObjective This paper proposes a novel framework of Hybrid Motion Graph (HMG) for creating character animations, which enhances the graph-based structural control by motion field representations for efficient motion synthesis of diverse and interactive character animations. Methods In \\{HMG\\} framework, the motion template of each class is automatically derived from the training motions for capturing the general spatio-temporal characteristics of an entire motion class. Typical motion field for each class is then constructed. The smooth transitions among motion classes are then generated by interpolating the related motion templates with spacetime constraints. Finally, a hybrid motion graph is built by integrating the separate motion fields for each motion class into the global structural control of motion graph through smooth transition. Results In motion synthesis stage, a character may freely 'switch' among different motion classes in the hybrid motion graph via smooth transitions between motion templates and 'flow' within each class through the continuous space of motion field with agile and the continuous control process. Conclusion Experimental results show that our framework realizes the fast connectivity among different motion classes and high responsiveness and interactivity for creating realistic character animation of rich behaviors with limited motion data and computational resources. "}},{"citationKey":"Constantinescu2014246","entryType":"article","entryTags":{"title":"Modeling of System Knowledge for Efficient Agile Manufacturing: Tool Evaluation, Selection and Implementation Scenario in \\{SMEs\\} ","journal":"Procedia \\{CIRP\\} ","volume":"25","number":"","pages":"246 - 252","year":"2014","note":"8th International Conference on Digital Enterprise Technology - \\{DET\\} 2014 Disruptive Innovation in Manufacturing Engineering towards the 4th Industrial Revolution ","issn":"2212-8271","doi":"http://dx.doi.org/10.1016/j.procir.2014.10.035","url":"http://www.sciencedirect.com/science/article/pii/S221282711401066X","author":"C.L. Constantinescu and D. Matarazzo and D. Dienes and E. Francalanza and M. Bayer","keywords":["System Knowledge","SysML","Simulation "],"abstract":"Abstract In the manufacturing world, knowledge is fundamental in order to achieve effective and efficient real time decision making. In order to make manufacturing system knowledge available to the decision maker it has to be first captured and then modelled. Therefore tools that provide a suitable means for capturing and representation of manufacturing system knowledge are required in several types of industrial sectors and types of company's (large, SME). A literature review about best practice for capturing requirements for simulation development and system knowledge modeling has been conducted. The aim of this study was to select the best tool for manufacturing system knowledge modelling in an open-source environment. In order to select this tool, different criteria were selected, based on which several tools were analyzed and rated. An exemplary use case was then developed using the selected tool, Systems Modeling Language (SysML). Therefore, the best practice has been studied, evaluated, selected and then applied to two industrial use cases by the use of a selected opens source tool. "}}]